const zakr_1 =
    'بسمِ اللَّهِ الرحمَٰنِ الرحيم ، الحَمد لِلَّهِ رَبِّ العَٰلمِين ، الرحمَٰنِ الرحيم ، مَٰلِكِ يومِ الدينِ ، إِيَّاك نَعبُدُ وإِيَّاك نستعِين ، اهدِنا الصِّرَٰط المُستقِيم ، صِرَٰط الذِين أَنعَمت عليهِم غيرِ المَغضُوبِ عَليهِم وَلَا الضآلينَ ';
const zakr_2 =
    'اللَّهُ لَا إِلهَ إِلا هُوَ الحَي القيومُ لَا تأخُذهُ سِنَة وَلَا نَوم لهُ مَا فِي السمَاوَاتِ وَمَا فِي الأرضِ مَن ذا الذِي يَشفعُ عِندَهُ إِلا بإِذنهِ يَعلمُ مَا بينَ أَيديهِم وَما خلفهُم وَلَا يُحِيطون بِشيء من عِلمهِ إِلا بمَا شاءَ وَسِع كُرسِيهُ السماواتِ وَالأرضَ وَلَا يَئُودُهُ حِفظهُمَا وَهوَ العَلِيُّ العَظِيم';
const zakr_3 =
    'آمنَ الرسول بِمَا أنزِل إِلَيهِ مِن رَبهِ وَالمؤمِنونَ كلّ آمنَ بِاللَّهِ ومَلائكتِهِ وكُتبِهِ ورسُلِهِ لَا نفرق بَين أحدٍ مِن رسُلِهِ وقالوا سَمِعنا وأطعنا غُفرانك ربنا وإِليك المصِير ، لا يُكلف اللَّهُ نفسًا إِلا وسعهَا لها ما كسبت وعليهَا ما اكتسبَت رَبنا لَا تُؤاخِذنا إِن نسِينآ أَو أَخطأنا رَبنا ولا تحمِل عَلينا إِصرًا كَما حمَلتهُ على الذِين مِن قبلنا رَبنا ولَا تحَمّلنا ما لَا طاقة لَنا بِهِ وَاعفُ عَنا واغفِر لَنا وارحَمنا أنت مولَانا فانصُرنا عَلى القومِ الكافرِين';

const zakr_4 =
    'بِسمِ اللهِ الرحمنِ الرحِيم  \nقُل هُو اللَّه أحَد ، اللَّه الصمَد لم يَلد ، وَلم يُولد ، وَلَم يَكُن لَّهُۥ كُفُوًا أحَد';

const zakr_5 =
    'بِسمِ اللهِ الرحمنِ الرحِيم\nقُل أعُوذ بِرَب الفَلَقِ ، مِن شَر مَا خلق ، ومِن شرِّ غاسقٍ إذا وقبَ ، ومِن شرِّ النفثَٰتِ فى العُقدِ ، ومن شرِّ حَاسدٍ إذا حسَد';
const zakr_6 =
    'بِسمِ اللهِ الرحمنِ الرحِيم\nقُل أعُوذ برَبِّ الناسِ ، مَلِكِ الناسِ ، إِلَٰهِ الناسِ ، مِن شَرِّ الوسوَاسِ الخناسِ ، الذِى يُوَسوِسُ فِى صُدُورِ الناسِ ، مِن الجِنَّةِ وَالناسِ';

const zakr_7 =
    'أصبحنا وأصبح المـلكُ لله والحَمدُ لله، لا إلهَ إلا اللّه وحدَهُ لا شريكَ لهُ، لهُ المُـلكُ ولهُ الحَمـد، وهوَ على كل شَيءٍ قدير';

const zakr_8 =
    'أمسَيـنا وأمسـى المـلكُ لله والحَمدُ لله، لا إلهَ إلا اللّه وحدَهُ لا شريكَ لهُ، لهُ المُـلكُ ولهُ الحَمـد، وهوَ على كل شَيءٍ قدير';

const zakr_9 =
    'اللهُم إني أَصبَحتُ مِنك فِي نِعمَة وعافِية وسِتر فأَتِم عَليَّ نِعمتك وعافِيتك وسِترك فِي الدنيا والآخِرة';

const zakr_10 =
    'اللهُم إني أَمسيتُ مِنك فِي نِعمَة وعافِية وسِتر فأَتِم عَليَّ نِعمتك وعافِيتك وسِترك فِي الدنيا والآخِرَة';

const zakr_11 =
    'رَضيـتُ بالله ربـاً وبالإسلامِ ديـناً وبِمحَـمدٍ صلِّى الله عليه وسلم نَبِيـاً ورَسُولًا';
const zakr_12 =
    'اللّهـم أنتَ رَبِـي لا إلهَ إلا أنتَ خَلقتنـي وأنا عَبـدُك، وأنا علـى عَهـدِكَ وَوعـدِك ما استـطعـت، أعـوذُ بِكَ مِن شـرِ ما صَنـعت، أبـوءُ لـك بِنِعـمَتِـك علـيَّ وأبـوءُ بذنـبي فاغفـِر لي فإِنـهُ لا يَغـفِرُ الذنـوبَ إِلا أنت';
const zakr_13 =
    'حَسبِـيَ اللّه لا إلهَ إلا هُوَ عَلـيهِ توكـلتُ وهُوَ رَبُّ العَرشِ العَظـيم';
const zakr_14 =
    'سُبحـانَ الله وبِحمـدِه عددَ خلـقِه ورضـا نفسِـه وزِنَـة عَـرشِـه ومِـدادَ كلِمـاتـه';
const zakr_15 =
    'أستَغفِر الله العظِيمَ الذِي لاَ إلهَ إلا هوَ الحَي القيوم وأتوبُ إليهِ';
const zakr_16 = 'ياربِّ لك الحمدُ كمَا ينبغِي لِجلَالِ وجهِك ولِعظِيمِ سُلطانك';
const zakr_17 =
    'اللهُـم عافِـني في بَدَنـي، اللهُـم عافِـني في سَمـعي، اللهُـم عافِـني في بَصَـري، لا إلهَ إلا أنـت';
const zakr_18 =
    'اللهُـم إِنِـي أسـألـكَ العـفوَ والعـافِـية في الدنـيا وَالآخِـرَة، اللهُـم إِنِّـي أسـألـك العـفوَ وَالعـافِـية في ديني ودنـيايَ وأهـلي ومالـي، اللهُـم استُـر عـوراتي وآمِـن رَوعاتـي، اللهُـم احفظـني من بـينِ يدي ومِن خلفـي وعن يمـيني وعن شِمـالي ومن فوقـي، وأعـوذ بِعَظمـتِك أن أُغـتالَ من تحتـي';
const zakr_19 =
    'يا حَي يَا قيومُ بِرَحمتِك أستغِيث أصلِح لِي شأنِي كلهُ ولاَ تكِلني إلَى نفسِي طـرفة عَين';
const zakr_20 =
    'اللهُـم عالِـمَ الغـيبِ والشـهادةِ فاطِـر السّماواتِ وَالأرضِ رَبَّ كـلِ شـيء وَمَليـكه، أَشهَـدُ أن لا إِلـهَ إِلا أنت، أعـوذ بِك مِن شـرِّ نفسـي ومِن شـرِّ الشيـطان وشِركهِ، وأن أَقتـرِفَ عَلـى نَفسـي سوءاً أو أجُـرهُ إِلـى مسـلم';
const zakr_21 =
    'بِسـمِ الله الذي لا يضُـر مع اسمِـه شَيء في الأرضِ وَلا في السمـاءِ وهـوَ السّمـيعُ العَلـيم';
const zakr_22 = 'أعـوذ بكلِمـاتِ اللّه التـامـاتِ مِن شَـرِ ما خَلـق';
const zakr_23 =
    'اللهُـم إِنَّا نعوذ بكَ مِن أن نُشرك بكَ شيئا نعلمُهُ، ونستغفِرك لمَا لَا نعلمهُ';
const zakr_24 =
    'اللهُـم إني أعُوذ بك مِن الهم والحزنِ، وأعُوذ بك من العَجزِ والكسَلِ، وأعُوذ بك من الجُبن والبُخل، وأعُوذ بك مِن غلبةِ الدينِ وقهر الرجالِ';
const zakr_25 = 'اللهُـم صَلِّ وَسَلِم وبَارِك على سيدِنَا مُحمَّد';

const zakr_26 =
    'لَا إلَه إلا اللهُ وَحدهُ لَا شريكَ لهُ، لهُ المُلكُ ولهُ الحمدُ وهوَ علَى كُل شَيءِ قدِيرِ';

const zakr_27 = 'سبحان الله وبحمده';
