const int sectionIndex = 1;
const String sectionTitle = 'مواقفه فى حياة النبى ﷺ';

const List t1 = ['1', 'إسلامه رضى الله عنه'];
const List t2 = ['2', 'مَا أَنزلنا عَليك القُرآن لِتشقى'];
const List t3 = ['3', 'حبه للحق'];
const List t4 = ['4', 'عُمر الفاروق'];
const List t5 = ['5', 'الهجرة'];
const List t6 = ['6', 'ما يبكيك يا عُمر'];

const String p1 =
    'هو أبو حفص عمر بن الخطاب العدوي القرشي، المُلقب بالفاروق، هو ثاني الخلفاء الراشدين وأحد العشرة المبشرين بالجنة.';

const String p2 =
    'لقيه نُعَيم بن عبد الله في الطريق وكان من الذين أخفوا إسلامهم، فقال له: أين تريد يا عمر؟ فرد عليه قائلا: أريد محمدا الذي فرق أمر قريش، فلمّا عرف أنه يتجه لقتل النبي قال له: والله لقد غرتك نفسك يا عمر أترى بني عبد مناف تاركيك تمشي على الارض وقد قتلت محمدا؟ أفلا ترجع إلى أهل بيتك فتقيم أمرهم؟ فإن ابن عمك سعيد بن زيد بن عمرو وأختك فاطمة بنت الخطاب قد والله أسلما وتابعا محمدًا على دينه فعليك بهما، فانطلق مسرعاً غاضباً إليهما فوجد الصحابي خباب بن الأرت يجلس معهما يعلمهما القرآن فضرب سعيدًا ثم ضرب فاطمة ضربة قوية شقت وجهها فسقطت منها صحيفة كانت تحملها.';

const String p3 =
    'وحين أراد عمر قراءة ما فيها أبت أخته أن يحملها إلا أن يتوضأ فتوضأ عمر وقرأ الصحيفة وإذ فيها: طه مَا أَنزَلنا عَليكَ القرآنَ لِتشقى إِلَا تذكِرَةً لِمن يَخشى تَنزِيلًا مِمَّن خلقَ الأَرضَ وَالسمَاوَاتِ العُلَا.';
const String p4 =
    'فاهتز عمر وقال: ما هذا بكلام البشر وأسلم من ساعته، خرج عمر بعد ذلك إلى دار الأرقم بن أبي الأرقم حيث كان يجتمع النبي محمد بأصحابه وأعلن إسلامه هناك واستجاب الله لدعوة النبي محمد إذ قال: اللهم أعز الإسلام بأحد العمرين، عمر بن الخطاب أو عمرو بن هشام قال: وكان أحبهما إليه عمر.';

const String p5 =
    'كان المسلمون قبل إسلام عمر وحمزة يخفون إيمانهم خوفًا من تعرضهم للأذى، أما بعد إسلامهما فأصبح للمسلمين من يدافع عنهم ويحميهم، وكان عمر يجاهر بالإسلام ولا يخشى أحداً فلم يرضَ عن أداء المسلمين للصلاة في شعاب مكة بل فضل مواجهة القوم بكل عزم، فقام وقال للنبي: يا رسول الله ألسنا على الحق؟ فأجابه: نعم قال عمر: أليسوا على الباطل؟ فأجابه: نعم فقال عمر بن الخطاب: ففيمَ الخفية؟ قال النبي: فما ترى يا عمر؟ قال عمر: نخرج فنطوف بالكعبة فقال له النبي: نعم يا عمر.';

const String p6 =
    'فخرج المسلمون لأول مرة يكبرون ويهللون في صفين صف على رأسه عمر بن الخطاب وصف على رأسه حمزة بن عبد المطلب وبينهما النبي محمد، حتى دخلوا وصلّوا عند الكعبة، ومن بعيدٍ نظرت قريش إلى عمر وإلى حمزة وهما يتقدمان المسلمين، فَعَلتْ وجوهَهُم كآبة شديدة يقول عمر: فسماني رسول الله ﷺ يومئذٍ بالفاروق.';
const String p7 =
    'و قال عبد الله بن مسعود: ما كنا نقدر أن نصلّي عند الكعبة حتى أسلم عمروما زلنا أعِزَّة منذ أسلم عمر.';

const String p8 =
    'لبس سيفه ووضع قوسه على كتفه وحمل أسهمًا وعصاه القوية وذهب إلى الكعبة طاف سبع، ثم توجه إلى مقام إبراهيم فصلى، ثم قال لحلقات المشركين المجتمعة: شاهت الوجوه، لا يُرغم الله إلا هذه المعاطس، من أراد أن تثكله أمه وييتم ولده أو يُرمل زوجته فليلقني وراء هذا الوادي، فلم يتبعه أحد منهم إلا قوم مستضعفون.';

const String p9 =
    'دخل عمر رضي الله عنه على النبي ﷺ وهو على حصير، وتحت رأسه وسادة من أدم حشوها ليف، قال: فرأيت أثر الحصير في جنب رسول الله ﷺ ، فبكيت، فقال رسول الله ﷺ : ما يبكيك؟ فقلت: يا رسول الله، إن كسرى وقيصر فيما هما فيه، وأنت رسول الله، فقال ﷺ : أما ترضى أن تكون لهما الدنيا ولك الآخرة.';
