const int sectionIndex = 2;
const String sectionTitle = 'فى خلافته رضى الله عنه';

const List t8 = ['8', 'جمع القرآن'];
const List t9 = ['9', 'مصحف عثمان ولسان قريش'];
const List t10 = ['10', 'فتوحات عثمان'];
const List t11 = ['11', 'عزل عمرو بن العاص'];
const List t12 = ['12', 'الوقيعة بين عثمان وعمرو'];

const String p15 =
    'فى خلافته رضى الله عنه جاء حذيفة بن اليمان على عثمان وكان يغازي أهل الشام في فتح أرمينية وأذربيجان مع أهل العراق، فأفزع حذيفة اختلافهم في القراءة فقال حذيفة لعثمان: يا أمير المؤمنين أدرك هذه الأمة قبل أن يختلفوا في الكتاب اختلاف اليهود والنصارى.';
const String p16 =
    'فأرسل عثمان إلى حفصة أن أرسلي إلينا بالصحف ننسخها في المصاحف ثم نردها إليك، فأرسلت بها حفصة إلى عثمان، فأمر زيد بن ثابت وعبد الله بن الزبير وسعيد بن العاص وعبد الرحمن بن الحارث بن هشام فنسخوها في المصاحف.';
const String p17 =
    'وقال عثمان للرهط القرشيين الثلاثة: إذا اختلفتم أنتم وزيد بن ثابت في شيء من القرآن فاكتبوه بلسان قريش فإنما نزل بلسانهم، ففعلوا حتى إذا نسخوا الصحف في المصاحف رد عثمان الصحف إلى حفصة، فأرسل إلى كل أفق بمصحف مما نسخوا، وأمر بما سواه من القرآن في كل صحيفة أو مصحف أن يحرق.';
const String p18 =
    'والفرق بين جمع أبي بكر وجمع عثمان أن جمع أبي بكر كان لخشيته أن يذهب شيء من القرآن بذهاب حملته، لأنه لم يكن مجموعا في موضع واحد فجمعه في صحائف مرتبًا لآيات سوره على ما وقفهم عليه النبي، وجمع عثمان كان لما كثر الاختلاف في وجوه القراءة حتى قرؤوه بلغاتهم على اتساع اللغات، فأدى ذلك إلى تخطئة بعضهم البعض.';
const String p19 =
    'فخشى من تفاقم الأمر في ذلك فنسخ تلك الصحف في مصحف واحد مرتبًا لسوره، واقتصر في سائر اللغات على لغة قريش محتجاً بأنه نزل بلغتهم، وإن كان قد وسع في قراءاته بلغة غيرهم، دفعاً للحرج والمشقة في ابتداء الأمر، فرأى أن الحاجة قد انتهت، فاقتصر على لغة واحدة.';
const String p20 =
    'فُتحت العديد من البلدان وتوسعت الدولة الإسلامية في أيام خلافته وفُتحت أرمينية وخراسان وكرمان وسجستان وإفريقية وقبرص ونشأ أول أسطول بحري إسلامي لحماية الشواطئ الإسلامية من هجمات البيزنطيين.';
const String p21 =
    'عزله عثمان عن مصر وولى عليها عبد الله بن سعد بن أبي سرح، وكان سبب ذلك أن الخوارج من المصريين كانوا محصورين من عمرو بن العاص، مقهورين معه لا يستطيعون أن يتكلموا بسوء في خليفة ولا أمير، فما زالوا يعملون عليه حتى شكوه إلى عثمان، لينزعه عنهم ويولي عليهم من هو ألين منه ، فلم يزل ذلك دأبهم حتى عزل عمرا عن الحرب وتركه على الصلاة ، وولى على الحرب والخراج عبد الله بن سعد بن أبي سرح.';
const String p22 =
    'ثم سعوا فيما بينهما بالنميمة فوقع بينهما، فأرسل عثمان فجمع لابن أبي سرح جميع عمالة مصر خراجها وحربها وصلاتها، وبعث إلى عمرو يقول له : لا خير لك في المقام عند من يكرهك، فاقدم إلي.';
const String p23 =
    'فانتقل عمرو بن العاص إلى المدينة وفي نفسه من عثمان أمر عظيم وشر كبير ، فكلمه فيما كان من أمره بنفس، وتقاولا في ذلك، وافتخر عمرو بن العاص بأبيه على أبي عثمان، وأنه كان أعز منه فقال له عثمان: دع هذا فإنه من أمر الجاهلية.';
const String p24 =
    'وجعل عمرو بن العاص يؤلب الناس على عثمان، وكان بمصر جماعة يبغضون عثمان ويتكلمون فيه بكلام قبيح وينقمون عليه في عزله جماعة من علية الصحابة، وتوليته من دونهم أو من لا يصلح عندهم للولاية. ';
