const int sectionIndex = 5;
const String sectionTitle = 'التحكيم بين عليٌ ومعاوية';

const List t1 = ['t1', 'الأشعث ومحاولة الصلح'];
const List t2 = ['t2', 'موقف معاوية من خطبة الأشعث'];
const List t3 = ['t3', 'رفع المصاحف على أسنة الرماح'];
const List t4 = ['t4', 'موقف أمير المؤمنين من رفع المصاحف'];
const List t5 = ['t5', 'موافقة أمير المؤمنين عليٌّ رضى الله'];
const List t6 = ['t6', 'الأشتر وأهل الفتنة'];
const List t7 = ['t7', 'افتراء رواة الشيعة والطعن فى الصحابة'];
const List t8 = ['t8', 'الكذب وتزوير التاريخ'];
const List t9 = ['t9', 'الاتفاق على التحكيم'];
const List t10 = ['t10', 'وثيقة التحكيم'];
const List t11 = ['t11', 'رؤية حول الوثيقة'];
const List t12 = ['t12', 'كذب رواه الشيعة فى نصوص الوثيقة '];
const List t13 = ['t13', 'قتال الخوارج'];
const List t14 = ['t14', 'ضم مصر إلى الشام'];
const List t15 = ['t15', 'الوضع السياسى للشام والعراق'];

const String p1 =
    'خشي عدد من عقلاء الطرفين من استمرار القتال حتى لا يهلك المسلمون فيستغل الأعداء ذلك ويستأصلوا الإسلام فلا تقوم له بعد ذلك قَوْمة، وكان عقلاء الكوفة أسبق إلى الموادعة فهذا الأشعث بن قيس الكندي لمَّا اشتد القتال يخطب في قومه أهل الكوفة في المساء خطبته التي قادت للصلح فيقول: "قد رأيتم يا معشر المسلمين ما قد كان في يومكم هذا الماضي وما قد فني فيه من العرب، فوالله لقد بلغت من السن ما شاء الله أن أبلغ فما رأيت مثل هذا اليوم قَطُّ.';
const String p2 =
    'ألا فليبلغ الشاهد الغائب أنَّا إن نحن تواقفنا غدًا إنه لفناء العرب وضيعة الحرمات.';
const String p3 =
    'أما والله ما أقول هذه المقالة جزعًا من الحتف، ولكني رجل مسنّ أخاف على النساء والذراري غدًا إذا فنينا.';
const String p4 =
    'اللهم إنك تعلم أنى قد نظرت لقومي ولأهل ديني فلم آلُ وما توفيقي إلا بالله.';
const String p5 =
    'فلما وصل الخبر معاوية بخطبة الأشعث فقال: أصاب ورب الكعبة لئن نحن التقينا غدًا لتميلن الروم على ذرارينا ونسائنا ولتميلنَّ أهل فارس على نساء أهل العراق وذراريهم، وإنما يبصر هذا ذوو الأحلام والنُّهى اربطوا المصاحف على أطراف القَنَا.';
const String p6 =
    'قال صعصعة: فثار أهل الشام فنادوا في سواد الليل: يا أهل العراق مَن لذرارينا إن قتلتمونا ومن لذراريكم إن قتلناكم؟ اللهَ الله في البقية.';
const String p7 =
    'فأصبح أهل الشام وقد رفعوا المصاحف على رءوس الرماح وقلدوها الخيل، والناس على الرايات قد اشتهوا ما دعوا إليه، ورفع مصحف دمشق الأعظم تحمله عشرة رجال على رءوس الرماح ونادوا: يا أهل العراق كتاب الله بيننا وبينكم.';
const String p8 =
    'وأقبل أبو الأعور السلمي على برذون أبيض وقد وضع المصحف على رأسه ينادي: يا أهل العراق كتاب الله بيننا وبينكم.';
const String p9 =
    'فقال الأشعث لعليٌّ أمير المؤمنين رضى الله عنه: أجب القوم إلى كتاب الله فإنك أحق به منهم وقد أحب الناس البقاء وكرهوا القتال.';
const String p10 = 'فقال عليٌّ رضى الله عنه: إن هذا أمر ينظر فيه.';
const String p11 =
    'وذكروا أن أهل الشام جزعوا فقالوا: يا معاوية ما نرى أهل العراق أجابوا إلى ما دعوناهم إليه فأعدها جذعة فإنك قد غمرت بدعائك القوم وأطمعتهم فيك.';
const String p12 =
    'فدعا معاوية عبد الله بن عمرو بن العاص وأمره أن يكلم أهل العراق فأقبل حتى إذا كان بين الصفين نادى: يا أهل العراق أنا عبد الله بن عمرو بن العاص، إنها قد كانت بيننا وبينكم أمور للدين والدنيا، فإن تكن للدين فقد والله أعذرنا وأعذرتم، وإن تكن للدنيا فقد والله أسرفنا وأسرفتم، وقد دعوناكم إلى أمرٍ لو دعوتمونا إليه لأجبناكم، فإن يجمعنا وإياكم الرضا فذلك من الله فاغتنموا هذه الفرجة.';
const String p13 =
    'لقد كان رفع المصاحف عملًا رائعًا اشترك فيه العقلاء من الفريقين، وتُوِّج بموافقة أمير المؤمنين علي رضى الله عنه إذ قال: "نعم بيننا وبينكم كتاب الله، أنا أولى به منكم".';
const String p14 =
    'وأمَّا الأشتر فلم يكن يرى إلا الحرب لأنه من أهل الفتنة ولكنه سكت على مضضٍ، وذكروا أن الناس ماجوا وقالوا: أكلتنا الحرب وقتلت الرجال وثارت الجماعة بالموادعة.';
const String p15 =
    'إذن لا يَصِحُّ شيء مما ادَّعاه أهل الفتنة كذبًا من أن رفع المصاحف هو مكيدة من الصحابي الجليل عمرو بن العاص رضى الله عنه، أشار بها على معاوية رضى الله عنه ليتفاديا انتصار جيش علي رضى الله عنه، ومن ثَمَّ أوسعا الصحابيين الجليلين سبًّا وقذفًا شنيعًا لا يرضاه الله سبحانه وتعالى.';
const String p16 =
    'وقد افترى الرواة الشيعة الكذَّابون واختلقوا الكثير من الروايات الموضوعة لأهدافهم الخبيثة من طعن الصحابة رضوان الله عليهم، وتشويه الدين فقد وضعوا روايات تُضَخِّم من عدد قتلى صفين، كما فعلوا في الجمل، وللأسف اهتم المؤرخون القدماء بجمع هذه الروايات حتى كادت الروايات الحقيقية تضيع وسط هذا الركام فهذا الطبري شيخ المؤرخين -رحمه الله- يذكر حول صفين ما يقارب 107 روايات تصف أحداثها من البدء إلى النهاية، ويروي فيها للشيعي الكاذب أبي مخنف لوط بن أبي يحيى المتجرئ على الصحابة خمسًا وتسعين رواية.';
const String p17 =
    'ويبلغ الرواة الكذابون، ومؤرخو الشيعة المفترون بعدد القتلى إلى سبعين ألفًا من الجهتين، ويذكر المسعودي المؤرِّخ الشيعي أنَّ قتلى جيش الشام كانوا تسعين ألفًا، ومن أهل العراق عشرين ألفًا.';
const String p18 =
    'يقولون هذا مع أن المسعودي نفسه يذكر أن عليًّا رضى الله عنه كان تعداد جيشه تسعين ألفًا، وتعداد جيش معاوية خمسة وثمانين ألفًا. أي أن المسعودي الشيعي يدَّعِي أن قتلى جيش الشام يزيدون على تعداد الجيش بخمسة آلاف، فأنَّى يُصَدَّق مثل هذا؟!';
const String p19 =
    'لقد تم تضخيم عدد القتلى للأغراض نفسها التي تم فيها نفس الفعل في موقعة الجمل، كما أن الأرقام الحقيقية للقتلى أيضًا أقل بكثير من المكذوب، للأسباب نفسها التي ذكرناها في الجمل، وكذلك لأن الجيشيْن هنا كانا لا يريدان القتال، ولا يتحمسان له.';
const String p20 =
    'وبالإضافة إلى ذلك، فلو قُتِل هذا العدد الضخم، فلماذا لم تذكر كتب التاريخ بعض الأسماء كعادتها؟!';
const String p21 =
    'إن الحقيقة واضحة وهي أن أصابع أهل الفتن تدخلت في التفاصيل لتفسد على المسلمين تاريخهم، وتضرب حب الصحابة رضوان الله عليهم في قلوبهم.';
const String p22 =
    'تم الاتفاق على التحكيم وتم اختيار حَكم عن كل فريق فاختار معاوية عمرَو بن العاص رضى الله عنهما، واختار عليٌّ أبا موسى الأشعري رضى الله عنهما، وتم كتابة وثيقة التحكيم في 13 من صفر سنة 37هـ';
const String p23 =
    'هذا ما تقاضى عليه علي بن أبي طالب ومعاوية بن أبي سفيان قاضي عليٍّ على أهل العراق ومن كان معه من شيعته من المؤمنين، وقاضي معاوية على أهل الشام ومن كان معه من شيعته من المسلمين، أنا ننزل على حكم الله وكتابه، فما وجد الحكمان في كتاب الله فهما يتبعانه، وما لم يجدا في كتاب الله فالسنة العادلة تجمعهما وهما آمنان على أموالهما وأنفسهما وأهاليهما، وأن الأمة أنصار لهما على الذي يقضيان به عليه وعلى المؤمنين والمسلمين، والطائفتان كلتاهما عليهما عهد الله وميثاقه أن يفيا بما في هذه الصحيفة على أن بين المسلمين الأمن ووضع السلاح، وعلى عبد الله بن قيس وعمرو بن العاص عهد الله وميثاقه ليحكما بين الناس بما في هذه الصحيفة على أن الفريقين جميعًا يرجعان سنة فإذا انقضت السنة إن أحبَّا أن يردا ذلك ردَّا وإن أحبَّا زادا فيهما ما شاء الله، اللهم إنا نستنصرك على من ترك ما في هذه الصحيفة.';
const String p24 =
    'وبالتالي لم يُذكَ أمر الخلافة في الوثيقة فلم يكن هناك تنازع على الخلافة، ولا ادَّعاها معاوية لنفسه أبدًا ولا تطلَّع إليها، ومِن ثَمَّ اكتفى الحكمان بتهدئة الأمور وتثبيتها سنةً كاملةً يتحاجز فيها الفريقان، ولم يفصلا في محوري الخلاف وهما طلب علي رضى الله عنه البيعة من معاوية رضى الله عنه وأهل الشام، وطلب معاوية رضى الله عنه وأهل الشام من عليٍّ القصاص أولاً من قتلة عثمان فلم تكن الظروف تسمح بالفصل في هذين الأمرين، وهما محورا الخلاف.';
const String p25 =
    'وتبين الوثيقة أيضًا أن كثيرًا من الروايات حول صفين والتحكيم كانت روايات مكذوبة وضعها كذَّابو الشيعة للنيل من الصحابة ممثَّلين في عمرو بن العاص ومعاوية بن أبي سفيان وأبي موسى الأشعري فاتهموا عَمْرًا بالمكر والخديعة، ومعاوية بالحرص على الدنيا، ومنازعة الأمر أهله، وأبا موسى بالغفلة، وكلُّهم من هذه الاتهامات بُرآء.';
const String p26 =
    'فقد استحلَّ الكذَّابون أن يضعوا تلك الرواية التي صارت أشهر رواية عن التحكيم وكلها إساءة للصحابة، حتى وُضِعَت في مناهج التعليم في البلاد الإسلامية، وصارت تُورِث المسلمين بُغض صحابة رسول الله ﷺ .';
const String p27 =
    'إن هذا المستوى المتدني من التعامل لا يليق بالشخصيات السوية، فضلاً عن أن يكونوا من الصحابة الكرام، ولكنها نفوس أهل السوء الذين يبغضون خير البرية ﷺ ، ولكنهم لا يستطيعون الطعن فيه لئلاّ ينكشف أمرهم فشرعوا رماحهم لينالوا من أصحابه المرضيِّ عنهم منه ﷺ ومن رب العالمين.';

const String p28 =
    'انشغل أمير المؤمنين علي رضى الله عنه بعد صِفِّين بقتال الخوارج، ولا تحدثنا كتب التاريخ عن اجتماع الحكمين بعد عام كما تم تحديده، ولكن حدثت عدة وقائع إذ عزل علي رضى الله عنه والي مصر من قِبَلِه قيس بن سعد بن عبادة، بعدما شَهَّر به أهل الفتنة، وأذاعوا وجود اتصالات بينه وبين معاوية رضى الله عنه، وعيَّن مكانه محمد بن أبي بكر.';
const String p29 =
    'وقد وقع محمد بن أبي بكر في عدة أخطاء وهاجم مجموعة ممن ساءهم مقتل الخليفة عثمان رضى الله عنه، واعتزلوا بعيدًا عن الناس ينتظرون اجتماع الأمة، واستقرار الخلافة فاستنجد هؤلاء بمعاوية الذي كان يعتقد أن محمد بن أبي بكر ممن خرج على عثمان رضى الله عنه، وقُتِل محمد بن أبي بكر في إحدى معاركه فأرسل معاوية رضى الله عنه عمرَو بن العاص رضى الله عنه فدخل مصر وضمَّها للشام، فأصبحت مكسبًا ضخمًا للشام وخسارة فادحة للكوفة.';
const String p30 =
    'جرت مكاتبات بين علي رضى الله عنه ومعاوية رضى الله عنه أسفرت عن وضع الحرب بينهما على أن يكون لعليٍّ العراق ولمعاوية الشام.';
const String p31 =
    'يقول الطبري: وفي هذه السنة 40هـ جرت بين عليٍّ وبين معاوية المهادنة  على وضع الحرب بينهما، ويكون لعليٍّ العراق ولمعاوية الشام، فلا يدخل أحدهما على صاحبه في عمله بجيش ولا غارة ولا غزو.';
const String p32 =
    'ولما لم يعط أحد الفريقين صاحبه الطاعة، كتب معاوية إلى عليٍّ: أمَّا إذا شئت فلك العراق ولي الشام، وتكف السيف عن هذه الأمة ولا تهريق دماء المسلمين. ففعل ذلك وتراضيا على ذلك، فأقام معاوية بالشام بجنوده يجبيها وما حولها وعليٌّ بالعراق يجيبها ويقسمها بين جنوده.';
