const int sectionIndex = 2;
const String sectionTitle = 'فى خلافته رضى الله عنه';

const List t11 = ['11', 'أبو بكر الخليفة'];
const List t12 = ['12', 'حروب الرده'];
const List t13 = ['13', 'وفاته رضى الله عنه'];

const String p23 =
    'كان الصديق رضي الله عنه يقيم بالسنح على مقربة من المدينة، فتعود أن يحلب للضعفاء أغنامهم كرمًا منه، وذلك أيام الرسول ﷺ ، وكان هو الوزير الأول لرسول الله ﷺ ، فسمع جارية تقول بعد مبايعته بالخلافة: اليوم لا تحلب لنا منائح دارنا، فسمعها الصديق رضي الله عنه فقال: بلى، لعمري لأحلبنها لكم، فكان يحلبها، وربما سأل صاحبتها: يا جارية أتجدين أن أرغي لك أو أصرح؟ أي: يجعل اللبن برغوة، أم بدون رغوة، فربما قالت: أرغ وربما قالت: صرّح فأي ذلك قالته فعل.';

const String p24 =
    'وكذلك لما كان عمر بن الخطاب رضي الله عنه يتعهد عجوزًا كبيرة عمياء في بعض حواش المدينة من الليل، فيسقي لها، ويقوم بأمرها، فكان إذا جاءها وجد غيره قد سبقه إليها، فأصلح لها ما أرادت، فجاءها غير مرة كيلا يسبق إليها، فرصده عمر، فإذا هو بأبي بكر الذي يأتيها، وهو يومئذ خليفة فقال عمر: أنت هو لعمري.';
const String p25 =
    'وكان من الممكن أن يكلف رجلا للقيام بذلك، ولكنه الصديق، يشعر بالمسئولية تجاه كل فرد من أفراد الأمة، كما أنه رضي الله عنه قد آثر أن يخدمها بنفسه، يربي نفسه على التواضع لله عز وجل، ويربي نفسه على ألا يتكبر حتى على العجوز الكبيرة العمياء.';

const String p26 =
    'واجه أبو بكرالصديق في بداية حياته السياسية كخليفة، ردة العرب وانتقاضهم على الإسلام كدين، وعلي حكم المدينة كقوة سياسية.';

const String p27 =
    'ووردت إليه الأخبار من كافة أرجاء الجزيرة العربية بارتداد بني أسد بقيادة طليحة بن خويلد الذي ادعى النبوة، وبني فزارة بقيادة عيينة بن حصن، وبني عامر وغطفان بقيادة قرة بن سلمة القشيري، وبني سليم بقيادة الأشعث بن قيس الكندي، وبني بكر بن وائل في البحرين بقيادة الحكم بن زيد، وبني حنيفة بقيادة مسيلمة الكذاب الذي ادعى النبوة، وحافظت قريش وثقيف، وأهل المدينة على ولائهم.';

const String p28 =
    'وقرر أبو بكر التصدي لهذه الحركات الارتدادية بالقوة والحزم، وبخاصة بعد ورود أنباء عن تحفز القبائل لشن هجوم واسع على المدينة، وتدمير القاعدة المركزية للدين الإسلامي.';

const String p29 =
    'كان موقف أبي بكرٍ رضي الله عنه من المرتدين لا هوادة ولا مساومة فيه، وقال: والله لأقاتلن من فرق بين الصلاة والزكاة، ووقف أبا بكرٍ في مواجهة الردَّة الطَّاغية موقف الأنبياء والرُّسل وأدَّى خلافة النُّبوَّة حقَّها وكسر شوكة الكفر.';

const String p30 =
    'مرض الخليفة أبو بكر في جمادى الآخرة سنة 13هـ، واشتد به المرض فلما ثقل واستبان له من نفسه، جمع الناس إليه فقال: إنه قد نزل بي ما قد ترون، ولا أظنني إلا ميتاً لما بي.';
const String p31 =
    'وقد روت السيدة عائشة خبر وفاة أبيها أبي بكر فقالت: أول ما بُدئ مرض أبي بكر أنه اغتسل وكان يوماً بارداً، فحم خمسة عشر يوماً لا يخرج إلى صلاة، وكان يأمر عمر بالصلاة وكانوا يعودونه، وكان عثمان ألزمهم له في مرضه، وقالت السيدة عائشة: قال أبو بكر: انظروا ماذا زاد في مالي منذ دخلت في الإمارة فابعثوا به إلى الخليفة بعدي، فنظرنا فإذا عبد نوبي كان يحمل صبيانه، وإذا ناضح البعير الذي يُستقى عليه كان يسقي بستاناً له، فبعثنا بهما إلى عمر، فبكى عمر، وقال: رحمة الله على أبي بكر لقد أتعب من بعده تعباً شديداً.';
const String p32 =
    'وقد أوصى أن تغسله زوجه، وأن يدفن بجانب النبي محمد ﷺ ، وكان آخرَ ما تكلم به أبو بكر قولَ الله تعالى: توفني مسلماً وألحقني بالصالحين وتوفي أبو بكر وهو ابن ثلاث وستين سنة، استوفى سن النبي محمد، وغسلته زوجه، ودفن جانب النبي محمد، وقد جعل رأسه عند كتفي النبي، وصلى عليه خليفته عمر بن الخطاب، ونزل قبره عمر وعثمان وطلحة وابنه عبد الرحمن، وألصق اللحد بقبر النبي محمد.';
const String p33 =
    'وارتجت المدينة لوفاة أبي بكر، ولم تر المدينة منذ وفاة الرسول يوماً أكثر باكياً وباكية من ذلك المساء، وأقبل علي بن أبي طالب مسرعاً باكياً مسترجعاً، ووقف على البيت الذي فيه أبو بكر، فقال: رحمك الله يا أبا بكر، كنت إلفَ رسول الله ﷺ وأنيسه، ومستراحه وثقته، وموضع سره ومشاورته، إلى أن قال: والله لن يصاب المسلمون بعد رسول الله بمثلك أبداً، كنت للدين عزاً وحرزاً وكهفاً، فألحقك الله عز وجل بنبيك محمد، ولا حرمنا أجرك ولا أضلنا بعدك، فسكت الناس حتى قضى كلامه، ثم بكوا.';
