const int sectionIndex = 4;
const String sectionTitle = 'صفين واقتِتال الصحابة';

const List t1 = ['t1', 'عليٌ رضى الله عنه يسير إلى الشام'];
const List t2 = ['t2', 'الطريق إلى موقعة صفين'];
const List t3 = ['t3', 'قبائل العراق والشام'];
const List t4 = ['t4', 'موقف جند الشام من القتال'];
const List t5 = ['t5', 'أهل الفتنة فى جيش أمير المؤمنين عليٌ'];
const List t6 = ['t6', 'القتال'];
const List t7 = ['t7', 'عمار بن ياسر والفئة الباغية'];
const List t8 = ['t8', 'الفتنة واعتزال بعض الصحابة'];
const List t9 = ['t9', 'قول ابن تيمية فى اقتِتال الصحابة'];

const String p1 =
    'قرَّر أمير المؤمنين علي أن يسير لقتال أهل الشام ليلزمهم بالبيعة والطاعة، فقال له الحسن بن علي رضى الله عنهما: يا أبتِ دع عنك هذا فإن فيه سفك دماء المسلمين ووقوع الاختلاف بينهم، فلم يقبل منه ذلك بل صمَّم على القتال.';

const String p2 =
    'اتجه أمير المؤمنين بجنده إلى النخيلة قريبًا من الكوفة وعسكر بها لتوافيه جنود البصرة بقيادة واليها عبد الله بن عباس رضى الله عنهما، ثم توجه إلى صِفِّين على شاطئ الفرات الغربي، فخرج إليه معاوية رضى الله عنه على رأس جيشه حتى نزل صفين أيضًا، وكان ذلك سنة 36هـ بداية شهر ذي الحجة وهو من الأشهر الحُرُم وكانت فاتحة شر على الطرفين.';
const String p3 =
    'كما كانت القبائل في كلٍّ من العراق والشام قبائل واحدة انقسمت في سكناها إلى قسمين أيام الفتوح فمَنهم من فتح الشام ومَنهم من فتح العراق وفارس، وكلا القسمين يحتفظ بصلات أرحامه، والجميع قريب من زمن النبوة والوحي وهم من خير القرون في الأمة الإسلامية.';
const String p4 =
    'ولم يكن هناك رغبة عند الطرفين في خوض الحرب فقد علم الجميع حرمة الدم المسلم وهم لا يريدون تكرار ما حدث يوم الجمل.';
const String p5 =
    'وتوالت الرسل إلى صفين بغية الوصول إلى حقن الدماء ولكن أخبار تلك السفارات مروية عن رواة غير ثقات، ويتضح في كثير منها الكذب، ونهاية الأمر أنه لم يتم التوصل لحل.';
const String p6 =
    'كان مِن جند الشام مَن يستنكر أن يقاتل معاويةُ عليًّا رضى الله عنهما، يقول الإمام ابن تيمية رحمه الله: كان غير واحد من عسكر معاوية يقول له: لمَ ذا تقاتل عليًّا وليس لك سابقته ولا فضله ولا صِهْره وهو أولى بالأمر منك.';
const String p7 =
    'فيعترف لهم معاوية بذلك، لكن قاتلوا مع معاوية لظنِّهم أن عسكر عليٍّ فيه ظَلَمَة يعتدون عليهم كما اعتدوا على عثمان وأنهم يقاتلونهم دفعًا لصيالهم عليهم، وقتال الصائل جائز ولهذا لم يبدءوهم بالقتال حتى بدأهم أولئك.';
const String p8 =
    'وقبل وقعة صفين كان هناك داخل جيش الكوفة من لم يكن طوعًا لأمير المؤمنين عليٍّ رضى الله عنه فقد كان هناك عدد من أهل الفتن ممن قتلوا عثمان رضى الله عنه لذا كانوا ينفذون ما خطط له سادتهم وما يرضي أهواءهم ولم يكونوا في الحقيقة يدينون لعلي رضى الله عنه بالطاعة.';
const String p9 =
    'فعن عامر الشعبي وأبي جعفر الباقر قال: بعث عليٌّ رجلاً إلى دمشق ينذرهم أن عليًّا قد نَهَدَ في أهل العراق إليكم ليستعلم طاعتكم لمعاوية، فلما قدم أمر معاوية فنودي في الناس: الصلاة جامعة، فملئوا المسجد ثم صعد المنبر فقال في خطبته: إن عليًّا قد نهد إليكم في أهل العراق، فما الرأي؟ فضرب كل منهم على صدره، ولم يتكلم أحد منهم، ولا رفعوا إليه أبصارهم.';
const String p10 =
    'وقام ذو الكلاع فقال: يا أمير المؤمنين عليك الرأي وعلينا الفعال، ثم نادى معاوية في الناس: أن اخرجوا إلى معسكركم في ثلاث، فمن تخلف بعدها فقد أحل بنفسه، فاجتمعوا كلهم، فركب ذلك الرجل إلى عليٍّ فأخبره، فأمر علي مناديًا فنادى: الصلاة جامعة، فاجتمعوا، فصعد المنبر فقال: إن معاوية قد جمع الناس لحربكم، فما الرأي؟ فقال كل فريق منهم مقالة واختلط كلام بعضهم في بعض، فلم يدرِ عليٌّ مما قالوا شيئًا، فنزل عن المنبر وهو يقول: إنا لله وإنا إليه راجعون.';
const String p11 =
    'كان القتال على الماء في أول يوم واستمر القتال متواصلاً طوال هذا الشهر، وكان القتال على شكل كتائب صغيرة، فكان علي رضي الله عنه يخرج من جيشه كتيبة صغيرة يؤمر عليها أميراً، فتقتتلان مرة واحدة في اليوم في الغداة أو العشي وفي بعض الأحيان يقتتلان مرتين في اليوم، وقد تجنبوا القتال بكامل الجيش خشية الهلاك ، وأملاً في وقوع صلح بين الطرفين تصان به الأرواح والدماء.';
const String p12 =
    'كان استشهاد الصحابي الجليل عمار بن ياسر رضى الله عنه الذي كان يحارب في صفوف أمير المؤمنين علي رضى الله عنه، وذلك لأن رسول الله ﷺ قال عنه: "وَيحَ عَمَّارٍ تقتُلهُ الفِئةُ البَاغِيَة".';
const String p13 =
    'فقد كشف استشهاده رضى الله عنه عن حقيقة الموقف بين الفريقين فعلم من كان متردِّدًا أن عليًّا رضى الله عنه ومن معه هم المصيبون، وأن معاوية رضى الله عنه ومن معه مخطئون في اجتهادهم.';
const String p14 =
    'لم ينتهِ الرسل إلى اتفاق يوقف الاستعداد للحرب في ذات الوقت الذي كان أهل الفتنة فيه يسعون إلى إيقاعها بكل ضراوة، وقد وقعت الحرب، ولكن اعتزلها جمهور الصحابة فقد روى محمد بن سيرين رحمه الله قال: "هاجت الفتنة وأصحاب رسول الله ﷺ عشرة آلاف فما حضرها منهم مائة، بل لم يبلغوا ثلاثين.';
const String p15 =
    'ولا ينبغي التطاول على معاوية رضى الله عنه ومن معه، واتهامهم بالكفر لقتلهم عمارًا رضى الله عنه، فقد قال عمار رضى الله عنه نفسه: "حدثني حبيبي رسول الله ﷺ أني لا أموت إلا قتلاً بين فئتين مؤمنتين"، فليس هؤلاء كقتلة عثمان رضى الله عنه الذين تواطئوا على الفتنة والضلال.';
const String p16 =
    'وأمّا قِتالُ الصّحابةِ فإنه لم يظهر فيه سرور، بل ظهر منهم الكآبة, وتمنّوا ألا يقع وشكر علي بعض الصّحابةِ، وبرّأ الفريقين من الكُفرِ والنّفاقِ، وأجاز التّرحُّم على قتلى الطائفتين، وأمثال ذلِك مِن الأمُور التي يُعرف بها اتفاق علِيٍّ وغيره من الصّحابةِ على أن كُلّ واحِدةٍ مِن الطائفتين مُؤمِنة.';
const String p17 =
    'وقد شهِد القرآن بأنّ اقتِتال المؤمنين لا يخرجهم عن الإيمان بقوله تعالى: وإن طائفتان من المؤمنين اقتتلُوا فأصلِحُوا بينهُما فإِن بغت إحداهُما على الأخرى فقاتِلُوا التِي تبغِي حتى تفِيء إلى أمرِ اللّهِ فإن فاءت فأصلِحُوا بينهُما بالعدلِ وأقسِطوا إن اللّه يُحِب المُقسطين، إنّما المُؤمِنون إخوة فأصلِحُوا بين أخويكم واتقوا اللّه لعلكم ترحمُون.';
const String p18 =
    'فسمّاهم مُؤمنين وجعلهم إخوةً مع وجودِ الِاقتتالِ والبغيِ، والحدِيث المذكور: إذا اقتتل خلِيفتانِ فأحدهما ملعُون كذِبٌ مُفترًى لم يروِهِ أحد من أهل العلمِ بالحدِيث، ولا هُو في شيءٍ مِن دواوينِ الإسلامِ المُعتمدةِ.';
