const int sectionIndex = 2;
const String sectionTitle = 'فى خلافته رضى الله عنه';

const List t7 = ['7', 'عُمر الخليفة'];
const List t8 = ['8', 'الجيش'];
const List t9 = ['9', 'الشرطة'];
const List t10 = ['10', 'عزل خالد بن الوليد'];
const List t11 = ['11', 'حكمت فعدلت فأمنت فنمت'];
const List t12 = ['12', 'استشهاده رضى الله عنه'];

const String p10 =
    'فقد اتسعت حدود الدولة الإسلامية خلال عهده اتساعًا عظيمًا جعله يُقدم على إنشاء تنظيم إداري فعّال لابقائها متماسكة وموحدة، وقد استتبع هذا الأمر تنظيم وإنشاء عدّة مرافق مهمة لم تعرفها العرب من قبل، ومن مآثر عمر بن الخطاب الأخرى توسيعه وترميمه للمسجد الحرام والمسجد النبوي لاستيعاب الأعداد المتزايدة من الحجاج بعد أن اعتنق الكثير من رعايا الشام والعراق ومصر وغيرها الإسلام.';
const String p11 =
    'وفتح بابه أمام شكاوي الناس، وتدوين الدواوين، وتعيين العرفاء على العشائر والقبائل. وابتدأ التأريخ الهجري، وكان لا يستحل الأخذ من بيت مال المسلمين إلا حلة للشتاء وأخرى للصيف وناقة لركوبه وقوته كقوت رجل متوسط الحال من المهاجرين.';
const String p12 =
    'أدرك عمر أهمية الجيش في نشر الإسلام و تأسيس جيش نظامي ثابت يكفل حماية الدولة، ونظّم الرتب في الجيش، وعرف الجيش الإسلامي خلال هذا العهد استخدام أسلحة الحصار التي اقتبست عن الروم، ومنها المنجنيق وأبراج الحصار والدبابة وأكباش الدك. وأصدر عمر أيضًا أمرًا بوجوب تعلّم الجنود ركوب الخيل والرماية والمشي حفاة والسباحة، وأنشأ مراكزَ عسكريةٍ في المدينة والكوفة والبصرة والموصل والفسطاط ودمشق والأردن وفلسطين.';
const String p13 =
    'يعتبر عمر بن الخطاب أول من أنشأ حبسًا خاصًا بالمتهمين بعد أن كان هؤلاء يُعزلون في المسجد، وكان أول من أدخل نظام العسس للتجول والمراقبة ليلاً، وأول من أسندت إليه هذه المهمة هو عبد الله بن مسعود، فهو أول عسّاس في الإسلام.';
const String p14 =
    'كما كان عمر يخشى انتشار كبار الصحابة في المناطق التي انتشر فيها الإسلام حيث إغراء الدنيا بامتلاك الضياع وافتتان المسلمين بهم مما يوفر لكل منهم الأرض والمال والأتباع فيكون لنفسه دولة داخل الدولة، فتضيع بذلك الخلافة وينقسم المسلمون. لذلك كان يقول لهم: إني أخاف أن تروا الدنيا وأن يراكم أبناؤها وكان هذا هو السبب وراء عزل عمر لخالد بن الوليد بعد أن فُتن الناس به وتحدثوا عن انتصاراته في الشام والعراق، فتغنّى الشعراء بفعاله، فوهبهم خالد من ماله وأغدق عليهم، قال عمر : إني لم أعزل خالدًا عن سخطة ولا خيانة، ولكن الناس فتنوا به، فخفت أن يوكلوا إليه ويُبتلوا به فأحببت أن يعلموا أن الله هو الصانع، وألا يكونوا بعرض فتنة.';
const String p15 =
    'ولشعوره بمسؤولية الخلافة لم يكن ينام عمر إلا قليلاً، فكان ينعس وهو قاعد فقيل له: يا أمير المؤمنين ألا تنام؟ فقال: كيف أنام؟ إن نمت بالنهار ضيعت أمور المسلمين وإن نمت بالليل ضيعت حظي من الله، كان بعيدا عن حياة الأبّهة والترف وكان يصرف على نفسه بما يربحه من التجارة ولم يتخذ لنفسه قصرًا أو ملبسًا فاخرًا، وأن رسولاً من الفرس وصل إلى المدينة المنورة واستدل على بيت الخليفة وجده مبنيًا من طين ولمّا سأل عنه أشار الناس إلى رجل نائم تحت ظل شجرة وفي ثوبه عدد من الرقع وبدون أي حراسة، فتعجب من هذا المنظر ولم تصدق ما رأته عيناه وتذكر كسرى فارس وقصوره وحرسه وخدمه فقال قولته المشهورة: حكمت فعدلت فأمنت فنمت يا عمر.';
const String p16 =
    'كان عدد من الفُرس الذين بقوا على المجوسية يضمرون الحقد والكراهية لعمر بن الخطاب، وفى موسم الحج وعلى جبل عرفة سُمع عمر صوت يهتف أنه لن يقف مرة أخرى على الجبل، وبعد عودة عمر إلى المدينة المنورة من الحج طعنه أبو لؤلؤة المجوسي ست طعنات وهو يُصلي الفجر بالناس، ثم حُمل إلى منزله والدم يسيل من جرحه.';
const String p17 =
    'ومن بشرى استشهاده فقد روى البخاري عن قتادة أن أنس بن مالك رضي الله عنه حدثهم: أن النبي ﷺ صعد أحداً وأبو بكر وعمر وعثمان فرجف بهم، فقال: اثبت أحد فإنما عليك نبي وصديق وشهيدان.';
