const int sectionIndex = 3;

const String sectionTitle = 'الطريق إلى موقعة الجمل';

const List t1 = ['t1', 'البصرة'];
const List t2 = ['t2', 'الوساطة الحكيمة للقعقاع بن عمرو'];
const List t3 = ['t3', 'القعقاع والسيدة عائشة رضى الله عنها '];
const List t4 = ['t4', 'التفاهم بين عليٌ وأصحاب الجمل'];
const List t5 = ['t5', 'محاولات أهل الفتنة لمنع الصلح'];
const List t6 = ['t6', 'المخطط الخبيث'];
const List t7 = ['t7', 'الظن بالخيانة واشتعال القتال'];
const List t8 = ['t8', 'الزبير بن العوام يترك المعركة ثم يُقتل'];
const List t9 = ['t9', 'رجوع السيدة عائشة للمدينة'];
const List t10 = ['t10', 'عدم صحة ما روى عن أعداد القتلى'];
const List t11 = ['t11', 'محاولات أهل الفتنة لتشوية الصحابة'];
const List t12 = ['t12', 'الكوفة عاصمة الخلافة'];
const List t13 = ['t13', 'موقف معاوية من موقعة الجمل'];

const String p1 =
    'كانت البصرة  تعجُّ بالكثير من أهل الفتنة المشاركين في قتل عثمان رضى الله عنه وخرج الوالي من قِبَل علي رضى الله عنه، لما علم بمقدم أصحاب الجمل وقاتلهم فاضطروا لقتاله وانتصروا عليه.';
const String p2 =
    'كان علي رضى الله عنه يريد التصالح مع هؤلاء الصحابة، وردهم إلى المدينة لذا لما نزل بذي قارٍ دعا عليٌّ القعقاع بن عمرو فأرسله إلى أهل البصرة وقال: الْقَ هذين الرجلين فادعهما إلى الألفة والجماعة وعظّم عليهما الفُرقة.';
const String p3 =
    'وقال له: كيف تصنع فيما جاءك منهما وليس عندك فيه وصاة مني؟ قال: نلقاهم بالذي أمرت به فإذا جاء منهم ما ليس عندنا منك فيه رأي اجتهدنا رأينا، وكلمناهم كما نسمع ونرى أنه ينبغي. قال: أنت لها. ';
const String p4 =
    'فخرج القعقاع حتى قدم البصرة فبدأ بعائشة فسلّم عليها وقال: أي أمة، ما أشخصك؟ وما أقدمك هذه البلدة؟';
const String p5 = 'قالت: أي بُنيَّ، الإصلاح بين الناس.';
const String p6 = 'قال: فابعثي إلى طلحة والزبير حتى تسمعي كلامي وكلامهما. ';
const String p7 =
    'فبعثت إليهما فجاءا، فقال لهما: إني سألت أم المؤمنين ما أقدمها، فقالت: الإصلاح بين الناس، فما تقولان أنتما، أمتابعان أم مخالفان؟ قالا: متابعان.';
const String p8 = 'قالت عائشة: فماذا تقول أنت؟';
const String p9 =
    'قال: أقول إن هذا الأمر دواؤه التسكين فإذا سكن اختلجوا، فإن أنتم بايعتمونا فعلامة خير وتباشير رحمة ودرك بثأر هذا الرجل وعافية وسلامة لهذه الأمة، وإن أنتم أبيتم إلا مكابرة هذا الأمر واعتسافه كانت علامة شر وذهاب هذا المال فآثروا العافية ترزقوها وكونوا مفاتيح الخير كما كنتم ولا تعرضونا للبلاء فتعرضوا له فيصرعنا وإياكم. ';
const String p10 =
    'وايم الله، إني لأقول هذا القول وأدعوكم إليه! وإني لخائف أن لا يتم حتى يأخذ الله حاجته من هذه الأمة التي قلَّ متاعها، ونزل بها ما نزل، فإن هذا الأمر الذي حدث أمر ليس يقدر، وليس كقتل الرجل الرجل ولا النفر الرجل ولا القبيلة الرجل. ';
const String p11 =
    'قالوا: قد أصبت وأحسنت فارجعْ، فإن قدم علي وهو على مثل رأيك صلح هذا الأمر.';
const String p12 =
    'في هذا الوقت وصل عليٌ رضى الله عنه وبعث إلى أصحاب الجمل حكيم بن سلامة ومالك بن حبيب: إن كنتم على ما فارقتم عليه القعقاع، فكفوا حتى ننزل وننظر في هذا الأمر. ';
const String p13 =
    'فردوا حكيمًا ومالكًا إلى عليٍّ أننا على ما فارقنا عليه القعقاع.';
const String p14 =
    'وأرسل علي إلى رؤساء أصحابه، وطلحة والزبير إلى رؤساء أصحابهما بذلك، فباتوا بليلة لم يبيتوا بمثلها للعافية التي أشرفوا عليها والصلح.';
const String p15 =
    'فرجع إلى عليٍّ فأخبره فأعجبه ذلك، وأشرف القوم على الصلح كره ذلك من كرهه ورضيه من رضيه.';
const String p16 =
    'وأقبلت وفود العرب من أهل البصرة نحو علي بذي قار قبل رجوع القعقاع لينظروا ما رأى إخوانهم من أهل الكوفة وعلى أي حال نهضوا إليهم، وليعلموهم أن الذي عليه رأيهم الإصلاح ولا يخطر لهم قتالهم على بال.';
const String p17 =
    'كان أهل الفتنة يخشون أن يتصالح علي رضى الله عنه وأصحاب الجمل، فيتفرَّغوا لهم ويحاسبوهم لذا انتهى الاجتماع المشئوم باتفاق خبيث صاغه رأس الفتنة عبد الله بن سبأ اليهودي إذ قال: يا قوم، إن عزكم في خلطة الناس، فإذا التقى الناس غدًا فأنشبوا القتال ولا تفرغوهم للنظر، فمن أنتم معه لا يجد بدًّا من أن يمتنع، ويشغل الله عليًّا وطلحة والزبير ومن رأى رأيهم عما تكرهون، فأبصروا الرأي وتفرقوا عليه والناس لا يشعرون.';
const String p18 =
    'وسواءٌ كان رأس الأمر هو عبد الله بن سبأ اليهودي، أو أنه شخصية غير حقيقية -كما يرى بعض الباحثين- فإن الثابت أن هناك من وضع هذا المخطَّط ونفَّذه فردًا كان أم جماعة.';
const String p19 =
    'كان الكيد شديدًا وكذلك كان التنفيذ دقيقًا يقول ابن الأثير: "فغدوا مع الغَلَس وما يُشعَر بهم، فخرجوا متسللين وعليهم ظلمة، فقصد مضرهم إلى مضرهم، وربيعتهم إلى ربيعتهم، ويمنهم إلى يمنهم، فوضعوا فيهم السلاح، فثار أهل البصرة وثار كل قوم في وجوه أصحابهم الذين أتوهم".';
const String p20 =
    'ظن جيش علي رضى الله عنه أن أصحاب الجمل قد خانوه، كما ظنَّ جيش الجمل نفس الظن بجيش علي رضى الله عنه فاشتعل القتال واضْطُرَّ الجميع للقتال، ولكن عليًّا رضى الله عنه كان حريصًا على إنهاء المعركة سريعًا تقليلاً للخسائر، لذا لما وجد جيش الجمل يدافع باستماتة عن الجمل الذي تركبه السيدة عائشة رضي الله عنها -وبه سُمِّيَت المعركة معركة الجمل- أمر جنوده بعقر الجمل لكي تخمد عزيمة المدافعين وتنتهي المعركة وقد كان.';
const String p21 =
    'كل الشواهد أثبتت صحة موقف علي رضى الله عنه من القضية ففي أثناء المعركة وجد الزبير رضى الله عنه أن الهدف الذي خرج لأجله أصبح غير قابل للتحقيق فترك ساحة المعركة عائدًا إلى المدينة، فأدركه رجل ممن كانوا معه يُدعى عمرو بن جرموز فقتله وهو يصلي رضى الله عنه، وقد قُتِل أيضًا طلحة بن عبيد الله رضى الله عنه.';
const String p22 =
    'وقد أكرم علي رضى الله عنه السيدة عائشة رضي الله عنها، وأرسل معها أخاها محمد بن أبي بكر يوصلها إلى المدينة معززة مكرَّمة ومعها أربعون من نساء البصرة، فذهبت إلى مكة للحج ثم رجعت إلى المدينة.';
const String p23 =
    'كما أثبتت الحوادث صحة موقف الحسن بن علي - رضي الله عنهما- في دعوته أباه إلى عدم الخروج إلى أصحاب الجمل  كي لا يحدث قتال.';
const String p24 =
    'ومن الحقائق التي تم تزويرها ما جرى من تضخيم لأعداد القتلى في موقعة الجمل حتى روى بعضهم "أنه قُتِل في ذلك اليوم ثلاثون ألفًا". ';
const String p25 =
    'والواقع والمعقول أن الرقم الحقيقي أقل من ذلك بكثير لأن عدد جيش علي رضى الله عنه أصلاً كان بين تسعة آلاف إلى اثني عشر ألفًا وكان جيش الجمل قريبًا من ذلك، كما أن القتال كان قصيرًا للغاية "كانت وقفة واحدة في يوم واحد وكانت الحرب أربع ساعات".';
const String p26 =
    'لقد أراد أهل الفتنة أن يشوِّهوا تاريخ الصحابة ليطعنوا فيهم، وفي رسول الله ﷺ ، كما أرادوا أن يضخِّموا من نجاحهم ليستطيعوا جلب أنصار جدد من أهل الفتنة والضلال والشقاق، فأذاعوا هذه الأرقام المبالغ فيها، بينما رُويَ أن شهداء معركة اليرموك مثلاً كانوا حوالي "ثلاثة آلاف شهيد".';
const String p27 =
    'لذا فما يبدو لنا أن عدد قتلى موقعة الجمل لا يتجاوز بضع مئات من الطرفين إن لم يكن أقل من ذلك.';
const String p28 =
    'بعد هذه الموقعة قرَّر أمير المؤمنين علي رضى الله عنه اتخاذ الكوفة عاصمة له بدلاً من المدينة، وأخذ من هناك يحاول توطيد أمر الخلافة في الولايات المختلفة.';

const String p29 =
    'كان معاوية رضى الله عنه وأهل الشام قد رفضوا البيعة لأمير المؤمنين علي رضى الله عنه قبل أن يقتص من قتلة عثمان رضى الله عنه -كما ذكرنا-، ولم يكن في نفس معاوية رضى الله عنه شيء من المشاقة أو العداوة الشخصية لعلي رضى الله عنه، وكذلك لم يكن به طمع في الخلافة كما يصوِّر المرجفون وأهل الفتنة، وإنما هو اجتهاد رآه صوابًا يثيبه الله عز وجل عليه بإذنه.';
const String p30 =
    'ومما يثبت ذلك أن معاوية رضى الله عنه لم يشارك مع أصحاب الجمل في الحرب رغم أنه على نفس رأيهم، ولو تدخَّل لصالحهم لكان جديرًا بما معه من قوة الشام الصلبة، وجنوده المطيعة من أن يرجِّح كفتهم، ولكنه رضى الله عنه لم يكن يود محاربة علي رضى الله عنه، ولا يجرؤ على التفكير في ذلك.';
const String p31 =
    'يقول الإمام ابن تيمية: "ولم يكن معاوية ممن يختار الحرب ابتداءً بل كان من أشد الناس حرصًا على أن لا يكون قتال".';
