const int sectionIndex = 7;
const String sectionTitle = 'الصلح ونبوة رسول الله ﷺ';

const List t1 = ['t1', 'مبايعة الحسن بن علي رضى الله عنه'];
const List t2 = ['t2', 'لقاء الحسين ومعاوية'];
const List t3 = ['t3', 'الصلح'];
const List t4 = ['t4', 'نبوة رسول الله ﷺ بالصلح بين المسلمين'];

const String p1 =
    'صُدِمت الأمة بمقتل علي رضى الله عنه، كما صدمت بمقتل عثمان رضى الله عنه، وبدا للعقلاء منها أن الفتنة ستزيد اشتعالاً، وأن الدماء ستحفر لها نهرًا جديدًا، وبالفعل قام أهل الكوفة، وبايعوا الحسن بن علي رضى الله عنه، فجعل على قيادة الجيش عبيد الله بن العباس.';
const String p2 =
    'خرج الحسن رضى الله عنه بجيش كثيف إلى المدائن للقاء معاوية رضى الله عنه، يصفه الحسن البصري رحمه الله بقوله: "استقبل -والله- الحسنُ بن علي معاويةَ بكتائب أمثال الجبال"، وأتى معاوية حتى نزل مسكن، وهناك شاهد أهل الشام تلك الجحافل، فقال عمرو بن العاص: إني لأرى كتائب لا تولِّي حتى تقتل أقرانها.';
const String p3 =
    'فقال له معاوية -وكان والله خير الرجلين-: أيْ عمرو، إن قَتَل هؤلاءِ هؤلاءِ وهؤلاء هؤلاء مَن لي بأمور الناس، مَن لي بنسائهم، مَن لي بضيعتهم.';
const String p4 =
    'فبعث إليه رجلين من قريش من بني عبد شمس عبد الرحمن بن سمرة وعبد الله بن عامر بن كريز، فقال: اذهبا إلى هذا الرجل فاعرضا عليه وقولا له واطلبا إليه، فأتياه فدخلا عليه فتكلما، وقالا له فطلبا إليه فقال لهما الحسن بن علي: إنا بنو عبد المطلب قد أصبنا من هذا المال، وإن هذه الأمة قد عاثت في دمائها، قالا: فإنه يعرض عليك كذا وكذا، ويطلب إليك، ويسألك، قال: فمَن لي بهذا؟';
const String p5 =
    'قالا: نحن لك به، فما سألهما شيئًا إلا قالا: نحن لك به، فصالحه.';
const String p6 =
    'فقال الحسن: ولقد سمعت أبا بكر يقول: رأيت رسول الله ﷺ على المنبر والحسن بن علي إلى جنبه، وهو يُقبِل على الناس مرةً وعليه أخرى ويقول: "إِنَّ ابنِي هَذا سَيدٌ، ولعَلَّ اللَّهَ أن يُصلِح بهِ بين فِئتين عظيمتينِ مِن المسلمِين".';
const String p7 =
    'لقد أنبأ الرسول ﷺ بما سيحدث بعد وفاته بثلاثين عامًا في معجزة عظيمة أسفرت عن التئام شمل المسلمين بعد عَقدٍ كاملٍ تقريبًا من الفتن والمؤامرات والدسائس التي حاكها أهل الفتن من اليهود والمجوس والشيعة.';
const String p8 =
    'لقد سار الحسن بن علي رضى الله عنه على نهجه الذي اختاره من حقن دماء المسلمين، كما كان يُوصِي أباه من قبل، فحفظ الإسلام والمسلمون له هذا الصنيع طوال الدهر.';
