const int sectionIndex = 6;
const String sectionTitle = 'مقتل أمير المؤمنين';

const List t1 = ['t1', 'التآمر على قتل أمير المؤمنين'];
const List t2 = ['t2', 'مخطط قتل عليٌ ومعاوية'];
const List t3 = ['t3', 'تنفيذ الخطة'];
const List t4 = ['t4', 'ابن ملجم ومساومة قطام على خطبتها له'];
const List t5 = ['t5', 'مشاركة الخوارج فى القتل'];
const List t6 = ['t6', 'ضرب أمير المؤمنين بالسيف المسموم'];
const List t7 = ['t7', 'حوار أمير المؤمنين مع ابن الملجم'];

const String p1 =
    'لقد عانى أمير المؤمنين علي رضى الله عنه كثيرًا من عصيان جنوده، ولم يكن يمكنه رضى الله عنه أن ينتصر بمثل هؤلاء فقد كثرت مواقفهم التي خذلوه فيها وتعدَّدت، بينما كان أهل الشام طوعًا لمعاوية رضى الله عنه.';
const String p2 =
    'وسارت الأمور على هذا المنوال حتى قدَّر الله سبحانه وتعالى أن يستشَهد علي رضى الله عنه، وكان ذلك على أيدي الخوارج فقد كان سبب قتله أن عبد الرحمن بن ملجم المرادي والبرك بن عبد الله التميمي الصريمي وعمرو بن بكر التميمي السعدي وهم من الخوارج.';
const String p3 =
    'اجتمع الخوارج فتذاكروا أمر الناس وعابوا عمل ولاتهم ثم ذكروا أهل النهر فترحموا عليهم وقالوا: ما نصنع بالبقاء بعدهم؟ فلو شرينا أنفسنا وقتلنا أئمة الضلالة وأرحنا منهم البلاد.';
const String p4 =
    'فقال ابن ملجم: أنا أكفيكم عليًّا، وكان من أهل مصر، وقال البرك بن عبد الله: أنا أكفيكم معاوية، وقال عمرو بن بكر: أنا أكفيكم عمرو بن العاص.';
const String p5 =
    'فتعاهدوا أن لا ينكص أحدهم عن صاحبه الذي توجه إليه حتى يقتله أو يموت دونه، وأخذوا سيوفهم فسموها واتّعدوا لسبع عشرة من رمضان، وقصد كل رجل منهم الجهة التي يريد.';
const String p6 =
    'أتى ابن ملجم الكوفة فلقي أصحابه بالكوفة وكتمهم أمره، ورأى يومًا أصحابًا له من تيم الرباب، وكان عليٌّ قد قتل منهم عدة فى معركة النهروان، فتذاكروا قتلى النهر وأرادوا الأنتقام.';
const String p7 =
    'ثم لقي معهم امرأة من تيم الرباب اسمها قطام، وقد قتل أبوها وأخوها يوم النهر، وكانت فائقة الجمال فلما رآها أخذت قلبه فخطبها، فقالت: لا أتزوجك حتى تشتفي لي، فقال: وما تريدين؟ قالت: ثلاثة آلاف وعبدًا وقينةً وقتل علي.';
const String p8 =
    'فقال: أما قتل عليٍّ فما أراكِ ذكرته وأنت تريدينني، قالت: بلى، التمس غرته، فإن أصبته شفيت نفسك ونفسي ونفعك العيش معي، وإن قُتلت فما عند الله خير من الدنيا وما فيها، قال: والله ما جاء بي إلا قتل علي، فلك ما سألت.';
const String p9 =
    'قالت قطام سأطلب لك من يشد ظهرك ويساعدك، وبعثت إلى رجل من قومها اسمه وردان وكلمته، فأجابها، وأتى ابن ملجم رجلاً من أشجع اسمه شبيب بن بجرة، فقال له: هل لك في شرف الدنيا والآخرة؟ قال: وماذا؟';
const String p10 =
    'قال: قتل علي، قال شبيب: ثكلتك أمك لقد جئت شيئًا إدًّا، كيف تقدر على قتله؟';
const String p11 =
    'قال: أَكْمَنُ له في المسجد فإذا خرج إلى صلاة الغداة شددنا عليه فقتلناه، فإن نجونا فقد شفينا أنفسنا، وإن قتلنا فما عند الله خير من الدنيا وما فيها.';
const String p12 =
    'قال: ويحك، لو كان غير عليٍّ كان أهون، قد عرفت سابقته وفضله وبلاءه في الإسلام، وما أجدني أنشرح لقتله.';
const String p13 =
    'قال: أما تعلمه قتل أهل النهر العبَّاد الصالحين؟ قال: بلى، قال: فنقتله بمن قتل من أصحابنا، فأجابه.';
const String p14 =
    'فلما كان ليلة الجمعة وهي الليلة التي واعد ابن ملجم أصحابه على قتل علي ومعاوية وعمرو، أخذ سيفه ومعه شبيب ووردان وجلسوا مقابل السُّدَّة التي يخرج منها عليٌّ للصلاة، فلما خرج علي نادى: أيها الناس، الصلاة الصلاة، فضربه شبيب بالسيف فوقع سيفه بعضادة الباب، وضربه ابن ملجم على قرنه بالسيف، وقال: الحكم لله لا لك يا علي ولا لأصحابك.';
const String p15 =
    'ولما ضرب ابن ملجم عليًّا قال: لا يفوتنكم الرجل، فشد الناس عليه فأخذوه، وتأخر عليٌّ وقدم جعدة بن هبيرة -وهو ابن أخته أم هانئ- يصلي بالناس الغداة، وقال علي: أحضروا الرجل عندي، فأُدخِل عليه.';
const String p16 = 'فقال: أيْ عدو الله! ألم أحسن إليك؟';
const String p17 = 'قال: بلى، قال: فما حملك على هذا؟';
const String p18 =
    'قال: شحذته أربعين صباحًا، وسألت الله أن يقتل به شر خلقه، فقال علي: لا أراك إلا مقتولاً به، ولا أراك إلا من شر خلق الله.';
const String p19 =
    'ثم قال: "النفس بالنفس، إن هلكت فاقتلوه كما قتلني، وإن بقيت رأيت فيه رأيي، يا بني عبد المطلب، لا ألفينكم تخوضون دماء المسلمين تقولون: قد قُتِل أمير المؤمنين، ألا لا يقتلَنَّ إلا قاتلي، انظر يا حسن، إن أنا مِتُّ من ضربتي هذه فاضربه ضربةً بضربة، ولا تمثلَنَّ بالرجل، فإني سمعت رسول الله ﷺ يقول: "إِيَّاكُم وَالمُثلَةَ، وَلَو بِالكَلبِ العَقُورِ".';
const String p20 =
    'هذا كله وابن ملجم مكتوف، فقالت له أم كلثوم -ابنة علي-: أيْ عدو الله، لا بأس على أبي، والله مخزيك.';
const String p21 =
    'قال: فعلى مَن تبكين؟ والله إن سيفي اشتريته بألف وسممته بألف، ولو كانت هذه الضربة بأهل مصر ما بقي منهم أحد.';
const String p22 =
    'لقد تكالب أهل الفتن على علي رضى الله عنه، فمن السبئيين إلى الخوارج كلهم يسيء إليه ويخرج عليه ويحرض ويسعى في قتله طلبًا لامرأة جميلة مدعيًا أنه يتقرب إلى الله سبحانه وتعالى، وما بهم إلا أن الشيطان قد استعبدهم.';
