const int sectionIndex = 1;
const String sectionTitle = 'بطولاته فى حياة النبى ﷺ والغزوات';

const List t1 = ['1', 'رَجل مِن أهلِ الجنةِ'];
const List t2 = ['2', 'لبسه ثوب النبي ﷺ فى الهجرة'];
const List t3 = ['3', 'دفاعه عن رسول الله ﷺ بأُحد'];
const List t4 = ['4', 'خطِبته لفاطِمة بنت رسول الله ﷺ'];
const List t5 = ['5', 'مبارز عليّ لعمرو بن ود يوم الخندق'];
const List t6 = ['6', 'رجلاً يُحِبه اللَّه ورسُوله يوم خيبر'];
const List t7 = ['7', 'أنا الذي سَمتني أمي حَيدرَه'];

const String p1 =
    'هو أبو الحسن علي بن أبي طالب الهاشمي القُرشي ابن عم النبي وصهره، أوّل من أسلم من الصبيان، زوجتة فاطمة بنت رسول الله ﷺ ، وهو رابع الخلفاء الراشدين وأحد العشرة المبشرين بالجنة.';
const String p2 =
    'عن جابر رضي الله عنه قال: خرجنا مع رسول الله ﷺ إلى نخيل امرأة من الأنصار، فقال: يَطلعُ عليكم رجلٌ مِن أهلِ الجنةِ ، فطلع أبو بكر فبشرناه ثم قال: يَطلعُ عليكم رجلٌ مِن أهلِ الجنةِ فطلع عمر فبشرناه ، ثم قال: يَطلعُ عليكم رجلٌ مِن أهلِ الجنةِ وجعل ينظر من النخل ويقول: اللهُمَ إِن شِئتَ جَعلتهُ عَلِيًّا، فطلع عليّ وفي رواية أخرى: فدخل عليّ فهنأناه.';
const String p3 =
    'كان رضى الله عنه قويّ الإيمان شجاع قدم نفسه فداءً لرسول الله حين أجمعت قريش على قتله ﷺ ، فأمر النبي ﷺ عليٌ أن ينام في فراشه تلك الليلة بينما يخرج للهجرة ،  وقال له رسول الله ﷺ : نَم فِي فِراشِي وتسَجَّ بِبُردِي هذا الحضرمي فنم فيه، فإنه لن يخلص إليك شيء تكرهه منهم.';
const String p4 =
    'أخذ الراية بعد استشهاد مصعب وقتل من المشركين خلقًا كثيرًا، رغم ما أصاب المسلمين في هذه الغزوة، ثم أخذ بيد رسول الله لما وقع في الحفرة، وأخذ يطببه ويداوي جرحه مع فاطمة زوجته بنت رسول الله.';
const String p5 =
    'وظهرت شجاعته عندما أُشيع أن الرسول قد قُتل وافتقده علي، رأى أن الحياة لا خير فيها بعده، فكسر جفن سيفه وقاتل قتالاً شديداً وأصابته في ذلك ستة عشرة ضربة.';
const String p6 =
    'دخل عليّ رضى الله عنه على رسول الله يريد أن يخطب فاطمة بنت رسول الله ﷺ ، فقعد بين يديه لكنه لم يستطع الكلام لهيبته ﷺ ، فقال: مَا جاء بِك؟ أَلك حَاجة؟ فسكت، فقال عليه الصلاة والسلام: لعلكَ جئتَ تخطِبُ فاطِمةَ فقال: نعم ، قال: وَهل عِندكَ مَن شيءٍ تستحِلُّهَا بهِ؟ فقال: لا والله يا رسول الله ، فقال: مَا فعلتَ بِالدِّرعِ التِي سَلحتكهَا؟ فقال: عندي، والذي نفس عليٍّ بيده إنها لحطيمة ما ثمنها أربعمائة درهم، قال: قَد زوجتُكَ فابعَث بهَا، فإن كانت لصداق فاطمة بنت رسول الله.';
const String p7 =
    'أما عن أثاث العرس فعن عليٍّ قال: جهز رسول الله ﷺ فاطمة في خميلة وهي قطيفة بيضاء من الصوف ووسادة أدم حشوها ليف ، وفي ليلة العرس قال رسول الله لعليٍّ: لاَ تُحدِثنَّ شيئًا حَتى تَلقانِي، فدعا رسول الله بماء فتوضأ منه، ثم أفرغه على عليٍّ وقال: اللهمَّ بَارِك فيهمَا وبَارِك عليهمَا وبَارِك لهمَا في نسلهمَا.';
const String p8 =
    'خرج  يوم الخندق عمرو بن عبد ود فنادَى : من يبارز ؟ فقام عليٌّ  رضِي اللَّهُ عنهُ  وهو مُقَنع فى الحديد فقال: أنا لها يا نبيَّ اللَّهِ فقال:  إنه عمرٌو اجلس.';
const String p9 =
    'ونادى عمرو: ألا رَجلٌ، وهو يؤنبهم ويقولُ: أين جَنتكُمُ التى تزعُمون أنه مَن قُتِلَ منكم دخلها ؟ أفلا يَبرُز إليَّ رجُل؟ فقام عليٌّ فقال: أنا يا رسول اللَّهِ فقال: اجلِس.';
const String p10 =
    'ثم نادَى الثالثة وذكر شِعرًا، فقام عليٌّ فقال: يا رسولَ اللَّهِ أنا فقالَ: إنَّه عمرٌو ، قال: وإِن كان عَمرًا، فأذِن له رسولُ اللهِ ﷺ .';
const String p11 =
    'فمشى إليه حتى أتاه وذكر شعرًا فقال له عمرٌو: من أنت؟  قال: أنا عليٌّ قال: ابن عبدِ مناف؟ فقال: أنا عليُّ بن أبى طالب ، فقال: غَيرُك يا ابن أخِى من أعمامِك من هو أسَنُّ منك فإنى أكرَه أن أهريق دمك، فقال عليٌّ : لكنى واللهِ ما أكرَهُ أن أهريق دمك.';
const String p12 =
    'فغضب فنزل وسَلَّ سَيفه كأنه شعلة نار ثم أقبل نحو عليٍّ  مُغضبًا ، واستقبلَه عليٌّ بدرقتِه ، فضربه عمرٌو في الدَّرَقةِ فقَدَّها ، وأثبت فيها السيف وأصاب رأسه بشجَّةٍ ، وضربه عليٌّ على حبلِ العاتِق فسقط ، وثارَ العَجاجُ ، وسَمِعَ رسولُ اللَّهِ ﷺ التكبيرَ، فعرفَ أن عَليًّا قد قتله.';
const String p13 =
    'يوم غزوة خبير قال رسول الله ﷺ : لأُعْطِيَنَّ هَذِهِ الرَّايَةَ رَجُلاً يَفْتَحُ اللَّهُ عَلَى يَدَيْهِ يُحِبُّ اللَّهَ وَرَسُولَهُ وَيُحِبَّهُ اللَّهُ وَرَسُولُهُ.';
const String p14 =
    'فبات الناس يدوكون ليلتهم أيهم يعطاها قال: فلما أصبح الناس غدوا كلهم يرجون أن يعطاها فقال رسول الله: أينَ عَلِيُّ؟ فقالوا: يا رسول الله يشتكي عينيه قال: فأرسِلوا إِليهِ.';
const String p15 =
    'فأتي به فبصق رسول الله ﷺ في عينيه ودعا له فبرئ وأعطاه الراية، فقال عليّ: يا رسول الله أقاتلهم حتى يكونوا مثلنا؟ فقال: انفُذ عَلى رِسلِك حَتى تنزِلَ بِساحتِهم، ثمَ ادعهم إلى الإِسلامِ وأخبرهم بما يجِب عليهم من حقِ اللَّهِ فيهِ، فواللَّهِ لأن يهدِي اللَّهُ بكَ رجلاً واحدًا خير لكَ من أن يَكونَ لكَ حُمر النعَمِ.';
const String p16 =
    'بعد وصية رسول الله اخذ عليّ الراية وهاجم  حصن ناعم خط الدفاع الأول لليهود من حصون اليهود الثمانية، وكان فى هذا الحصن مرحب اليهودي‏.‏';
const String p17 =
    'وخرج عليه مرحب فقال: قد علمت خيبر أني مرحب شاكي السلاح  ..  بطل مجرب إذا الحروب أقبلت تلهب';
const String p18 =
    'رد عليه فقال عليّ : أنا الذي سَمتني أمي حَيدرَه .. كلَيثِ غاباتٍ كريهِ المنظرَه';
const String p19 =
    'ثم قام عليّ فضرب رأس مرحب فقتله ثم كان الفتح على يديه ، واستمر القتال حتى أسقط الله جانبي خيبر بكل حصونهما وتم الفتح.';
