const int sectionIndex = 1;
const String sectionTitle = 'مواقفه فى حياة النبى ﷺ';

const List t1 = ['1', 'عثمان بن عفان القرشي'];
const List t2 = ['2', 'رَجلٍ تستحِي مِنهُ الملائِكة'];
const List t3 = ['3', 'مفاوضاته فى صلح الحديبية'];
const List t4 = ['4', 'إشاعة مقتل عثمان فى صلح الحديبية'];
const List t5 = ['5', 'بئر رومة'];
const List t6 = ['6', 'تجهيز جيش العسرة'];
const List t7 = ['7', 'توسعة المسجد النبوي'];

const String p1 =
    'أبو عبد الله عثمان بن عفان الأموي القرشي ثالث الخلفاء الراشدين، وأحد العشرة المبشرين بالجنة، وكان أنسب لقريش وأعلم بمن فيها من خيرٍ وشر، وكان رجال قريش يأتونه لأمور علمه وتجارته وعلمه وحسن مجالسته. ';
const String p2 =
    'كان  يكنى ذا النورين لأنه تزوج اثنتين من بنات نبي الإسلام محمد، حيث تزوج من رقية ثم بعد وفاتها تزوج من أم كلثوم.';
const String p3 =
    'هاجر إلى الحبشة ثم هاجر إلى المدينة، وكان رسول اللَّه يثق به ويحبه ويكرمه لما يبذله من المال لنصرة المسلمين، وبشّره بالجنة وأخبره بأنه سيموت شهيداً.';
const String p4 =
    'كان رضي الله عنه أكثر الناس حياءً فعن عائشة رضي الله عنها، قالت: كان رسول اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مُضطجعًا في بيتي، كاشفًا عن فخذيهِ أَو ساقيهِ، فاستأذن أَبو بكرٍ فأذِن لَهُ، وهو على تِلك الحالِ، فتحَدث، ثمّ استأذن عُمَر، فأذِن لَهُ، وهو كذلِك، فتحَدث،';
const String p5 =
    'ثمّ استأذن عُثمان، فجلس رَسول اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وسَوَّى ثيَابهُ، فدخلَ فتحَدث، فلما خرَجَ قالت عائشَة: دخل أَبو بكرٍ فلم تهتَشَّ لَهُ وَلم تُبالِهِ، ثم دخل عُمر فلم تهتَشَّ لَهُ وَلم تُبالِهِ، ثم دخل عُثمان فجلست وسَويت ثِيابك؟';
const String p6 = 'فَقال: أَلَا أَستحِي مِن رَجلٍ تستحِي مِنهُ الملائِكة.';
const String p7 =
    'خرج عثمان بن عفان رضي الله عنه حتى أتى بلدح - مكان قريب من مكة - فوجد قريشا هناك فقالوا: أين تريد؟ قال: بعثني رسول الله ﷺ إليكم، يدعوكم إلى الله وإلى الإسلام، تدخلون في دين الله كافة، فإن الله مظهر دينه ومعز نبيه وأخرى تكفون ويَلِي هذا منه غيركم، فإن ظفروا بمحمد فذلك ما أردتم وإن ظفر محمد كنتم بالخيار أن تدخلوا فيما دخل فيه الناس أو تقاتلوا وأنتم وافرون جامون، إن الحرب قد نهكتكم وأذهبت بالأماثل منكم.';
const String p8 =
    'فجعل عثمان يكلمهم فيأتيهم بما لا يريدون ويقولون: قد سمعنا ما تقول ولا كان هذا أبدا، ولا دخلها علينا عنوة فارجع إلى صاحبك فأخبره أنه لا يصل إلينا، فقام إليه أبان بن سعيد بن العاص فرحب به وأجاره وقال: لا تقصر عن حاجتك، ثم نزل عن فرس كان عليه فحمل عثمان على السرج وردفه وراءه، فدخل عثمان مكة فأتى أشرافهم رجلا رجلا أبا سفيان بن حرب وصفوان بن أمية وغيرهما من لقي ببلدح ومنهم من لقي بمكة، فجعلوا يردون عليه: إن محمدا لا يدخلها علينا أبدا.';
const String p9 =
    'وعرض المشركون على عثمان رضي الله عنه أن يطوف بالبيت فأبى، وقام عثمان بتبليغ رسالة رسول الله ﷺ إلى المستضعفين بمكة وبشرهم بقرب الفرج والمخرج، وأخذ منهم رسالة شفهية إلى رسول الله ﷺ جاء فيها: اقرأ على رسول الله ﷺ منا السلام، إن الذي أنزله بالحديبية لقادر على أن يدخله بطن مكة.';
const String p10 =
    'تسربت شائعة إلى المسلمين أن عثمان قُتل، فدعا رسول الله ﷺ أصحابه إلى مبايعته على قتال المشركين ومناجزتهم فاستجاب الصحابة وبايعوه على الموت سوى الجد بن قيس وذلك لنفاقه، وكان أول من بايعه على ذلك أبا سنان عبد الله بن وهب الأسدي.';
const String p11 =
    'فخرج الناس بعده يبايعون على بيعته وقال النبي ﷺ بيده اليمنى: هذه يد عثمان فضرب بها على يده، وكان عدد الصحابة الذين أخذ منهم الرسول ﷺ المبايعة تحت الشجرة ألف وأربعمائة صحابي، وقد تحدث القرآن الكريم عن أهل بيعة الرضوان، قال تعالى: إِن الذين يبايِعونكَ إِنمَا يُبايِعونَ اللهَ يَدُ اللهِ فوقَ أيدِيهِم فمن نكَث فإنمَا يَنكُث عَلى نفسِهِ وَمَن أوفى بِما عاهدَ عَليهُ اللهَ فسَيؤتِيهِ أجرًا عظيمًا.';
const String p12 =
    'كانت بئر رومة قبل قدوم النبي ﷺ لا يشرب منه أحد إلا بثمن، فلما قدم المهاجرون المدينة استنكروا الماء وكانت لرجل من بني غفار عين يقال لها رومة وكان يبيع منها القربة بِمُدّ، فقال النبي ﷺ : تبيعها بعين في الجنة؟ فقال: يا رسول الله ليس لي ولا لعيالي غيرها، فبلغ ذلك عثمان رضي الله عنه فاشتراها بخمسة وثلاثين ألف درهم، ثم أتى النبي ﷺ فقال: أتجعل لي فيها ما جعلت له؟ قال: نعم قال: قد جعلتها للمسلمين.';
const String p13 =
    'حين جهَّز النبي صلَّى اللهُ علَيه وسلَّم  جيش العسرة أثناء الخروج لغزوة تبوك، جاء عثمان بن عفان بألف دِينار فنثرها في حجرِ النبي صلَّى اللهُ علَيه وسلَّم ، فقلب النبي الألف دينارٍ وهو يقول: ما ضرَّ عثمان ما عمل بعد اليوم، أي: لا يَضُر عثمان ما فعل من الذنوب بعد اليوم فقد غفر الله له.';
const String p14 =
    'أراد النبي ﷺ توسعة المسجد فرغب من بعض الصحابة أن يشتري بقعة بجانب المسجد، فقال ﷺ : من يشتري بقعة آل فلان فيزيدها في المسجد بخير له منها في الجنة؟ فاشتراها عثمان رضي الله عنه من صلب ماله بخمسة وعشرين ألف درهم.';
