const int sectionIndex = 1;
const String sectionTitle = 'مرافقته وصحبته النبى ﷺ';

const List t1 = ['1', 'عبد الله بن أبي قُحافة'];
const List t2 = ['2', 'أولَ من دعا إلى الإسلام'];
const List t3 = ['3', 'الصديق'];
const List t4 = ['4', 'موقفه فى أعتاق بلال'];
const List t5 = ['5', 'فأما مَن أَعطى وَاتقى'];
const List t6 = ['6', 'رجلً بأمة'];
const List t7 = ['7', 'الهجرة - الصُحبَةُ يا رسولَ اللَّهِ'];
const List t8 = ['8', 'الهجرة - إِذ يَقولُ لِصاحبهِ'];
const List t9 = ['9', 'بُكاءه والنبى ﷺ على المنبر'];
const List t10 = ['10', 'ثباته يوم وفاه رسول الله ﷺ'];

const String p1 =
    'هو عبد الله بن أبي قُحافة التَّيمي القُرَشيّ، أولُ الخُلفاء الراشدين، وأحد العشرة المُبشرين بالجنَّة، وهو وزيرُ نبيّ الإسلام مُحمد وصاحبهُ، ورفيقهُ عند هجرته إلى المدينة المنورة.';
const String p2 =
    'كان أبو بكر الصديق رضي الله عنه أول من آمن بالنبي ﷺ من الرجال الأحرار والأشراف فهو من أخص أصحاب رسول الله ﷺ قبل البعثة وفيه قال رسول الله ﷺ : مادعوت أحداً إلى الإسلام إلا كانت عنده كبوة، وتردد ونظر، إلا أبا بكر، ماعَكَم حين دعوته ولاتردد فيه فأبو بكر صاحب رسول الله ﷺ ، وهو حسنة من حسناته عليه الصلاة والسلام لم يكن إسلامه إسلام رجل بل كان إسلامه إسلام أمة.';
const String p3 =
    'ولما اجتمع أصحاب النبي محمد، وكانوا ثمانية وثلاثين رجلاً، ألحَّ أبو بكر على النبي في الظهور، فقال: يا أبا بكر إنا قليل، فلم يزل أبو بكر يلح حتى ظهر الرسول ﷺ ، وتفرق المسلمون في نواحي المسجد كل رجل في عشيرته، وقام أبو بكر في الناس خطيباً والرسول جالس، فكان أولَ خطيب دعا إلى الإسلام، وثار المشركون على أبي بكر وعلى المسلمين، فضربوه في نواحي المسجد ضرباً شديداً.';
const String p4 =
    'وبعد الأسراء والمعراج ذهب بعض الناس إلى أبي بكر الصديق رضي الله عنه فقالوا: هل لك إلى صاحبك يزعم أنه أسري به الليلة إلى بيت المقدس قال: أو قال ذلك؟ قالوا: نعم قال: لئن كان قال ذلك لقد صدق قالوا: أو تصدقه أنه ذهب الليلة إلى بيت المقدس وجاء قبل أن يصبح؟ قال: نعم إني لأصدقه فيما هو أبعد من ذلك أصدقه بخبر السماء في غدوة أو روحة فلذلك سُميَّ أبو بكر الصديق.';

const String p5 =
    'كان يُنفق أمواله بسخاء لاستنقاذ المعذَّبين من أيدي مجرمي مكة، فجعل جُلَّ اهتمامه مع من أشدهم تعذيبًا وألمـًا وهو بلال بن رباح رضي الله عنه وكان عبدًا لأمية بن خلف.';
const String p6 =
    'وطلب أمية ثمنًا مبالَغًا فيه وهو خمسة أواقٍ، فما تردَّد الصديق رضي الله عنه وما ساوم عليه ثم أعتقه.';
const String p7 =
    'وأراد أمية بن خلف أن يغيظ الصديق بعد أن تمَّت عملية البيع، فأخبره أنه لو عرض شراء بلال بأوقية واحدة لباعه دلالة على خسارة الصديق فى الصفقة، فإذا بالصديق رضي الله عنه يقول له: لو أبيتم إلا مائة أوقية لأخذته.';

const String p8 =
    'عن عبد الله بن الزبير رضي الله عنهما قال: قال أبو قحافة لابنه أبي بكر رضي الله عنهما: يَا بُني، إِنِّي أراكَ تعتِق رقابًا ضعَافًا، فلو أنك إِذ فعلت ما فعلت أعتقت رجالاً جلدًا يمنعونك ويقومون دُونكَ، فقال أبو بكر: يا أبتِ، إني أريد ما أريد.';
const String p9 =
    'ثم نزلَ قول الله تعالى: فأما مَن أَعطى وَاتقى وَصَدَّقَ بِالحُسنَى فسَنُيَسِّرُهُ لِليُسرَى.';

const String p10 =
    'عن أبي هريرة رضي الله عنه، قال: قال رسول الله ﷺ : ما لأحدٍ عِندنا يَد إِلا وقد كَافيناهُ ما خلاَ أبا بكرٍ فإِن له عِندنا يدًا يُكافِئهُ اللهُ بِهِ يوم القِيامةِ، وما نفعنِي مَالُ أحدٍ قط مَا نفعنِي مالُ أبي بكرٍ، ولو كنتُ مُتخِذًا خلِيلاً لاتخذتُ أبا بكرٍ خلِيلاً، أَلا وإِن صاحبكم خلِيلُ اللهِ.';
const String p11 =
    'وكان أبو بكر أشد الناس إيمانًا، ففي حديث رسول الله ﷺ في مسند الإمام أحمد عَنِ ابنِ عمر قال: خرج علينا رَسول اللَّهِ ذات غداةٍ بعد طلوعِ الشَمسِ، فقالَ: رأيتُ قُبيلَ الفجرِ كأنِّي أُعطِيتُ المقالِيد والموازِين، فأمَّا المقالِيدُ فهذه المفاتِيح، وأمَّا الموازِين فهي التِي تزِنونَ بها، فوضِعتُ فِي كِفةٍ وَوُضِعت أمتِي في كِفةٍ، فوُزِنتُ بهم، فرَجحتُ، ثم جِيء بِأبي بَكرٍ، فوُزِنَ بِهِم فوزنَ.';

const String p12 =
    'ولما جاء رسول الله ﷺ إلى بيت أبي بكر في ساعة لم يكن يأتيهم فيها، أول ما قاله أبو بكر قال: فداء له أبي وأمي، والله ما جاء به في هذه الساعة إلا أمر، أخبره رسول الله بأمر الهجرة قال أبو بكر الصديق بلهفة: الصُحبَةُ يا رسولَ اللَّهِ قال رسول الله: الصُحبَة، فقالت عائشة رضى الله عنها: فوالله ما شعرت قط قبل ذلك اليوم أن أحدًا يبكي من الفرح حتى رأيت أبا بكر يبكي يومئذ.';

const String p13 =
    'ولما انتهيا إلى الغار قال أبو بكر: والله لا تدخله حتى أدخله قبلك، فإن كان فيه شر أصابني دونك، فدخل فكسحه، ووجد في جانبه ثقبًا، فشق إزاره وسدها به، وبقى منها اثنان فألقمهما رجليه، ثم قال لرسول الله ﷺ : ادخل. فدخل رسول الله، ووضع رأسه في حجره ونام، فلُدغ أبو بكر في رجله من الجُحر، ولم يتحرك مخافة أن ينتبه رسول الله، فسقطت دمعة على وجه رسول الله فقال: مَا لك يَا أبا بَكرٍ فقال: لدغت، فداك أبي وأمي يا رسول الله.';
const String p14 =
    'وبدأ المشركون باقتفاء أثر النبي ﷺ ، فلما بلغوا جبل ثور اختلط عليهم، فصعدوا الجبل فمروا بالغار، فرأوا على بابه نسج العنكبوت، فقالوا: لو دخل ها هنا أحد لم يكن نسج العنكبوت على بابه، وعن أنس بن مالك أن أبا بكر حدثه فقال: قلت للنبي ونحن في الغار: لو أن أحدهم نظر إلى قدميه لأبصرنا تحت قدميه؟ فقال: يا أبا بكر ما ظنك باثنين الله ثالثهما.';
const String p15 =
    'قال الله تعالى: إِلا تنصُرُوهُ فقد نصَرَهُ اللَّهُ إِذ أخرجَهُ الذِين كفرُوا ثانِيَ اثنينِ إِذ هُمَا فِي الغارِ إِذ يقولُ لِصاحبهِ لَا تحزن إِنَّ اللَّهَ معنَا فأنزلَ اللَّهُ سكِينتهُ عليهِ وأيدَهُ بِجُنودٍ لَم ترَوهَا وَجعلَ كلِمةَ الذِينَ كَفرُوا السفلى وكلِمَةُ اللَّهِ هِيَ العُليَا وَاللَّهُ عَزِيز حَكِيم';

const String p16 =
    'كان أبو بكر رضيَ اللهُ عنه أقرب الناسِ إلى النبي صلى اللهُ عليه وسلم فهو رَفيقه في هجرته، وهو أعظم هذه الأمةِ إيمانا وتصديقا، ولو وُزِن إيمانُه بإيمان الناسِ كلهم، لرجح إيمانُه بإيمانِهم.';
const String p17 =
    'ويُخبرنا أبو سعيد الخدري رضي اللهُ عنه أن رسول اللهِ صلى اللهُ عليه وسلم جلس على المنبر في مرضه الأخير الذي مات فيه وقال:';
const String p18 =
    'إن عبدًا خيَّره اللهُ بين أن يؤتيه من زهرةِ الدنيا ما شاء وبين ما عنده فاختار ما عنده، فبكى أبو بكرٍ وقال: فديناك بآبائِنا وأمهاتنا، فكان رسولُ اللهِ صلَّى اللهُ عليه وسلَّم هو المُخيرَ، وكان أبو بكرٍ أعلمَنا به فقال رسولُ اللهِ صلَّى اللهُ عليه وسلَّم: إن أمَنَّ الناسِ عليَّ في مالِه وصُحبتِه أبو بكرٍ ولو كنت متخِذًا خليلًا لاتخذتُ أبا بكرٍ خليلًا ولكِن أخوة الإسلامِ لا يبقين في المسجدِ خوخةٌ إلَّا خوخةُ أبي بكرٍ.';

const String p19 =
    'ولما ثقُل على النبي محمد ﷺ المرض، أمر أبا بكر أن يصلي بالناس، قالت السيدة عائشة: لما مرض النبي مرضه الذي مات فيه فحضرت الصلاة فأذن بلال، فقال: مروا أبا بكر فليصل بالناس، فقيل له: إن أبا بكر رجل أسيف - رقيق القلب - إذا قام مقامك لم يستطع أن يصلي بالناس، وأعاد فأعادوا له فأعاد الثالثة، فقال: إنكن صواحب يوسف، مروا أبا بكر فليصل بالناس.';
const String p20 =
    'ولما كان يوم الاثنين الذي توفي فيه، بعد ثلاثة عشر يوماً على مرضه، خرج إلى الناس وهم يصلون الصبح ففرحوا به، ثم رجع فاضطجع في حجر عائشة بنت أبي بكر، فتُوفي وهو يقول بل الرفيق الأعلى من الجنة، وكان ذلك ضحى يوم الاثنين ربيع الأول سنة 11 هـ';
const String p21 =
    ' فلما توفي قام عمر بن الخطاب، فقال والله ما مات رسول الله وليبعثنه الله فليقطعنّ أيدي رجال وأرجلهم وجاء أبو بكر مسرعاً فكشف عن وجهه وقبّله، وقال بأبي أنت وأمّي، طبتَ حياً وميتاً، ثم خرج وخطب بالنّاس قائلاً: ألا من كان يعبد محمدًا فإنّ محمدًا قد مات، ومن كان يعبد الله فإن الله حيّ لا يموت، وقرأ: وَما مُحمد إِلا رَسول قد خلت مِن قبلِهِ الرسُلُ أَفإِن مَّاتَ أَو قُتِلَ انقلبتم عَلى أَعقابِكم وَمن يَنقلِب علىَ عقِبيهِ فلن يَضُرَّ اللّهَ شَيئا وَسيجزِي اللّهُ الشاكِرِين.';
const String p22 =
    'قالت السيدة عائشة: فوالله لكأن الناس لم يكونوا يعلمون أن الله أنزل هذه الآية حتى تلاها أبو بكر رضيَ الله عنه، فتلقاها منه الناس، فما يُسمع بشر إلا يتلوها.';
