const int sectionIndex = 2;
const String sectionTitle = 'خلافته بعد مقتل عثمان';

const List t1 = ['t1', 'مبايعه عليٌ للخلافة بعد مقتل عثمان'];
const List t2 = ['t2', 'القصاص وانقسام الصحابة'];
const List t3 = ['t3', 'معاوية يرفض البيعة وعليٌ يخرج إليه'];
const List t4 = ['t4', 'عليٌ يتجه إلى البصرة لرد الصحابة'];

const String p1 =
    'بعد استشهاد عثمان رضى الله عنه خشي أهل الفتنة على أنفسهم إن لم يقبل أحد الصحابة الخلافة وقالوا: إن نحن رجعنا إلى أمصارنا، دون أن يكون هناك خليفة فلن نسلم لذا عزموا وهم في أوْج قوتهم، وسيطرتهم على الأوضاع بالمدينة- على أن يُوَلُّوا خليفة بأقصى سرعة.';
const String p2 =
    'فجمعوا أهل المدينة وقالوا لهم: يا أهل المدينة أنتم أهل الشورى وأنتم تعقدون الإمامة وحكمكم جائز على الأمة، فانظروا رجلاً تنصبونه ونحن لكم تبعٌ وقد أجلناكم يومكم، فوالله لئن لم تفرغوا لنقتلَنَّ غدًا عليًّا وطلحة والزبير وأناسًا كثيرًا ، فغشي الناس عليًّا فقالوا: نبايعك ، فقد ترى ما نزل بالإسلام وما ابتلينا به من بين القرى.';
const String p3 =
    'رأى عليٌ تأجيل تنفيذ القصاص حتى تستقر الأمور في المدينة وكان كثير من الصحابة مع عليٍ في رأيه، ولكن كان هناك مجموعتان يرون رأيًا مخالفًا فكانوا يرون وجوب القصاص الفوري من قتلة عثمان.';
const String p4 =
    'فريق يضم السيدة عائشة وطلحة بن عبيد الله والزبير بن العوام ، وفريق يضم معاوية بن أبي سفيان والي الشام من قِبَل عثمان والذي يعتبر نفسه وَلِيَّ دمه لأنه من بني أمية مثله.';
const String p5 =
    'أرسل علي رضى الله عنه إلى معاوية يبلغه ببيعة المسلمين له، ويطلب منه ومن أهل الشام البيعة، ولكن معاوية رضى الله عنه أرسل إليه يطلب منه أن يقتص أولاً من قتلة عثمان ثم يبايعه، أو أن يُخَلِّي علي رضى الله عنه بين معاوية وأهل الشام وبين قتلة عثمان ليقتصوا منهم، ويكون الأمر بعيدًا عن الخليفة فلا يتحمل مسئوليته أمام أهل الفتنة، ثم يبايع معاوية وأهل الشام عليًّا بعد ذلك.';
const String p6 =
    'لكن عليًّا رضى الله عنه رفض ذلك، واعتبر ذلك عصيانًا من معاوية رضى الله عنه فقرَّر عزله عن الشام، وأرسل سهل بن حنيف واليًا جديدًا، ولكن أهل الشام منعوه من الوصول وردُّوه إلى المدينة.';
const String p7 =
    'فقرَّر عليٌ رضى الله عنه أن يغزو معاوية وأهل الشام، باعتبار الشام أصبح إقليمًا خارجًا ومنشقًّا عن الدولة، وهي نظرة وجيهة، فقد بايع المسلمون عليًّا وهذا والٍ يرفض البيعة ويرفض السمع والطاعة، فى حين رأى معاوية رضى الله عنه أنه وأهل الشام لم يبايعوا عليًّا رضى الله عنه بعدُ ولذلك لا ينطبق عليهم حكم الخارجين ولهم عذر، ولكن الحق كان مع علي رضى الله عنه وستثبت الأحداث صحة موقف عليٍّ رضى الله عنه.';

const String p8 =
    'بينما عليٌ رضى الله عنه يستعد للخروج إلى الشام، وجد أن الفريق الثاني - الذي يضم السيدة عائشة والزبير وطلحة - قد خرج دون إنذار إلى البصرة، فقد رأى هؤلاء الصحابة الكرام أن عليًّا رضى الله عنه في موقف حرج يمنعه من القصاص، ووجدوا في أنفسهم وأنصارهم القدرة على ذلك، ومن ثَمَّ قرَّروا الخروج إلى البصرة لتنفيذ القصاص في قتلة عثمان رضى الله عنه وللإصلاح بين المسلمين، وإيقاف الخلافات بما لهؤلاء الصحابة الكرام جميعًا لدى المسلمين من مكانة، وكان ذلك في شهر جمادى الآخرة سنة 36هـ.';
const String p9 =
    'فُوجئ علي رضى الله عنه بهذا التحرك فقرَّرَ بدلاً من المسير إلى أهل الشام أن يتجه إلى البصرة بجيشه لا ليقاتل هؤلاء الصحابة، بل ليردهم إلى المدينة، ولكنَّ الحسن بن علي رضى الله عنه نصحه بعدم الذهاب، لأنه رضى الله عنه يرى أن تواجه الجيوش لا بد أن يُسفِر عن حروب وخسائر دامية، ولكن عليًّا رضى الله عنه صمَّم على الذهاب.';
