const int sectionIndex = 3;
const String sectionTitle = 'عثمان بن عفان';

const String p25 =
    'نشأ بمصر طائفة من أبناء الصحابة يؤلبون الناس على حرب عثمان  والإنكار عليه وخاض المنافقون فى الشائعات وانتشرت العصبية الجاهلية.';
const String p26 =
    'وتكاتب أهل مصر وأهل الكوفة وأهل البصرة وتراسلوا ، وزورأهل الفتنة  كتب ومراسلات على لسان الصحابة وعلى لسان علي وطلحة والزبير، يدعون الناس إلى قتال عثمان ونصر الدين  وكذلك زور كتاب على لسان عثمان أيضا.';
const String p27 =
    'استمر عثمان يصلي بالناس في تلك الأيام كلها وهم أحقر في عينه من التراب، فلما كان في بعض الجمعات وقام على المنبر، وفي يده العصا التي كان يعتمد عليها رسول الله ﷺ في خطبته وأبو بكر وعمر من بعده، فقام إليه رجل من أولئك فسبه ونال منه وأنزله عن المنبر.';
const String p28 =
    'وأخذ العصا فكسرها على ركبته اليمنى فدخلت شظية منها فيها، فبقي الجرح حتى أصابته الأكلة فتدود الجرح بعد ذلك، ونزل عثمان وحملوه وأمر بالعصا فشدوها، وما خرج بعد ذلك اليوم حتى قُتل.';
const String p29 =
    'صباح يوم الجمعة 18 من ذي الحجة سنة 35 هـ، يدخل الصحابى كثير بن الصلت على عثمان بن عفان رضى الله عنه ويقول له: يا أمير المؤمنين اخرج فاجلس في فناء البيت فيرى الناس وجهك، فإنك إن فعلت ارتدعوا، وذلك لهيبته رضي الله عنه فقد كان عمره رضي الله عنه أكثر من اثنين وثمانين سنة.';
const String p30 =
    'فقال عثمان رضي الله عنه له لقد رأيت البارحة، وكأني دخلت على نبي الله ﷺ ، وعنده أبو بكر وعمر فقال: ارجع فإنك مفطر عندي غدًا، ثم قال عثمان رضي الله عنه لن تغيب الشمس هذا اليوم والله إلا وأنا من أهل الآخرة.';
const String p31 =
    'خرج كثير بن الصلت رضي الله عنه بأمر عثمان بن عفان رضي الله عنه، وأمر عثمان رضي الله عنه بالسراويل أن تُعدّ له لكي يلبسها، وكان من عادته رضي الله عنه ألا يلبسها في جاهلية ولا إسلام، وقد لبسها رضي الله عنه لأنه خشي إن قُتل أن يتكشف، وهو رضي الله عنه شديد الحياء فلبس السراويل ووضع المصحف بين يديه وأخذ يقرأ في كتاب الله.';
const String p32 =
    'ودخل عليه أبناء الصحابة للمرة الأخيرة وطلبوا منه أن يسمح لهم بالدفاع عنه، فأقسم عثمان رضي الله عنه على كل من له عليه حق أن يكفّ يده، وأن ينطلق إلى منزله ثم قال لغلمانه: من أغمد سيفه فهو حرّ فأعتق بذلك غلمانه، وقال رضي الله عنه أنه يريد أن يأخذ موقف ابن آدم الذي قال: لئِن بَسطت إِليَّ يدك لِتقتلنِي ما أنا بباسِطٍ يدِيَ إِليكَ لِأقتُلكَ إِنِّي أخافُ اللهَ رَبَّ العالمِين إِنِّي أرِيد أن تبُوءَ بإثمِي وإِثمك فتكونَ مِن أصحابِ النارِ وذلِك جزاءُ الظالمِين.';
const String p33 =
    'جلس عثمان رضي الله عنه يقرأ في المصحف وكان أهل الفتنة يفكرون بشكل حاسم في قتل عثمان رضي الله عنه خاصة مع علمهم باقتراب الجيوش الإسلامية المناصرة للخليفة رضي الله عنه من المدينة المنورة.';
const String p34 =
    'فدخل رجل يُسمى كنانة بن بشر التجيبي وكان من رءوس الفتنة بشعلة من نار وحرق بابَ بيتِ عثمان رضي الله عنه، ودخل ومعه بعض رجال الفتنة ثم دخل رجل آخر يسمونه الموت الأسود، قيل إنه عبد الله بن سبأ وقيل غيره فخنق عثمان بن عفان رضي الله عنه خنقًا شديدًا حتى ظن أنه مات فتركه وانصرف .';
const String p35 =
    'ودخل بعد ذلك محمد بن أبي بكر الصديق وكما ذكرنا أنه كان الوحيد من الصحابة الذي شارك في هذه الفتنة في هذا الوقت فدخل عليه وكان يظنه قد مات، فوجده حيًّا فقال له: على أي دين أنت يا نعثل، ونعثل هذه سُبّة تُقال للشيخ الأحمق وللظبي كثير الشعر، فقال عثمان رضي الله عنه وأرضاه: على دين الإسلام ولست بنعثل ولكني أمير المؤمنين، فقال: غيّرت كتابَ الله فقال عثمان رضي الله عنه: كتاب الله بيني وبينكم.';
const String p36 =
    'فتقدم إليه وأخذ بلحيته وهزّه منها وقال: إنا لا نقبل أن نكون يوم القيامة مما يقول: رَبنا إِنَّا أطعنا سَادَتنا وَكبراءَنا فأَضلونَا السبيلَ.';
const String p37 =
    'فإلى هذه اللحظة ومحمد بن أبي بكر الصديق وبعض أفراد الفتنة يظنون أنهم يفعلون الخير بقتلهم أو خلعهم لعثمان رضي الله عنه، فهو يحاول القتل أو الخلع للخليفة طاعة لله ونجاة من النار، وهذا بلا شك من تلبيس إبليس عليهم.';
const String p38 =
    'فقال عثمان رضي الله عنه: يا ابن أخي إنك أمسكت لحية كان أبوك يكرمها فلما قال له عثمان رضي الله عنه ذلك وضحت الحقيقة فجأةً أمام محمد بن أبي بكر الصديق رضي الله عنه، وكأن عثمان رضي الله عنه أزال بهذه الكلمات غشاوة كانت تحجب الحق والصواب عن قلب محمد بن أبي بكر.';
const String p39 =
    'وتذكر مواقف عثمان رضي الله عنه مع رسول الله ﷺ ومع أبيه الصديق رضي الله عنه، ومع المسلمين فاستحيا محمد بن أبي بكر رضي الله عنهما، وخارت يده من على لحية عثمان بن عفان رضي الله عنه وبكى ثم وقف وتركه وانصرف فوجد القوم يدخلون على عثمان رضي الله عنه فأمسك سيفه، وبدأ يدافع عن عثمان رضي الله عنه ولكنهم غلبوه فلم يستطع أن يمنعهم، وتشهد بذلك السيدة نائلة بنت الفرافصة زوجة عثمان رضي الله عنه.';
const String p40 =
    'ثم دخل كنانة بن بشر الملعون على عثمان رضي الله عنه وحمل السيف وضربه به فاتّقاه عثمان بيده فقطع يده، فقال عثمان رضي الله عنه عندما ضُرب هذه الضربه: بسم الله توكلت على الله فتقطرت الدماء من يده فقال: إنها أول يد كتبت المفصل ،ثم قال: سبحان الله العظيم وتقاطر الدم على المصحف، وتثبت جميع الروايات أن هذه الدماء سقطت على كلمة فسيكفِيكهمُ اللَّهُ وَهوَ السمِيع العليمُ.';
const String p41 =
    'بعد ذلك حمل عليه كنانة بن بشر وضربه بعمود على رأسه فخرّ رضي الله عنه على جنبه، وهمّ كنانة الملعون بالسيف ليضربه في صدره فانطلقت السيدة نائلة بنت الفرافصة تدافع عن زوجها، ووضعت يدها لتحمى زوجها من السيف فقُطعت بعض أصابعها بجزء من كفها ووقعت السيدة نائلة رضي الله عنها.';
const String p42 =
    'وطعن كنانةُ عثمانَ رضي الله عنه في صدره ثم قام سودان بن حمران بحمل السيف وطعن عثمان رضي الله عنه في بطنه فمال رضي الله عنه إلى الأرض فقفز على بطنه، واتّكأ على السيف بجسده ليتأكد من اختراق السيف لجسد عثمان رضي الله عنه، ومات رضي الله عنه وأرضاه بعد هذه الضربة.';
const String p43 = 'ترك عثمان رضي الله عنه في بيته وصية كان فيها:';
const String p44 =
    'بسم الله الرحمن الرحيم عثمان بن عفان يشهد أن لا إله إلا الله وحده لا شريك له وأن محمدًا عبده ورسوله وأن الجنة حق وأن النار حق وأن الله يبعث من في القبور ليوم لا ريب فيه إن الله لا يخلف الميعاد عليها يحيى وعليها يموت وعليها يبعث إن شاء الله تعالى .';

const String p45 =
    'قد كفى الله تعالى عثمان رضي الله عنه فكل من شارك في قتله مات مقتولاً.';
const String p46 =
    'فقد قُتِل كنانة بن بشر مخذولاً في مصر على يد جيش عمرو بن العاص، وقُتِل محمد بن أبي بكر الصديق بعدها، ومات الأشتر النخعي من شربة عسل مسمومة.';
const String p47 =
    'وقد قتل الحجاج بن يوسف الثقفي رجلين منهم بعد أربعين سنة من ذلك من أجل قتلهما عثمان وهما عمير بن ضابىء البرجمي وكميل بن زياد النخعي.';
const String p48 =
    'ومن القتلة المباشرين قُتِل اثنان فور مقتله، قتلهما عبيد عثمان وهما قتيرة السكوني وقيل الآخر هو سودان بن حمران السكوني.';
const String p49 =
    'قُتِل حكيم بن جبلة وكل من شارك من أهل البصرة بأمر من طلحة والزبير رضي الله عنهما بعد معارك بالبصرة وكانوا نحو ستمائة رجل ولم ينج منهم إلا حرقوص بن زهير السعدي قتل بعد ذلك بمدة وكانت قد منعته قبيلته.';
