const int sectionIndex = 55;
const String sectionTitle = 'صلح الحديبية - تحت الشجرة';

const List t1 = ['1', 'بيعة الرضوان'];
const List t2 = ['2', 'يَدُ اللَّهِ فَوق أَيدِيهِم'];
const List t3 = ['3', 'الصفوة الأخيار'];
const List t4 = ['4', 'كلمة التقوى'];
const List t5 = ['5', 'خير أهل الأرض'];
const List t6 = ['6', 'ارتفاع عدد المهاجرين'];

const String p1 =
    'لما بلغ النبي ﷺ أن عثمان رضي الله عنه قتل فدعا رسول الله أصحابه إلى مبايعته على قتال المشركين، ومناجزتهم فاستجاب الصحابة وبايعوه على الموت سوى الجد بن قيس، وذلك لنفاقه وفي رواية أن البيعة كانت على الصبر.';
const String p2 =
    'وكان أول من بايعه على ذلك أبو سنان عبدالله بن وهب الأسدي فخرج الناس بعده يبايعون على بيعته، وبايعه سلمة بن الأكوع ثلاث مرات، في أول الناس، وأوسطهم، وآخرهم، وقال النبي ﷺ بيده اليمنى : هذه يد عثمان فضرب بها على يده وكان عدد الصحابة الذين أخذ منهم الرسول ﷺ المبايعة تحت الشجرة ألف وأربعمائة صحابي وقد تحدث القرآن الكريم عن أهل بيعة الرضوان.';
const String p3 =
    'قال تعالى: إِنَّ الَّذِينَ يُبَايِعُونَكَ إِنَّمَا يُبَايِعُونَ اللَّهَ يَدُ اللَّهِ فَوْقَ أَيْدِيهِمْ فَمَنْ نَكَثَ فَإِنَّمَا يَنْكُثُ عَلَى نَفْسِهِ وَمَنْ أَوْفَى بِمَا عَاهَدَ عَلَيْهُ اللَّهَ فَسَيُؤْتِيهِ أَجْرًا عَظِيمًا - سورة الفتح';
const String p4 =
    'قال ابن القيم: وتأمل قوله: إِنَّ الَّذِينَ يُبَايِعُونَكَ إِنَّمَا يُبَايِعُونَ اللَّهَ يَدُ اللَّهِ فَوْقَ أَيْدِيهِمْ فلما كانوا يبايعون رسول الله ﷺ بأيديهم ويضرب بيده على أيديهم وكان رسول الله ﷺ هو السفير بينه وبينهم كانت مبايعتهم له مبايعة لله تعالى، ولما كان سبحانه فوق سماواته على عرشه وفوق الخلائق كلهم كانت يده فوق أيديهم كما أنه سبحانه فوقهم.';
const String p5 =
    'وقوله تعالى: وَمَنْ أَوْفَى بِمَا عَاهَدَ عَلَيْهُ اللَّهَ فَسَيُؤْتِيهِ أَجْرًا عَظِيمًا أي: ثواباً جزيلاً وهو الجنة وما يكون فيها مما لاعين رأت ولا أذن سمعت ولاخطر على قلب بشر.';
const String p6 =
    'وقال تعالى مخبراً برضاه عنهم: لَقَدْ رَضِيَ اللَّهُ عَنِ الْمُؤْمِنِينَ إِذْ يُبَايِعُونَكَ تَحْتَ الشَّجَرَةِ فَعَلِمَ مَا فِي قُلُوبِهِمْ فَأَنْزَلَ السَّكِينَةَ عَلَيْهِمْ وَأَثَابَهُمْ فَتْحًا قَرِيبًا وَمَغَانِمَ كَثِيرَةً يَأْخُذُونَهَا وَكَانَ اللَّهُ عَزِيزًا حَكِيمًا - سورة الفتح';
const String p7 =
    'فقد أخبر تعالى أنه رضي الله عن أولئك الصفوة الأخيار من أهل بيعة الرضوان ومن رضي الله عنه لايسخط عليه أبداً فلله ما أعظم هذا التكريم الذي ناله أهل بيعة الرضوان، وما أعلاه من منقبة ومعنى الآية لَقَدْ رَضِيَ اللَّهُ عَنِ الْمُؤْمِنِينَ ، لقد رضي الله يامحمد عن المؤمنين إِذْ يُبَايِعُونَكَ تَحْتَ الشَّجَرَةِ يعني: بيعة أصحاب رسول الله ﷺ بالحديبية حين بايعوه على مناجزة قريش الحرب وعلى أن لايفروا، ولايولوهم الأدبار، تحت الشجرة وكانت بيعتهم إياه هنالك تحت شجرة السمرة فَعَلِمَ مَا فِي قُلُوبِهِمْ أي: فعلم ربك يامحمد مافي قلوب المؤمنين من أصحابك إذ يبايعونك تحت الشجرة من صدق النية والوفاء بما يبايعونك عليه والصبر فَأَنْزَلَ السَّكِينَةَ عَلَيْهِمْ أي: فأنزل الطمأنينة والثبات على ماهم عليه من دينهم وحسن بصيرتهم بالحق الذي هداهم الله له وَأَثَابَهُمْ فَتْحًا قَرِيبًا وهو فتح خيبر، وأما قوله تعالى وَمَغَانِمَ كَثِيرَةً يَأْخُذُونَهَا أي: وأثاب الله هؤلاء الذين بايعوا رسول الله ﷺ تحت الشجرة مع ما أكرمهم به من رضاه عنهم، وإنزاله السكينة عليهم وإثابته إياهم فتحاً قريباً وهو ما أجرى الله عزوجل على أيديهم من الصلح بينهم وبين أعدائهم وماحصل بذلك من الخير العام المستمر المتصل بفتح خيبر وفتح مكة، ثم فتح سائر البلاد والأقاليم عليهم وماحصل لهم من العز والنصر والرفعة في الدنيا والآخرة ولهذا قال الله تعالى: وَمَغَانِمَ كَثِيرَةً يَأْخُذُونَهَا وَكَانَ اللَّهُ عَزِيزًا حَكِيمًا.';
const String p8 =
    'كما أخبر الله تعالى عن أهل بيعة الرضوان أنه ألزمهم كلمة التقوى التي هي كلمة التوحيد وأنهم كانوا أحق بها وأهلها. قال تعالى: إِذْ جَعَلَ الَّذِينَ كَفَرُوا فِي قُلُوبِهِمُ الْحَمِيَّةَ حَمِيَّةَ الْجَاهِلِيَّةِ فَأَنْزَلَ اللَّهُ سَكِينَتَهُ عَلَى رَسُولِهِ وَعَلَى الْمُؤْمِنِينَ وَأَلْزَمَهُمْ كَلِمَةَ التَّقْوَى وَكَانُوا أَحَقَّ بِهَا وَأَهْلَهَا وَكَانَ اللَّهُ بِكُلِّ شَيْءٍ عَلِيمًا - سورة الفتح ، فلقد بين الله تعالى في هذه الآية أنه ألزم الصحابة رضي الله عنهم كلمة التقوى وأكثر المفسرين أن المراد بكلمة التقوى هي لا إله إلا الله وبين أنهم أحق بها من كفار قريش وأنهم كانوا أهلها في علم الله لأن الله تعالى اختار لدينه وصحبة نبيه أهل الخير ذلك هو الثناء في القرآن على الصحابة الذين بايعوا النبي ﷺ بيعة الرضوان بالحديبية.';
const String p9 =
    'من حديث جابر بن عبدالله رضي الله عنهما قال: قال لنا رسول الله ﷺ يوم الحديبية: أنتم خير أهل الأرض وكنا ألفاً وأربعمائة ولو كنت أبصر لأريتكم موضع الشجرة.';
const String p10 =
    'وقال جابر بن عبدالله رضي الله عنهما أخبرتني أم مبشر: أنها سمعت النبي ﷺ يقول عند حفصة : لايدخل النار إن شاء الله من أصحاب الشجرة أحد الذين بايعوا تحتها قالت: بلى يارسول الله: فانتهرها فقالت حفصة: وإن منكم إلا واردها فقال النبي ﷺ : قد قال الله -عز وجل- : وَإِنْ مِنْكُمْ إِلا وَارِدُهَا كَانَ عَلَى رَبِّكَ حَتْمًا مَقْضِيًّا ثُمَّ نُنَجِّي الَّذِينَ اتَّقَوْا وَنَذَرُ الظَّالِمِينَ فِيهَا جِثِيًّا - سورة مريم';
const String p11 =
    'قال النووي رحمه الله تعالى: قوله ﷺ : لايدخل النار إن شاء الله من أصحاب الشجرة أحد الذين بايعوا تحتها، قال العلماء: معناه لايدخلها أحد منهم قطعاً وإنما قال إن شاء الله للتبرك لاللشك وأما قول حفصة بلى وانتهار النبي ﷺ لها فقالت: وَإِنْ مِنْكُمْ إِلا وَارِدُهَا فقال النبي ﷺ : وقد قال: ثُمَّ نُنَجِّي الَّذِينَ اتَّقَوْا فيه دليل للمناظرة والجواب على وجه الاسترشاد وهو مقصود حفصة لا أنها أرادت رد مقالته ﷺ والصحيح أن المراد بالورود في الآية المرور على الصراط وهو جسر منصوب على جهنم فيقع فيها أهلها وينجو الآخرون.';
const String p12 =
    'وحين نمعن النظر في هذا الجيل الفريد مقارنة مع أهل بدر نلاحظ ارتفاع عدد المهاجرين إلى النصف من الجيش، وهذا الارتفاع الهائل في عدد المهاجرين من ثلاث وثمانين في بدر إلى ثمانمائة كان معظمه من القبائل العربية المجاورة وهي قبائل صغيرة، إذا قيست بالقبائل الكبرى، لكن شبابها كانوا يغدون إلى المدينة، ينضوون تحت لواء رسول الله ﷺ ، ويتلقون التربية اليومية في المسجد، والتربية العملية في المعارك والغزوات، فيتدربون على الجندية الخالصة ويفقهون دينهم مباشرة من رسول رب العالمين، وينشؤون في ظلال القدوة العليا لهم من السابقين الأولين من المهاجرين والأنصار، ويتنافسون في الطاعة والامتثال لأمر الله ورسوله، فنالت قبائلهم بذلك شرفاً ربا على القبائل الكبرى التي تخاذلت في الانضمام للإسلام، فقبيلة أسلم وغفار كانت على رأس هذه القبائل.';
const String p13 =
    'ويعود الفضل بعد الله سبحانة وتعالى في ذلك إلى الرعيل الأول منهم، واللبنات الأولى التي انضمت إلى الدعوة إلى أبي ذر الغفاري الذي كان من السابقين في إسلامه بمكة، ومضى داعيا في قومه حتى جاءه سبعين بيتاً من غفار يؤم بهم المدينة بعد أحد وإلى بريدة بن الحصيب الأسلمي، الذي تلقى رسول الله ﷺ قبل دخوله المدينة، فأسلم ومعه سبعون من قومه كذلك.';
const String p14 =
    'ما القبائل الأخرى من مزينة وجهينة، وأشجع، وخزاعة، فقد بدأ شبابها يفدون إلى المدينة، لكن بأعداد ضئيلة وبقي كيان القبيلة على الشرك، وبقي أعرابياً بعيداً عن محضن التربية العظيم داخل المدينة، فلم يتح له هذا الفضل، والاغتراف من رحيق النبوة، ولهذا كانت الآيات التي نزلت في المخلفين من الأعراب كالصواعق على رؤوسهم، لتخلفهم عن الانضمام إلى الجيش الإسلامي الماضي إلى الحديبية.';
