const int sectionIndex = 72;
const String sectionTitle = 'غزوة تبوك - المسجد الضرار';

const List t1 = ['1', 'عداوه أبو عامر الراهب'];
const List t2 = ['2', 'اتصاله بقريش'];
const List t3 = ['3', 'ذهابه إلى هرقل'];
const List t4 = ['4', 'وَلَيَحلِفن إِن أَرَدنا إِلا الحُسنى'];
const List t5 = ['5', 'رجوع رسول الله من تبوك'];
const List t6 = ['6', 'لا تَقُم فِيهِ أَبَدًا'];
const List t7 = ['7', 'الكفر ملة واحدة'];
const List t8 = ['8', 'التدليس على المسلمين'];
const List t9 = ['9', 'فالله خير حافظاً'];
const List t10 = ['10', 'العلاج النبوي الحاسم'];
const List t11 = ['11', 'ما يلحق بمسجد الضرار في الحكم'];

const String p1 =
    'في أثناء عودة النبي ﷺ إلى المدينة راجعاً من تبوك، نزلت عليه الآيات الآتية: وَالَّذِينَ اتَّخَذُوا مَسْجِدًا ضِرَارًا وَكُفْرًا وَتَفْرِيقًا بَيْنَ الْمُؤْمِنِينَ وَإِرْصَادًا لِمَنْ حَارَبَ اللَّهَ وَرَسُولَهُ مِنْ قَبْلُ وَلَيَحْلِفُنَّ إِنْ أَرَدْنَا إِلا الْحُسْنَى وَاللَّهُ يَشْهَدُ إِنَّهُمْ لَكَاذِبُونَ لا تَقُمْ فِيهِ أَبَدًا لَمَسْجِدٌ أُسِّسَ عَلَى التَّقْوَى مِنْ أَوَّلِ يَوْمٍ أَحَقُّ أَنْ تَقُومَ فِيهِ فِيهِ رِجَالٌ يُحِبُّونَ أَنْ يَتَطَهَّرُوا وَاللَّهُ يُحِبُّ الْمُطَّهِّرِينَ - سورة التوبة';
const String p2 =
    'فى ماذكره ابن كثير: أنه كان بالمدينة قبل مقدم رسول الله ﷺ إليها رجل من الخزرج يقال له أبو عامر الراهب وكان قد تنصر في الجاهلية وقرأ علم أهل الكتاب، وكان فيه عبادة في الجاهلية وله شرف في الخزرج كبير، فلما قدم رسول الله ﷺ مهاجراً إلى المدينة واجتمع المسلمون عليه وصارت للإسلام كلمة عالية وأظهرهم الله يوم بدر، شرق اللعين أبو عامر بريقه وبارز بالعداوة وظاهر بها.';
const String p3 =
    'وخرج فاراً إلى كفار مكة من مشركي قريش يمالئهم على حرب رسول الله ﷺ ، فاجتمعوا بمن وافقهم في أحياء العرب، فكان من أمر المسلمين ما كان وامتحنهم الله عزوجل وكانت العاقبة للمتقين، وكان هذا الفاسق قد حفر حفائر فيما بين الصفين فوقع في إحداهن رسول الله ﷺ وأصيب ذلك اليوم فجرح وكسرت رباعيته اليمنى والسفلى وشج رأسه صلوات الله وسلامه عليه، وتقدم أبو عامر في أول المبارزة إلى قومه من الأنصار فخاطبهم واستمالهم إلى نصره وموافقته، فلما عرفوا كلامه قالوا لا أنعم الله بك عينا يافاسق ياعدو الله ونالوا منه وسبُّوه، فرجع وهو يقول: والله لقد أصاب قومي بعدي شر، وكان رسول الله ﷺ قد دعاه إلى الله قبل فراره وقرأ عليه القرآن فأبى أن يسلم وتمرد، فدعا عليه رسول الله ﷺ أن يموت بعيداً طريداً فنالته هذه الدعوة.';
const String p4 =
    'ولما رأى أمر الرسول ﷺ في ارتفاع وظهور، ذهب إلى هرقل ملك الروم يستنصره على النبي ﷺ ، فوعده ومناه وأقام عنده، وكتب إلى جماعة من قومه الأنصار من أهل النفاق والريب يعدهم ويمنيهم بجيش يقاتل به رسول الله ﷺ ويغلبه ويرده عما هو فيه، وأمرهم أن يتخذوا له معقلاً يقدم عليهم فيه من يقدم من عنده لآداء كتبه ويكون مرصداً له إذا قدم عليهم بعد ذلك.';
const String p5 =
    'فشرعوا في بناء مسجد مجاور لمسجد قباء فبنوه وأحكموه وفرغوا منه قبل خروج رسول الله ﷺ إلى تبوك، وجاءوا فسألوا رسول الله ﷺ أن يأتي إليهم فيصلي في مسجدهم ليحتجوا بصلاته فيه على تقريره وإثباته، وذكروا أنهم بنوه للضعفاء منهم وأهل العلة في الليلة الشاتية، فعصمه الله من الصلاة فيه فقال: إنّا على سفر ولكن إذا رجعنا إن شاء الله.';
const String p6 =
    'فلما رجع عليه السلام إلى المدينة من تبوك ولم يبق بينه وبينها إلا يوم أو بعض يوم، نزل عليه جبريل بخبر مسجد ضرار وما اعتمده بانوه من الكفر والتفريق بين جماعة المؤمنين في مسجدهم مسجد قباء الذي أسس من أول يوم على التقوى، فبعث رسول الله ﷺ إلى ذلك المسجد من هدمه قبل مقدمه المدينة.';
const String p7 =
    'قال ابن عاشور: وقوله سبحانه: لا تَقُمْ فِيهِ أَبَدًا ، المراد بالقيام الصلاة لأن أولها قيام، ووجه النهي عن الصلاة فيه أن صلاة النبي ﷺ فيه تكسب يمناً وبركة، فلا يرى المسلمون لمسجد قباء مزية عليه، ولذلك أمر رسول الله ﷺ عمار بن ياسر ومالك بن الدخشم مع بعض أصحابه، وقال لهم: انطلقوا إلى هذا المسجد الظالم أهله فاهدموه وحرقوه ففعلوا، وقوله: لَمَسْجِدٌ أُسِّسَ عَلَى التَّقْوَى مِنْ أَوَّلِ يَوْمٍ أَحَقُّ أَنْ تَقُومَ فِيهِ ، احتراس مما يستلزمه النهي عن الصلاة فيه من إضاعة عبادة في الوقت الذي رغبوه للصلاة فيه، فأمر الله بأن يصلي في ذلك الوقت الذي دعوه فيه للصلاة في مسجد الضرار أن يصلي في مسجده أو في مسجد قباء لئلا يكون لامتناعه من الصلاة من حظوظ الشيطان أن يكون صرفه عن صلاة في وقت دعي للصلاة فيه وهذا أدب نفساني عظيم.';
const String p8 =
    'وفيه أيضاً دفع مكيدة المنافقين أن يطعنوا في الرسول ﷺ ، بأنه دعي إلى الصلاة في مسجدهم فامتنع فقوله: أَحَقُّ وإن كان اسم تفضيل فهو مسلوب المفاضلة لأن النهي عن صلاته في مسجد الضرار أزال كونه حقيقاً بصلاته فيه أصلاً، ولعل نكته الإتيان باسم التفضيل أنه تهكم على المنافقين لمجازاتهم ظاهراً في دعوتهم النبي ﷺ للصلاة فيه بأنه وإن كان حقيقاً بصلاته بمسجد أسس على التقوى أحق منه، فيعرف من وصفه بأنه أُسِّسَ عَلَى التَّقْوَى أن هذا أسس على ضدها.';
const String p9 =
    'قد تبين هذا في موقف أبي عامر الراهب من الإسلام ومن المسلمين إذ غضب غضباً شديداً وتألم لهزيمة المشركين في بدر، فأعلن عداءه للرسول وتوجه إلى عاصمة الشرك مكة يحث أهلها على قتال المسلمين وخرج مقاتلاً معهم في أحد وحاول تفتيت الصف الإسلامي، وصدق الله تعالى عندما قال: وَالَّذِينَ كَفَرُوا بَعْضُهُمْ أَوْلِيَاءُ بَعْضٍ إِلا تَفْعَلُوهُ تَكُنْ فِتْنَةٌ فِي الأَرْضِ وَفَسَادٌ كَبِيرٌ - سورة الأنفال';
const String p10 =
    'حاول المنافقون أن يضيفوا الشرعية على هذا البناء وأنه مسجد بنوه لأسباب مقنعة في الظاهر، ولكن لا حقيقة لها في نفوس أصحابها فقد جاءوا يطلبون من الرسول ﷺ الصلاة في هذا البناء ليكون مسجداً قد باركه رسول الله ﷺ بالصلاة فيه، فإذا حدث هذا فقد استقر قرارهم في تحقيق أهدافهم وهذا أسلوب ماكر خبيث قد ينطلي على كثير من الناس.';
const String p11 =
    'إن الباحث ليلاحظ مدى العناية الإلهية بالنبي ﷺ ، فقد أطلعه الله عزوجل على أسرار هؤلاء المنافقين وما أرادوه من تأسيس هذا المسجد، فلولا إعلام الله لرسوله لما أدرك رسول الله حقيقة نواياهم ولصلى في البناء، فأضفى عليه الشرعية وأقبل الناس يصلون فيه لأن رسول الله ﷺ صلى فيه وبذلك يحدث الاختلاط بين المنافقين وضعاف المسلمين فينفردون بهم وقد يؤثرون عليهم بالإشاعات.';
const String p12 =
    'أن ماقام به الرسول ﷺ من الأمر بهدم مسجد الضرار هو التصرف الأمثل، وهذا منهج نبوي كريم سنّة لقادة الأمة في القضاء على أي عمل يراد منه الإضرار بالمسلمين وتفريق كلمتهم، فالداء العضال لايعالج بتسكينه والتخفيف منه، وإنما يعالج بجسمه وإزالة آثاره حتى لايتجدد ظهوره بصورة أخرى، وإن الثمار العملية التي لمسها المسلمون على إثر تطبيق الأمر النبوي الحازم لتدلُّنا على أن هذه المنهجية التي نهجها رسول الله ﷺ مع هذا المكر الخبيث هي الطريقة المثلى لقمع حركة النفاق في المجتمع المسلم، فقد أصبح أمرهم بعد ذلك يتلاشى شيئاً فشيئاً حتى لم يبق منهم بعد لحاق الرسول ﷺ بالرفيق الأعلى إلا عدد قليل، ولم يعرف عنهم بعد تدمير مسجد ضرار أن قاموا بأعمال تخدم الهدف نفسه لعلمهم بنتائج العمل بعد انكشافهم.';
const String p13 =
    'قال الزمخشري: وقيل كل مسجد بني مباهاة أو رياء وسمعة أو لغرض سوى ابتغاء وجه الله أو بمال غير طيب فهو لاحق بمسجد الضرار.';
const String p14 =
    'وعلق الدكتور عبدالكريم زيدان على قول الزمخشري فقال: ولكن هل يلحق بمسجد الضرار فيهدم كما هدم مسجد الضرار الذي بناه المنافقون في المدينة وأمر النبي ﷺ بهدمه؟ لا أرى ذلك وإنما يمكن أن يقال إن المسجد الذي لهذه الأغراض يلحق بمسجد الضرار من جهة عدم ابتنائه على التقوى والإخلاص الكامل لله تعالى.';
const String p15 =
    'وقال القرطبي في تفسيره: قال علماؤنا: وكل مسجد بُني على ضرار أو رياء وسمعة فهو في حكم مسجد الضرار لاتجوز الصلاة فيه.';
const String p16 =
    'وهذا المسجد الضرار الذي اتخذ على عهد رسول الله ﷺ مكيدة للإسلام والمسلمين، وهذا المسجد مايزال يتخذ في صور شتى يتخذ في صورة نشاط ظاهره الإسلام وباطنه لسحق الإسلام أو تشويهه، وتتخذ في صورة أوضاع ترفع لافتة الدين عليها لتَتَترَّس وراءها وهي ترمي هذا الدين وتتخذ في صورة تشكيلات وتنظيمات وكتب وبحوث تتحدث عن الإسلام لتخدر القلقين الذين يرون الإسلام يذبح ويمحق، فتخدرهم هذه التشكيلات وتلك الكتب بما توحيه لهم من أن الإسلام بخير وأن لاداعي للخوف أو القلق عليه.';
const String p17 =
    'إن مسجد الضرار ليس حادثة في المجتمع الإسلامي الأول وانقضت، بل هي فكرة باقية يخطط لها باختيار الأهداف العميقة وتختار الوسائل الدقيقة لتنفيذها وخططها تصب في التآمر على الإسلام وأهله بالتشويه وقلب الحقائق والتشكيك وزرع بذور الفتن لإبعاد الناس عن دينهم وإشغالهم بما يضرهم ويدمر مصيرهم الأخروي.';
