const int sectionIndex = 79;
const String sectionTitle = 'مرضه ووصاياه ﷺ';

const List t1 = ['1', 'بدء مرضه ﷺ'];
const List t2 = ['2', 'رَفيقُه أبى بكر الصديق يبكى'];
const List t3 = ['3', 'فاختارَ ماعند الله'];
const List t4 = ['4', 'النبي في البقيع'];
const List t5 = ['5', 'موعدكم معى عند الحوض'];
const List t6 = ['6', 'استئذانه ﷺ أن يمرض في بيت عائشة'];
const List t7 = ['7', 'كما تحط الشجرة ورقها'];
const List t8 = ['8', 'وصيته ﷺ بالأنصار'];
const List t9 = ['9', 'ووصاياه ﷺ قبل موته'];
const List t10 = ['10', 'لم يبق من مبشرات النبوة إلا الرؤيا'];

const String p1 =
    'رجع رسول الله ﷺ من حجة الوداع في ذي الحجة فأقام بالمدينة بقيته والمحرم وصفراً من العام العاشر، فبدأ بتجهيز جيش أسامة وأمرّ عليهم أسامة بن زيد بن حارثة وأمره أن يتوجه نحو البلقاء وفلسطين، فتجهز الناس وفيهم المهاجرون والأنصار، وكان منهم أبو بكر وعمر وكان أسامة بن زيد ابن ثماني عشرة سنة وتكلم البعض في تأميره وهو مولى وصغير السن على كبار المهاجرين والأنصار، فلم يقبل الرسول ﷺ طعنهم في إمارة أسامة، فقال ﷺ : إن يطعنوا في إمارته فقد طعنوا في إمارة أبيه وأيم الله إن كان لخليقاً للإمارة وإن كان من أحبِّ الناس إليَّ وإن ابنه هذا لمن أحب الناس إلي بعده، وبينما الناس يستعدون للجهاد في جيش أسامة ابتدئ رسول الله ﷺ شكواه الذي قبضه الله فيه.';
const String p2 =
    'كان أبو بكر رضيَ اللهُ عنه أقرب الناسِ إلى النبي صلى اللهُ عليه وسلم فهو رَفيقه في هجرته، وهو أعظم هذه الأمةِ إيمانا وتصديقا، ولو وُزِن إيمانُه بإيمان الناسِ كلهم، لرجح إيمانُه بإيمانِهم.';
const String p3 =
    'ويُخبرنا أبو سعيد الخدري رضي اللهُ عنه أن رسول اللهِ صلى اللهُ عليه وسلم جلس على المنبر في مرضه الأخير الذي مات فيه وقال:';
const String p4 =
    'إن عبدًا خيَّره اللهُ بين أن يؤتيه من زهرةِ الدنيا ما شاء وبين ما عنده فاختار ما عنده، فبكى أبو بكرٍ وقال: فديناك بآبائِنا وأمهاتنا، فكان رسولُ اللهِ صلَّى اللهُ عليه وسلَّم هو المُخيرَ، وكان أبو بكرٍ أعلمَنا به فقال رسولُ اللهِ صلَّى اللهُ عليه وسلَّم: إن أمَنَّ الناسِ عليَّ في مالِه وصُحبتِه أبو بكرٍ ولو كنت متخِذًا خليلًا لاتخذتُ أبا بكرٍ خليلًا ولكِن أخوة الإسلامِ لا يبقين في المسجدِ خوخةٌ إلَّا خوخةُ أبي بكرٍ.';
const String p5 =
    'وفى هذا الحديث أن يُعطيه الله  مقدار ما أرادَ مِن طول العُمرِ والبقاء في الدنيا، والتمتع  بنعِيمها وزِينتها، وبين ما عِندَه، فاختارَ ما عندَه، أي: اختارَ وفضَّل ما عند اللهِ سُبحانَه، ممَّا أعدَّ له مِن أنواع النعيم المقيم ولذة اللقاءِ والنظر إلى وجهِه الكريمِ، فلما سمِع أبو بَكر رضيَ اللهُ عنه ذلك القول مِن النبي صلى اللهُ عليه وسلم بكى، وقال: فديناك بآبائِنا وأمهاتِنا، فتعجب الحاضِرون من قولِ أبي بكر رضي اللهُ عنه وبكائِه، إذ لم يفهموا مِن كلامِ النبي صلى اللهُ عليه وسلم ما يستدعي ذلك البُكاء والقول مِن أبي بكر رضي اللهُ عنه، ولكن الصديق رضي اللهُ عنه قد فهم مِن هذا الكَلامِ مُفارقته صلى اللهُ عليه وسلم الدنيا، وأن العبد المُخير هو رسول اللهِ صلى اللهُ عليه وسلم، فبَكى لذلك، وقال ما قال.';
const String p6 =
    'فلما مات النبي صلى اللهُ عليه وسلم، فهم الناس مَقصِده صلى اللهُ عليه وسلم مِن كلامِه، ولذلك قال أبو سَعيدٍ الخدري رضي اللهُ عنه: فكان رسول اللهِ صلى اللهُ عليه وسلمَ هو المُخيرَ، أي: هو الذي خيره اللهُ بين نعيم الدنيا وبين لِقائِه، وكان أبو بكر رَضيَ اللهُ عنه أعلم الناسِ بالنبي صلى اللهُ عليه وسلم.';
const String p7 =
    'عن أبي مويهبة مولى رسول الله ﷺ قال: بعثني رسول الله ﷺ من جوف الليل فقال: يا أبا مويهبة إني قد أمرت أن أستغفر لأهل البقيع، فانطلق معي فانطلقت معه فلما وقف بين قال: السلام عليكم يا أهل المقابر ليهنئ لكم ما أصبحتم فيه مما أصبح الناس فيه، أقبلت الفتن كقطع الليل المظلم يتبع آخرها أولها الآخرة شرُّ من الأولى، ثم أقبل علي فقال: يا أبا مويهبة إني قد أوتيت مفاتيح خزائن الدنيا والخلد فيها ثم الجنة فخيرت بين ذلك وبين لقاء ربي والجنة، قال: فقلت: بأبي أنت وأمي خذ مفاتيح خزائن الدنيا والخلد فيها ثم الجنة قال: لاوالله يا أبا مويهبة لقد اخترت لقاء ربي والجنة، ثم استغفر لأهل البقيع ثم انصرف.';
const String p8 =
    'وصلى رسول الله ﷺ على قتلى أُحد بعد ثماني سنين كالمودع للأحياء والأموات ثم طلع المنبر فقال: إني بين أيديكم فرط وأنا عليكم شهيد وإن موعدكم الحوض، وإني لأنظر إليه وأنا في مقامي هذا وإني لست أخشى عليكم أن تشركوا ولكن أخشى عليكم الدنيا أن تنافسوها، فقال عقبة: فكانت آخر نظرة نظرتها إلى رسول الله ﷺ .';
const String p9 =
    'قالت عائشة رضي الله عنها: لما ثقل رسول الله ﷺ واشتد وجعه، استأذن أزواجه في أن يمرَّض في بيتي، فأذنَّ له فخرج وهو بين رجلين تخطُّ رجلاه في الأرض بين عباس ورجل آخر -قال ابن عباس هو علي بن أبي طالب- ولما دخل بيتي اشتد وجعه، فقال: أهريقوا عليّ من سبع قرب لم تُحلل أوكيتهن لعلي أعهد إلى الناس، فأجلسناه في مخضَب لحفصة، ثم طفقنا نصب عليه من تلك القرب حتى طفق يشير إلينا بيده أن قد فعلتن ثم خرج إلى الناس، فصلى بهم وخطبهم وقالت عائشة رضي الله عنها مارأيت رجلاً أشد عليه الوجع من رسول الله ﷺ .';
const String p10 =
    'وقال عبدالله بن مسعود رضي الله عنه: دخلت على رسول الله ﷺ وهو يوعك فمسسته بيدي، فقلت: يارسول الله! إنك لتوعك وعكاً شديداً فقال رسول الله ﷺ أجل: إني أوعك كما يوعك رجلان منكم قال: فقلت: ذلك أن لك أجرين: فقال رسول الله ﷺ : أجل ثم قال رسول الله ﷺ : مامن مسلم يصيبه أذى من مرض فما سواه إلا حط الله به سيئاته كما تحط الشجرة ورقها.';
const String p11 =
    'مرّ العباس رضي الله عنه بقوم من الأنصار يبكون حين اشتد برسول الله ﷺ وجعه، فقال لهم: مايبكيكم؟ قالوا: ذكرنا مجلسنا من رسول الله ﷺ ، فدخل العباس عليه ﷺ فأخبره، فعُصِّب بعصابة دسماء أو قال: بحاشية برد وخرج وصعد المنبر ولم يصعد بعد ذلك اليوم فحمد الله وأثنى عليه ثم قال: أوصيكم بالأنصار فإنهم كرشي وعيبي وقد قضوا الذي عليهم وبقي الذي لهم، فأقبلوا من محسنهم وتجاوزوا عن مسيئهم وفي الحديث شدة محبة الأنصار لرسول الله ﷺ وبكاؤهم لمرضه وحرمانهم من مجلسه.';
const String p12 =
    'لقد ازدادت شدة المرض على رسول الله بحيث كان يغمى عليه في اليوم الواحد مرات عديدة، ومع ذلك كله أحبّ ﷺ أن يفارق الدنيا وهو مطمئن على أمته أن تضل من بعده، فأراد أن يكتب لهم كتاباً مفصلاً ليجتمعوا عليه ولايتنازعوا فلما اختلفوا عنده ﷺ عدل عن كتابة ذلك الكتاب وأوصاهم بأمور ثلاثة ذكر الراوي منها اثنين: أخرجوا المشركين من جزيرة العرب ، وأجيزوا الوفد بنحو ماكنت أجيزهم به.';
const String p13 =
    'النهي عن اتخاذ القبر مسجداً: كان من آخر ماتكلم به رسول الله ﷺ قوله: قاتل الله اليهود والنصارى اتخذوا قبور أنبيائهم مساجد، لا يبقين دينان بأرض العرب.';
const String p14 =
    'إحسان الظن بالله: قال جابر رضي الله عنه: سمعت رسول الله ﷺ يقول قبل موته بثلاث: أحسنوا الظن بالله عزوجل.';
const String p15 =
    'الوصية بالصلاة وما ملكت أيمانكم: قال أنس رضي الله عنه: كانت وصية رسول الله ﷺ حين حضره الموت: الصلاة وماملكت إيمانكم حتى جعل يغرغر بها في صدره ولايفيض بها لسانه.';
const String p16 =
    'قال عبدالله بن عباس رضي الله عنهما: كشف رسول الله ﷺ السِّتر ورسول الله ﷺ معصوب في مرضه الذي مات فيه، فقال: اللهم بلغت ثلاث مرات أنه لم يبق من مبشِّرات النبوة إلا الرؤيا يراها العبد الصالح أو ترى له، ألا وإني قد نهيت عن القراءة في الركوع والسجود، فإذا ركعتم فعظموا الله وإذا سجدتم فاجتهدوا في الدعاء، فإنه قَمِنٌ أن يستجاب لكم.';
