const int sectionIndex = 56;
const String sectionTitle = 'صلح الحديبية - المعاهدة';

const List t1 = ['1', 'لقد أراد القوم الصلح'];
const List t2 = ['2', 'الأعتراض على بسم الله ، رسول الله'];
const List t3 = ['3', 'موافقة رسول الله ﷺ على ذلك'];
const List t4 = ['4', 'بنود المعاهدة'];
const List t5 = ['5', 'مركز قوة لا ضعف'];
const List t6 = ['6', 'تأملات فى نصوص المعاهدة'];
const List t7 = ['7', 'فتحاً'];
const List t8 = ['8', 'الطرف المحايد'];
const List t9 = ['9', 'واجبة النفاذ'];
const List t10 = ['10', 'موقف أبي جندل والوفاء بالعهد'];
const List t11 = ['11', 'معارضة عمر بن الخطاب والمسلمين للاتفاقية'];
const List t12 = ['12', 'زيادة المعارضة بعد موقف أبي جندل'];
const List t13 = ['13', 'المشورة العظيمة لأم سلمة رضي الله عنها'];
const List t14 = ['14', 'حكم الإحصار في العمرة والحج'];

const String p1 =
    'لما بلغ قريشاً أمر بيعة الرضوان وأدرك زعماؤها تصميم الرسول ﷺ على القتال، أوفدوا سهيل بن عمرو في نفر من رجالهم لمفاوضة النبي ﷺ ، ولما رأى رسول الله ﷺ سهيلاً قال: لقد أراد القوم الصلح حين بعثوا هذا الرجل.';
const String p2 =
    'كان سهيل بن عمرو أحد زعماء قريش البارزين الذين كانوا يعرفون بالحنكة السياسية والدهاء، فهو خطيب ماهر ذو عقل راجح ورزانة وأصالة في الرأي.';
const String p3 =
    'عندما شرع النبي ﷺ في إملاء صيغة المعاهدة المتفق عليها، أمر الكاتب وهو الإمام علي بن أبي طالب، بأن يبدأ المعاهدة بكلمة: بسم الله الرحمن الرحيم، وهنا اعترض رئيس الوفد القرشي سهيل بن عمرو قائلاً: لا أعرف الرحمن، اكتب باسمك اللهم، فضج الصحابة على هذا الاعتراض قائلين: هو الرحمن ولانكتب إلاَّ الرحمن ولكن النبي ﷺ تمشياً مع سياسة الحكمة والمرونة والحلم قال للكاتب: أكتب باسمك اللهم، واستمر في إملاء صيغة المعاهدة هذه، فأمر الكاتب أن يكتب هذا ما أصطلح عليه رسول الله، وقبل أن يكمل الجملة اعترض رئيس الوفد القرشي على كلمة رسول الله قائلاً: لو أعلم أنك رسول الله ما خالفتك، واتبعتك، أفترغب عن اسمك واسم أبيك محمد بن عبدالله؟ اكتب اسمك واسم ابيك، واعترض المسلمون على ذلك ولكن رسول الله بحكمته وتسامحه وبعد نظره، حسم الخلاف وأمر الكاتب بأن يشطب كلمة رسول الله من الوثيقة فالتزم الصحابة الصمت والهدوء.';
const String p4 =
    'إن النبي ﷺ وافق المشركين على ترك كتابة بسم الله الرحمن الرحيم وكتابة باسمك اللهم بدلاً عنها، وكذا وافقهم في كتابة محمد بن عبدالله وترك كتابة رسول الله ﷺ ، وكذا وافقهم في ردّ من جاء منهم إلى المسلمين دون من ذهب منهم إليهم، وإنما وافقهم في هذه الأمور للمصلحة المهمة الحاصلة بالصلح مع أنه لامفسدة في هذه الأمور، أما البسملة وباسمك اللهم فمعناها واحد، وكذا قوله محمد بن عبدالله هو أيضاً رسول الله ﷺ ، وليس في ترك وصف الله سبحانه وتعالى في هذا الموضع بالرحمن الرحيم ماينفي ذلك، ولافي ترك وصف النبي ﷺ بالرسالة ماينفيها، فلا ضرر ولامفسدة فيما طلبوه، وإنما كانت المفسدة تكون لو طلبوا أن يكتب مالا يحل من تعظيم آلهتهم ونحو ذلك.';
const String p5 =
    'وأما شرط ردّ من جاء منهم وعدم رد من ذهب إليهم، فقد بين النبي ﷺ تعليل ذلك والحكمة فيه في هذا الحديث بقوله: من ذهب منا إليهم فأبعده الله ومن جاءنا منهم سيجعل الله له فرجاً ومخرجاً ثم كان كما قال ﷺ .';
const String p6 =
    'باسمك اللهم - هذا ماصالح عليه محمد بن عبدالله سهيل بن عمرو - واصطلحا على وضع الحرب على الناس عشر سنين، يأمن فيهن الناس ويكف بعضهم عن بعض - على أنه من قدم مكة من أصحاب محمد حاجاً أو معتمراً أو يبتغي من فضل الله فهو آمن على دمه وماله، ومن قدم المدينة من قريش مجتازاً إلى مصر أو إلى الشام، يبتغي من فضل الله فهو آمن على دمه وماله - على أنه من أتى محمداً من قريش بغير اذن وليه رده عليهم، ومن جاء قريشاً ممن مع محمد لم يردوه عليه -وأن بيننا عيبة مكفوفة، وأنه لااسلال ولااغلال -وأنه من أحب أن يدخل في عقد محمد وعهده دخله، ومن أحب أن يدخل في عقد قريش وعهدهم دخل فيه فتواثبت خزاعة فقالوا: نحن في عقد محمد وعهده، وتواثبت بنو بكر فقالوا: نحن في عقد قريش وعهدهم - وأنت ترجع عنا عامك هذا، فلا تدخل علينا مكة، وأنه إذا كان عام قابل خرجنا عنك فدخلتها بأصحابك، فأقمت بها ثلاثاً معك سلاح الراكب، السيوف في القرب، ولاتدخلها بغيرها - وعلى أن هذا الهدي ماجئناه ومحله فلا تقدمه علينا أشهد على الصلح رجال من المسلمين ورجال من المشركين:فمن المسلمين: أبو بكر الصديق، وعمر بن الخطاب، وعبدالرحمن بن عوف، وعبدالله بن سهيل بن عمرو، وسعد بن أبي وقاص، ومحمد بن سلمة، وعلي بن أبي طالب كاتب المعاهدة رضي الله عنهم أجمعين، ومن المشركين: مكرز بن حفص وسهيل بن عمرو.';
const String p7 =
    'تعتبر هذه المعاهدة أساساً للمعاهدات الإسلامية ونموذجاً فريداً للمعاهدات الدولية، بما سبقها من مفاوضات وماحوته من شروط وماتمثل بها من خلق النبي ﷺ في النزول عند رضا الطرف الآخر، وفي كيفية الصياغة والالتزام هذه المعاهدة، سبقها مفاوضات من قبل المشركين والمسلمين، وفشل بعض الممثلين في الوصول إلى اتفاق، ودارت مشاورات شتى من الجانبين قبل الوصول إليه حتى توصل الفريقان إلى اتفاق عن طريق ممثل المشركين سهيل بن عمرو ورسول الله ﷺ على ملأ المسلمين.';
const String p8 =
    'وقد عقدت هذه المعاهدة في الوقت الذي كان فيه المسلمون بمركز القوة لا الضعف، وكان باستطاعتهم أن لايقبلوا شروطها التي اغتاظ منها كثير من الصحابة، ولكن ماكان لهم أن يخرجوا عن طوع رسول الله ﷺ الذي لاينطق عن الهوى، وقد تمادى رسول قريش على رسول الله في مفاوضته وكان فرداً بين جيش المسلمين، فلم ينله أذى، ولم يتمادى عليه المسلمون بالقتل لأن السفراء لاتقتل ولكن رسول الله يرضيه، ويسعه بالحلم واللين حتى يصل إلى الغاية التي ينشدها الإسلام، وهي حقن الدماء واحلال السلام ورجاء أن يعقل القوم الحق، وأن يراجعوا المواقف ويسمعوا كلام الله وتدخل الدعوة الإسلامية طوراً جديداً بصور أخرى في الانتشار والاتصال بالناس.';
const String p9 =
    'أن ديباجة المعاهدات الإسلامية كانت تبدأ باسم الله، أو باسمك اللهم، والقانون الدولي في صياغة المعاهدات يقول: تبدأ كتابة المعاهدات بديباجة يتفق عليها طرفا التعاقد.';
const String p10 =
    'بواعث المعاهدة فقد جاء في بداية هذه المعاهدة ذكر الصلح لأجل وضع الحرب عن الناس عشر سنين يأمن فيهن الناس ويكف بعضهم عن بعض، وهذا ماعليه القانون الدولي العام كذلك.';
const String p11 =
    'في معاهدة صلح الحديبية جواز ابتداء الامام رئيس الدولة الإسلامية بطلب صلح العدو اذا رأى المصلحة للمسلمين فيه، ولايتوقف ذلك على أن يكون ابتداء الطلب منهم.';
const String p12 =
    'ان مصالحة المشركين ببعض مافيه ضيم على المسلمين جائز للمصلحة الراجحة ودفع ماهو شر منه، ففيه دفع أعلى المفسدتين باحتمال ادناها.';
const String p13 =
    'ان صلح الحديبية سماه الله فتحاً، لأن الفتح في اللغة هو فتح المغلق والصلح الذي حصل مع المشركين بالحديبية كان مسدوداً مغلقاً ففتحه الله، والصلح كذلك يفتح القلوب المغلقة نحو الطرف الآخر.';
const String p14 =
    'إن المعاهدة قد تكون مفتوحة لمن يحب أن يدخل فيها من الأطراف أو الدول الأخرى، وهذا ماعليه القانون الدولي حيث أجاز أن تكون المعاهدة مفتوحة لمن يحب الدخول فيها من الأطراف الأخرى، فقد دخلت خزاعة وكنانة في الصلح الذي أنهى حالة الحرب القائمة بين هاتين القبيلتين والتي امتدت سنوات عديدة.';
const String p15 =
    'إن المعاهدة يجوز أن يكون الوسيط فيها طرفاً محايداً، أو طرفاً يقرب بين وجهات النظر كوساطة سيد الأحابيش الحليس بن علقمة حليف قريش الأكبر، طلبت منه قريش أن يكون وسيطاً بينهم وبين المسلمين، وكان الحليس ذا عقل راجح وبصيرة نافذة، وكان سيداً مطاعاً، وكان رسول الله ﷺ يعرفه ويعرف فيه التأله الشديد والتعظيم للحرم.';
const String p16 =
    'إن المعاهدة في الاسم تعتبر نافذة المفعول بمجرد الاتفاق على المعاهدة وشروطها، حتى ولم تكتب ولم يوقع عليها الطرفان وذلك كما حدث لأبي جندل بن سهيل بن عمرو الذي رده الرسول ﷺ بموجب قبوله عليه السلام بالبند الخامس من المعاهدة، والذي يقول: على أنه من أتى محمداً من قريش بغير اذن وليه رده عليهم... فمنذ أعلن رسول الله ﷺ التزامه بهذا الشرط أجراه ولو لم تكن المعاهدة قد كتبت بعد، ولم يوقع عليها الطرفان.';
const String p17 =
    'إن من أبلغ دروس صلح الحديبية درس الوفاء بالعهد والتقيد بما يفرضه شرف الكلمة من الوفاء بالالتزامات التي يقطعها المسلم على نفسه، وقد ضرب رسول الله ﷺ بنفسه أعلى مثل في التاريخ القديم والحديث، لاحترام كلمة لم تكتب، واحترام كلمة تكتب واحترام كلمة تكتب كذلك وفي الجد في عهوده، وحبه للصراحة والواقعية وبغضه التحايل والالتواء والكيد، وذلك حينما كان يفاوض سهيل بن عمرو في الحديبية حيث جاءه ابن سهيل يرسف في الاغلال، وقد فر من مشركي مكة وكان ابوه يتفاوض مع الرسول ﷺ وكان هذا الابن ممن آمنوا بالاسلام جاء مستصرخاً بالمسلمين، وقد انفلت من أيدي المشركين فلما رأى سهيل ابنه قام اليه واخذه بتلابيبه وقال: يامحمد لقد لجت القضية بيني وبينك، أي فرغنا من المناقشة قبل أن يأتيك هذا، فقال رسول الله ﷺ : صدقت فقال أبو جندل: يامعشر المسلمين أأرد إلى المشركين يفتنونني في ديني، فلم يغني عنه ذلك شيئاً، ورده رسول الله ﷺ وقال لأبي جندل: إنا قد عقدنا بيننا وبين القوم صلحاً وأعطيناهم على ذلك وأعطونا عهداً وإنا لانغدر بهم، غير أن النبي ﷺ إزاء هذه المأساة التي حالت بنود معاهدة الصلح بينه وبين أن يجد مخرجاً منها لأبي جندل المسلم، طمأن أبا جندل وبشرَّه بقرب الفرج له ولمن على شاكلته من المسلمين وقال له: - وهو يواسيه - يا أبا جندل إصبر واحتسب، فإن الله جاعل لك ولمن معك من المستضعفين فرجا ومخرجا وفي هذه الكلمات النبوية المشرقة العظيمة دلالة ليس فوقها دلالة على مقدار حرص رسول الله ﷺ وتمسكه بفضيلة الوفاء بالعهد مهما كانت نتائجه وعواقبه فيما يبدو للناس لقد كان درس أبي جندل امتحاناً قاسياً ورهيباً.';
const String p18 =
    'وقد صبر أبو جندل واحتسب لمصابه في سبيل دينه وعقيدته وتحقق فيه قول الله تعالى: وَمَنْ يَتَّقِ اللَّهَ يَجْعَلْ لَهُ مَخْرَجًا وَيَرْزُقْهُ مِنْ حَيْثُ لا يَحْتَسِبُ وَمَنْ يَتَوَكَّلْ عَلَى اللَّهِ فَهُوَ حَسْبُهُ إِنَّ اللَّهَ بَالِغُ أَمْرِهِ قَدْ جَعَلَ اللَّهُ لِكُلِّ شَيْءٍ قَدْرًا - سورة الطلاق.';
const String p19 =
    'فلم تمرأقل من سنة حتى تمكن مع إخوته المسلمين المستضعفين بمكة من الإفلات من سجون مكة وأصبحوا قوة صار كفار مكة يخشونها بعد أن انظموا إلى أبي بصير وسيطروا على طرق قوافل المشركين الآتية من الشام وسيأتي تفصيل ذلك لاحقاً بإذن الله تعالى.';
const String p20 =
    'بعد الاتفاق على معاهدة الصلح وقبل تسجيل وثائقها ظهرت بين المسلمين معارضة شديدة وقوية لهذه الإتفاقية، وخاصة في البندين اللذين يلتزم النبي ﷺ بموجبها بردّ من جاءه من المسلمين لاجئاً، ولاتلتزم قريش برد من جاءها من المسلمين مرتداً، والبند الذي يقضي بأن يعود المسلمون من الحديبية إلى المدينة دون أن يدخلوا مكة ذلك العام، وقد كان أشد الناس معارضة لهذه الإتفاقية وانتقاداً لها عمر بن الخطاب وأسيد بن حضير سيد الأوس وسعد بن عبادة سيد الخزرج.';
const String p21 =
    'وقد ذكر المؤرخون أن عمر بن الخطاب أتى رسول الله معلناً معارضته لهذه الاتفاقية وقال لرسول الله ﷺ : ألست برسول الله؟ قال: بلى قال: أولسنا بالمسلمين؟ قال: بلى قال: أوليسوا بالمشركين؟ قال: بلى، قال: فعلام نُعطي الدنية في ديننا؟ قال إني رسول الله ولست أعصيه، وفي رواية: أنا عبدالله ورسوله لن أخالف أمره ولن يضيعني، قلت أوليس كنت تحدثنا أنا سنأتي البيت فنطوف به؟ قال بلى، فأخبرتك أنا نأتيه العام؟ قلت لا، قال فإنك آتيه ومطوف به قال عمر: فأتيت أبا بكر فقلت له: يا أبا بكر: أليس برسول الله؟ قال: بلى، قال: أولسنا بالمسلمين؟ قال: بلى، قال: أوليسوا بالمشركين؟ قال بلى، قال: فعلام نعطي الدنية في ديننا؟ فقال أبو بكر – ناصحاً الفاروق بأن يترك الاحتجاج والمعارضة - إلزم غرزه، فإني أشهد أنه رسول الله وأن الحق ما أمر به ولن نخالف أمر الله ولن يضيّعه الله.';
const String p22 =
    'وبعد حادثة أبي جندل المؤلمة المؤثرة عاد الصحابة الى تجديد المعارضة للصلح، وذهبت مجموعة منهم الى رسول الله ﷺ بينهم عمر بن الخطاب لمراجعته، وإعلان معارضتهم مجدداً للصلح إلا أن النبي ﷺ بما أعطاه الله من صبر وحكمة وحلم وقوة حجة استطاع أن يقنع المعارضين بوجاهة الصلح، وأنه في صالح المسلمين وأنه نصر لهم، وأن الله سيجعل للمستضعفين من أمثال ابي جندل فرجاً ومخرجاً وقد تحقق ما أخبر به ﷺ .';
const String p23 =
    'وبهذا يتبين أن الرسول ﷺ وضع قاعدة احترام المعارضة النزيهة حيث قرر ذلك بقوله وفعله وهو – والله أعلم - إنما أراد بهذا الفعل ارشاد القادة من بعده الى احترام المعارضة النزيهة التي تصدر من أتباعهم، وذلك بتشجيع الأتباع على إبداء الآراء السليمة التي تخدم المصلحة العامة.';
const String p24 =
    'وهذا الهدي النبوي الكريم بين أن حرية الرأي مكفولة في المجتمع الاسلامي، وأن للفرد في المجتمع المسلم الحرية في التعبير عن رأيه، ولو كان هذا الرأي نقداً لموقف حاكم من الحكام أو خليفة من الخلفاء، فمن حق الفرد المسلم أن يبين وجهة نظره في جو من الأمن والأمان دون ارهاب أو تسلط يخنق حرية الكلمة والفكر.';
const String p25 =
    'ونفهم من معارضة عمر لرسول الله ﷺ أن المعارضة لرئيس الدولة في رأي من الآراء وموقف من المواقف ليست جريمة تستوجب العقاب، ويغيب صاحبها في غياهب السجون.';
const String p26 =
    'لما فرغ رسول الله ﷺ من قضية كتابة الصلح قال لأصحابه قوموا فانحروا ثم احلقوا... حتى قال ذلك ثلاث مرات، فلما لم يقم منهم أحد دخل على أم سلمة، فذكر لها مالقي من الناس، فقالت أم سلمة يانبي الله أتحب ذلك؟ أخرج ثم لاتكلم أحداً منهم كلمة حتى تنحر بدنك، وتدعو حالقك فيحلقك، فخرج فلم يكلم أحداً منهم حتى فعل ذلك: نحر بدنه ودعا حالقه، فلما رأوا ذلك قاموا فنحروا وجعل بعضهم يحلق بعضاً حتى كاد بعضهم يقتل بعضاً غما.';
const String p27 =
    'وقد حلق رجال يوم الحديبية وقَصّر آخرون، فقال رسول الله ﷺ يرحم الله المحلقين: قالوا: والمقصرين يارسول الله؟ قال: يرحم الله المحلقين، قالوا والمقصرين يارسول الله؟ قال: يرحم الله المحلقين، قالوا: والمقصرين يارسول الله؟ قال: والمقصرين.';
const String p28 =
    'وكان في هدي النبي ﷺ في الحديبية جملاً لابي جهل في رأسه برة من فضة يغيظ بذلك المشركين.';
const String p29 =
    'كان رأي أم سلمة سديداً ومباركاً حيث فهمت رضي الله عنها عن الصحابة أنه وقع في أنفسهم أن يكون النبي ﷺ أمرهم بالتحلل أخذاً بالرخصة في حقهم وأنه يستمر على الإحرام أخذاً بالعزيمة في حق نفسه، فأشارت على النبي ﷺ أن يتحلل لينتفي عنهم هذا الاحتمال، وعرف النبي ﷺ صواب ما أشارت به ففعله، فلما رأى الصحابة ذلك بادروا إلى فعل ما أمرهم به، فلم يبق بعد ذلك غاية تنتظر فكان ذلك رأياً سديداً ومشورة مباركة وفي ذلك دليل على إستحسان مشاورة المرأة الفاضلة مادامت ذات فكرة صائبة ورأي سديد.';
const String p30 =
    'أهمية القدوة العملية فقد دعا رسول الله ﷺ إلى أمر وكرره ثلاث مرات وفيهم كبار الصحابة وشيوخهم ومع ذلك لم يستجب أحد لدعوته، فلما قدم رسول الله ﷺ على الخطوة العملية التي أشارت بها أم سلمة تحقق المراد، فالقدوة العملية في مثل هذه المواقف أجدى وأنفع.';
const String p31 =
    'حكم الإحصار في العمرة والحج: دل عمل الرسول ﷺ بعد الفراغ من أمر الصلح، من التحلل والنحر والحلق، على أن المحصر يجوز له أن يتحلل، وذلك بأن يذبح شاة حيث أحصر أو مايقوم مقامها ويحلق ثم ينوي التحلل مما كان قد أهلّ به سواء كان حجّاً أو عمرة، كما دلّ على أن المتحلل لا يلزم بقضاء الحج أو العمرة إذا كان متطوعاً، وخالف الحنفية فرأوا أن القضاء بعد المباشرة واجب، بدليل أن جميع الذين خرجوا معه ﷺ في صلح الحديبية خرجوا معه في عمرة القضاء، إلا من توفي أو استشهد منهم في غزوة خيبر.';
