const int sectionIndex = 54;
const String sectionTitle = 'صلح الحديبية - الخروج إلى مكة';

const List t1 = ['1', 'الرؤيا'];
const List t2 = ['2', 'انتشار خبر الخروج بين قبائل العرب'];
const List t3 = ['3', 'الحيطة والحذر'];
const List t4 = ['4', 'وصول النبي ﷺ بعسفان'];
const List t5 = ['5', 'الرسول ﷺ يغير الطريق وينزل بالحديبية'];
const List t6 = ['6', 'ماخلأت القصواء'];
const List t7 = ['7', 'الحكمة فى بروك ناقة'];
const List t8 = ['8', 'السفارة بين الرسول ﷺ وقريش'];
const List t9 = ['9', 'ركب من خزاعة بقيادة بُدَيْل بن ورقاء'];
const List t10 = ['10', 'براعة النبي ﷺ في عرضه  للهدنة'];
const List t11 = ['11', 'سفارة عروة بن مسعود الثقفي'];
const List t12 = ['12', 'غضب المغيرة بن شعبة من استفزاز عروة'];
const List t13 = ['13', 'فشل مفاوضات عروة بن مسعود'];
const List t14 = ['14', 'سفارة الحُليس بن علقمة'];
const List t15 = ['15', 'سفارة مكرز بن حفص'];
const List t16 = ['16', 'الوفود النبوية إلى قريش'];
const List t17 = ['17', 'إختيار عثمان بن عفان رضى الله عنه'];
const List t18 = ['18', 'مساومات قريش مع عثمان'];
const List t19 = ['19', 'بِبَطنِ مَكةَ'];

const String p1 =
    'رأى رسول الله ﷺ رؤيا في منامه -وهو في المدينة- أنه دخل مكة مع أصحابه المسلمين محرماً مؤدياً للعمرة، وقد ساق الهدي معظماً للبيت مقدساً له، فبشر النبي ﷺ أصحابه ففرحوا بها، فرحاً عظيماً فقد طال عهدهم بمكة والكعبة التي رضعوا بلبان حبها ودانوا بتعظيمها ومازادهم الإسلام إلا ارتباطاً بها وشوقاً اليها، وقد تاقت نفوسهم إلى الطواف حولها وتطلعت اليه تطلعاً شديداً، وكان المهاجرون أشدهم حنيناً إلى مكة فقد ولدوا ونشأوا فيها وأحبوها حباً شديداً وقد حيل بينهم وبينها، فلما أخبرهم رسول الله ﷺ بذلك تهيؤا لتلك الزيارة العظيمة، واستنفر ﷺ أهل البوادي والأعراب ليخرجوا معه، لأنه كان يخشى أن تصده قريش عن البيت الحرام، وكانت استخبارات المدينة قد علمت بأمر التحالف العسكري الذي عقد بين قريش في جنوب المدينة المنورة وخيبر في شمالها وكان هدف هذا التحالف جعل الدولة الإسلامية بين طرفي الكماشة، ثم إطباق فكيها عليها وإنهاء الوجود الإسلامي فيها، فقد حان الوقت لكسر ذلك التحالف سياسياً، فقد كانت الكعبة في نظر العرب قاطبة ليست ملكاً لقريش بل هي تراث أبيهم إسماعيل ولهذا فليس من حق قريش أن تمنع من زيارتها من تشاء وتجيز من تشاء فإذن من حق محمد وأصحابه زيارة الكعبة.';
const String p2 =
    'وقد خرج الرسول ﷺ من المدينة في يوم الاثنين الأول من ذي القعدة سنة 6هـ متوجهاً بأصحابه إلى مكة لأداء العمرة.';
const String p3 =
    'وانتشر خبر خروج رسول الله ﷺ وكان له أثر في الرأي العام وخصوصاً بعدما أكد رسول الله ﷺ بأنه لايريد حرباً وإنما يريد أن يعتمر ويعظم شعائر الله، وحقق هذا الفعل الكريم مكاسب إعلامية رفيعة المستوى، وقد كان هدف النبي ﷺ معلناً ألا وهو زيارة بيت الله الحرام لأداء العمرة، فتجرد هو وأصحابه من المخيط ولبسوا ثياب الإحرام وأحرم بالعمرة من ذي الحليفة بعد أن قلد الهدي وأشعره.';
const String p4 =
    'وقد كان ﷺ على جانب كبير من الحيطة والحذر، فقد أرسل بشراً بن سفيان الخزاعي عيناً له، وقدّم بين يديه طليعة استكشافية مكوّنة من عشرين رجلاً، وأخذ ﷺ بمشورة عمر في ذي الحليفة عندما قال له: يارسول الله تدخل على قوم هم لك حرب بغير سلاح ولاكراع؟ فبعث النبي ﷺ إلى المدينة من يحمل له الكراع والسلاح وكان قصده ﷺ من ذلك: الاستعداد لهؤلاء الأعداء، الذين يملكون السلاح والعتاد مايستطيعون به إلحاق الأذى بالمسلمين والنيل منهم، وهذا التعامل مع سنة الأخذ بالأسباب من هديه الكريم الذي جعله لأمته لتقتدي به من بعده ﷺ لما في ذلك من المصالح الكثيرة، ولما فيه من درء مكايد الأعداء الذين يتربصون بالمسلمين الدوائر.';
const String p5 =
    'لما وصل رسول الله ﷺ بعسفان لقيه بشر بن سفيان الكعبي الخزاعي فقال: يارسول الله هذه قريش قد سمعت بمسيرك ومعها العوذ المطافيل، قد لبسوا جلود النمور يعاهدون الله ألا تدخلها عليهم عنوة أبداً، فقال رسول الله ﷺ : ياويح قريش لقد أكلتهم الحرب ماذا عليهم لو خلوا بيني وبين سائر الناس؟ فإن أصابوني كان الذي أرادوا وإن أظهرني الله عليهم دخلوا في الإسلام وهم وافرون، وإن لم يفعلوا قاتلوا وبهم قوة فماذا تظن قريش؟ والله إني لاأزال أجاهدهم على الذي بعثني الله له أو تنفرد هذه السالفة.';
const String p6 =
    'وقد استشار ﷺ أصحابه لما بلغه خبر استعداد قريش لصده عن دخول البيت الحرام وعرض ﷺ على الصحابة رضي الله عنهم المشورة في هذا الأمر على رأيين، الاول : الميل إلى عيال وذراري الأحابيش الذين خرجوا لمعاونة قريش، الثانى : قصد البيت الحرام فمن صدّه عنه قاتله حتى يتمكن من تحقيق هدفه.';
const String p7 =
    'ولما عرض ﷺ المشورة في هذا الأمر على الصحابة تقدم أبو بكر الصديق برأيه الذي تدعمه الحجة الواضحة، حيث أشار على رسول الله ﷺ بترك قتالهم والاستمرار على ماخرج له من أداء العمرة حتى يكون بدء القتال منهم، فاستحسن النبي ﷺ هذا الرأي وأخذ به وأمر الناس أن يمضوا في هذا السبيل، وعندما اقتربت خيل المشركين من المسلمين صلى النبي ﷺ بأصحابه صلاة الخوف بعسفان.';
const String p8 =
    'ولما بلغ رسول الله ﷺ أن قريشاً قد خرجت تعترض طريقه، وتنصب كميناً له ولأصحابه بقيادة خالد بن الوليد، وهو لم يقرر المصادمة رأى أن يغير طريق الجيش الإسلامي تفادياً للصدام مع المشركين، فقال: من رجل يخرج بنا على طريق غير طريقهم التي هم بها؟ فقال رجل من أسلم: أنا يارسول الله فسلك بهم طريقاً وعراً بين شعاب، وشق على المسلمين السير فيه حتى خرجوا إلى أرض سهلة عند منقطع الوادي، وعند ذلك قال رسول الله ﷺ للناس: قولوا نستغفر الله ونتوب إليه فقالوا ذلك فقال: والله إنها الحطة التي عرضت على بني إسرائيل فلم يقولوها.';
const String p9 =
    'فأمر رسول الله ﷺ الناس أن يسلكوا ذات اليمين بين ظهري الحمش في طريق تخرجه إلى ثنية المرار، فهبط الحديبية من أسفل مكة، فسلك الجيش ذلك الطريق بخفة ودون أن يشعر به أحد، فما نظر خالد إلا وقترة جيش المسلمين قد ثارت فعاد مسرعاً هو ومن معه إلى مكة يحذر أهلها ويأمرهم بالاستعداد لهذا الحدث المفاجئ وقد أصاب الذعر المشركين وفوجئوا بنزول الجيش الإسلامي بالحديبية حيث تعرضت مكة للخطر وأصبحت مهددة من المسلمين تهديداً مباشرا.';
const String p10 =
    'وعندما اقترب الرسول ﷺ من الحديبية بركت ناقته القصواء، فقال الصحابة رضي الله عنهم: خلأت القصواء فقال النبي ﷺ : ماخلأت القصواء، وماذاك لها بخلق ولكن حبسها حابس الفيل، ثم قال: والذي نفسي بيده لايسألونني خطة يعظمون فيها حرمات الله إلا أعطيتهم إياها، ثم زجرها فوثبت ثم عدل عن دخول مكة وسار حتى نزل بأقصى الحديبية على ثمد -بئر- قليل الماء، مالبثوا أن نزحوه ثم اشتكوا إلى رسول الله ﷺ العطش، فانتزع سهماً من كنانته ثم أمرهم أن يجعلوه فيه فجاش لهم بالري فارتووا جميعاً.';
const String p11 =
    'كل شيء في هذا الكون يسير بأمر الله ومشيئته ولايخرج في سيره عن مشيئته وإرادته، فتأمل في ناقة رسول الله ﷺ أين بركت، وكيف كره الصحابة بروكها وحاولوا انهاضها لتستمر في سيرها، فيستمروا في سيرهم إلى البيت العتيق مهما كانت النتائج ولكن الله سبحانه وتعالى أراد غير ذلك.';
const String p12 =
    'إن الله سبحانه وتعالى جلت قدرته وعزت عظمته، قضى ألا يكون قتال بين المسلمين والمشركين من أهل مكة في هذه الغزوة بالذات لحكم ظهرت فيما بعد منها: دخول المسلمين بالقوة يعني أن تحدث مذابح وتزهق أرواح كثيرة وتسفك دماء غزيرة من الطرفين، وهذا أمر لم يرده البارئ سبحانه وكان لمصلحة الفريقين المؤمنين والمشركين.';
const String p13 =
    'إن من المحتمل أن ينال الأذى والقتل والتشريد على أيدي المؤمنين بعض المستضعفين من اخوانهم المسلمين في مكة، وهذا فيه مافيه من المعرة التي لايليق بمسلم أن يقع فيها قال سبحانه: هُمُ الَّذِينَ كَفَرُوا وَصَدُّوكُمْ عَنِ الْمَسْجِدِ الْحَرَامِ وَالْهَدْيَ مَعْكُوفًا أَنْ يَبْلُغَ مَحِلَّهُ وَلَوْلا رِجَالٌ مُؤْمِنُونَ وَنِسَاءٌ مُؤْمِنَاتٌ لَمْ تَعْلَمُوهُمْ أَنْ تَطَئُوهُمْ فَتُصِيبَكُمْ مِنْهُمْ مَعَرَّةٌ بِغَيْرِ عِلْمٍ لِيُدْخِلَ اللَّهُ فِي رَحْمَتِهِ مَنْ يَشَاءُ لَوْ تَزَيَّلُوا لَعَذَّبْنَا الَّذِينَ كَفَرُوا مِنْهُمْ عَذَابًا أَلِيمًا - سورة الفتح';
const String p14 =
    'بذل رسول الله ﷺ مافي وسعه لإفهام قريش أنه لايريد حرباً معهم، وإنما يريد زيارة البيت الحرام وتعظيمه وهو حق للمسلمين كما هو حق لغيرهم، وعندما تأكدت قريش من ذلك أرسلت إليه من يفاوضه ويتعرف على قوة المسلمين ومدى عزمهم على القتال إذا ألجئوا إليه، وطمعاً في صد المسلمين عن البيت بالطرق السليمة من جهة ثالثة.';
const String p15 =
    'جاء بُديل بن وَرْقَاء في رجال من خزاعة وكانت خزاعة عَيْبة نصح رسول الله ﷺ من أهل تهامة، وبينوا أن قريشاً تعتزم صد المسلمين عن دخول مكة، فأوضح لهم الرسول ﷺ سبب مجيئة وذكر لهم الضرر الذي وقع على قريش من استمرار الحرب، واقترح عليهم أن تكون بينهم هدنة إلى وقت معلوم حتى يتضح لهم الأمر، وإن أبوا فلا مناص من الحرب ولو كان في ذلك هلاكه، فنقلوا ذلك إلى قريش، وقالوا لهم: يامعشر قريش إنكم تعجلون على محمد إن محمداً لم يأت لقتال وإنما جاء زائراً هذا البيت فاتهموهم وخاطبوهم بما يكرهون، وقالوا: وإن كان إنما جاء لذلك فلا والله لايدخلها علينا عنوة أبداً ولاتتحدث بذلك العرب.';

const String p16 =
    'وقد ظهرت براعة النبي ﷺ السياسية في عرضه على مشركي مكة الهدنة والصلح لأن في ذلك فوائد كثيرة منها:';
const String p17 =
    'فبالهدنة يضمن حياد قريش ويعزلها عن أي صراع يحدث في الجزيرة العربية سواء كان هذا الصراع مع القبائل العربية الأخرى أم مع اليهود ذلك العدو اللئيم الغادر الذي يتربص بالمسلمين الدوائر.';
const String p18 =
    'حرص الرسول ﷺ على أن يبقى باب الاتصال مفتوحاً بينه وبين قريش، ليسمع منهم ويسمعوا منه بواسطة الرسل والسفراء وفي هذا تقريب للنفوس وتبريد لجو الحرب واضعاف لحماسهم نحو القتال.';
const String p19 =
    'حرص ﷺ على أن تدرك خزاعة بقيادة بديل والركب الذي معه أن حليفهم قوي، فتزداد ثقتهم به وحلفهم له ولبني هاشم من قبل الإسلام فقد بقي ولم يلغ وتأكد في صلح الحديبية.';
const String p20 =
    'إن العقلاء الذين يفكرون بعقولهم حين يسمعون كلام الرسول ﷺ وأنه جاء معظماً للبيت والمشركون يردونه وهو يصر على تعظيمه، سيقف هؤلاء بجانبه ويتعاطفون معه فيقوي مركزه ويضعف مركز قريش الإعلامي والديني في نفوس الناس.';
const String p21 =
    'إن مشركي مكة لم يطمئنوا إلى كلام بديل الذي نقله إليهم، ذلك لأنهم يعلمون أن خزاعة كانت عيبة نصح لرسول الله ﷺ ويشعرون بود خزاعة للرسول والمسلمين.';

const String p22 =
    'لم تقبل قريش مانقله بديل بن ورقاء الخزاعي عن رسول الله ﷺ أنه جاء زائراً للبيت ولم يأت مقاتلاً، واتهمتهم بل وأسمعتهم مايكرهون فاقترح عليهم عروة بن مسعود الثقفي أن يقابل الرسول ﷺ ويسمع منه، ثم يأتيهم بالخبر اليقين وقد ذكر ذلك البخاري في صحيحه فقال: فقام عروة بن مسعود فقال: أيْ قوم ألستم بالوالد؟ قالوا: بلى، قال: أولست بالولد؟ قالوا: بلى قال: فهل تتهموني؟ قالوا: لا، قال: ألستم تعلمون أني استنفرت أهل عكاظ، فلما بلحوا -اى كأنهم أعيوا عن الخروج معه وإعانته- علي جئتكم بأهلي وولدي ومن أطاعني؟ قالوا: بلى قال: فإنّ هذا عرض عليكم خطة رشد فاقبلوها، ودعوني آته، قالوا: ائته، فأتاه فجعل يكلم النبي ﷺ ، فقال النبي ﷺ نحواً من قوله لبديل، فقال عروة عند ذلك: أي محمد أرأيت -أخلاطاً من قبائل شتى- إن استأصلت أمر قومك، هل سمعت بأحد من العرب اجتاح أهله قبلك؟ وإن تكن الأخرى فإنني والله لا أرى وجوهاً، وإني لأرى أشوابا من الناس خليقاً أن يفروا ويدعوك، فقال أبو بكر: أمصص بظر اللات، أنحن نفرُّ عنه وندعه؟ فقال من ذا؟ قالوا: أبو بكر قال: أما والذي نفسي بيده لولا يد كانت لك عندي لم أجزك بها لأجبتك.';
const String p23 =
    'لقد حاول عروة بن مسعود أن يشن على المسلمين حرباً نفسية حتى يهزمهم معنوياً، فاستخدم عنصر الاشاعة ويظهر ذلك عندما لوح بقوة قريش العسكرية، معتمداً على المبالغة في تصوير الموقف بأنه سيؤول لصالح قريش لامحالة، وذلك وأن يوقع الفتنة والإرباك في صفوف المسلمين.';
const String p24 =
    'لقد مارس عروة بن مسعود في مفاوضاته عناصر الحرب النفسية من إشاعة وافتعال الأزمات وإثارة الرعب إلا أن تلك العناصر تحطمت أمام الإيمان العميق والتكوين الدقيق والصف الإسلامي المرصوص ومن المفارقات الرائعة التي حصلت أثناء المفاوضات مع عروة بن مسعود وهي من عجائب الأحداث التي يستشف منها الدليل القاطع على قوة الإيمان التي كانت يتمتع بها أصحاب النبي ﷺ ، وعلى قدرة هذا الدين من تحويل الإنسان من شيطان مريد إلى إنسان فاضل نبيل حيث كان أحد الذين يتولون حراسة النبي ﷺ أثناء محادثاته مع عروة بن مسعود الثقفي في الحديبية هو المغيرة بن شعبة، ابن أخ عروة بن مسعود نفسه، وكان المغيرة هذا قبل أن يهديه الله للإسلام شاباً فاتكاً سكيراً قاطعاً للطريق، غير أن دخوله للإسلام حوله إلى إنسان آخر وقد أصبح بفضل الله تعالى من الصفوة المؤمنة، وقد وقع عليه الاختيار ليقوم بمهام حراسة النبي ﷺ في ذلك الجو الملبد بغيوم الحرب، وكان من عادة الجاهلية في المفاوضات، أن يمسك المفاوض بلحية الذي يراه نداً له أثناء الحديث، وعلى هذه القاعدة كان عروة بن مسعود يمسك بلحية رسول الله ﷺ أثناء المناقشة، الأمر الذي أغضب المغيرة بن شعبة الذي كان قائماً على رأس رسول الله ﷺ بالسيف يحرسه وعلى وجهه المغفر فانتهر عمه وقرع يده بقائم السيف قائلاً له: أكفف يدك عن مس لحية رسول الله ﷺ قبل أن لا تصل إليك.';
const String p25 =
    'وكان النبي ﷺ يبتسم للذي يجري بين عروة المشرك وبين ابن أخيه المؤمن، ولما كان المغيرة بن شعبة يقف بلباسه الحربي متوشحاً بسيفه ودرعه وعلى وجهه المغفر، فإن عمه عروة لم يكن باستطاعته معرفته، فقال للنبي ﷺ وهو في أشد الغضب: ليت شعري من أنت يامحمد من هذا الذي أرى من بين أصحابك؟ فقال له رسول الله ﷺ : هذا ابن أخيك المغيرة بن شعبة، فقال له عمه: وأنت بذلك ياغدر؟ لقد أورثتنا العداوة من ثقيف أبد الدهر، والله ماغسلت غدرتك إلا بالأمس كان المغيرة صحب قوماً في الجاهلية فقتلهم وأخذ أموالهم ثم جاء فأسلم فقال النبي ﷺ : أما الإسلام فأقبل وأما المال فلست منه في شيء.';
const String p26 =
    'لقد فشل عروة في مفاوضاته ورجع محذراً قريش من أن تدخل في صراع مسلح مع النبي ﷺ وأصحابه وقال لهم: ياقوم إني قد وفدت على الملوك على كسرى، وهرقل، والنجاشي وإني والله مارأيت ملكاً قط أطوع فيمن هو بين ظهرانيه من محمد وأصحابه، والله مايشدون إليه النظر، ومايرفعون عنده الصوت، ومايكفيه إلا أن يشير إلى أمر فيفعل، وما يتنخم وما يبصق إلاّ وقعت في يدي رجل منهم يمسح بها جلده ومايتوضأ إلا ازدحموا عليه أيُهُم يظفر منه بشئ، وقد حزرت القوم، واعلموا إنكم إن أردتم السيف بذلوه لكم، وقد رأيت قوماً مايبالون مايُصنعُ بهم، إذا منعوا صاحبهم، والله لقد رأيت نسياتُ معه، إن كنّ ليسلمنه أبداً على حال قرّوا رأيكم، وإياكم وإضجاع الرأي -الوهن في الرأي- فمادوه ياقوم، اقبلوا ماعرض فإني لكم ناصح مع اني أخاف ألا تُنْصَروا عليه: رجل أتى هذا البيت معظماً له، معه الهدي ينحره وينصرف! فقالت قريش: لاتكلم بهذا يا أبا يعفور -كنية عروة بن مسعود الثقفي- لو غيرك تكلم بهذا للمناه ولكن نُرَدهُ عن البيت في عامنا هذا ويرجع قابل.';
const String p27 =
    'ثم بعثوا الحُليس بن علقمة الكناني سيد الأحابيش فلما رآه رسول الله ﷺ قال: إن هذا من قوم يتألهون فابعثوا الهدي في وجهه حتى يراه، وأمر برفع الصوت في التلبية، فلما رأى الحليس الهدي يسيل عليه من عرض الوادي في قلائده، رجع إلى قريش قبل أن يصل إلى رسول الله ﷺ ، وذلك إعظاماً لما رأى، فقد كان الوادي مجدباً لا ماء فيه ولامرعى وقد أكل الهدي أو باره من طول الحبس عن محله، ورأى المسلمين وقد استقبلوه رافعين أصواتهم بالتلبية وهم في زي الإحرام، وقد شعثوا من طول المكوث على إحرامهم، وكان يتمتع بسمعة طيبة بين العرب جميعاً وذلك لما يتميز به من رجاحة العقل ولما يتمتع به من مركز ممتاز بوصفه زعيماً وقائداً لقوات الأحابيش، كما كان يتمتع باحترام وتقدير من جانب النبي ﷺ وقريش على حد سواء، لهذا فإنه إذا ماتبين له أن الحق والعدل في جانب المسلمين فإنه يستطيع أن يقوم بدور هام في إحلال السلام بين الطرفين المتنازعين والعمل على كبح جماح قريش.';
const String p28 =
    'وكان من سفراء قريش يوم الحديبية مكرز بن حفص وقد روى البخاري ذلك فقال: فقام رجل منهم يقال له مكرز بن حفص فقال النبي ﷺ : هذا مكرز وهو رجل فاجر فجعل يكلم النبي ﷺ ، فبينما هو يكلمه إذ جاء سهيل بن عمرو، قال معمر: فأخبرني أيوب عن عكرمة أنه لما جاء سهيل بن عمرو، قال النبي ﷺ : قد سهل لكم من أمركم ولنا حديث مع سهيل بإذن الله تعالى.';
const String p29 =
    'رأى النبي ﷺ أن من الضرورة إرسال مبعوث خاص من جانبه إلى قريش يبلغهم فيها نواياه السلمية بعدم الرغبة في القتال واحترام المقدسات ومن ثم أداء مناسك العمرة والعودة إلى المدينة، فوقع الاختيار على أن يكون مبعوث الرسول ﷺ إلى قريش هو خراش بن أمية الخزاعي وحمله على جمل يقال له الثعلب، فلما دخل مكة عقرت به قريش وأرادوا قتل خراش فمنعهم الأحابيش، فعاد خراش بن أمية إلى رسول الله ﷺ وأخبره بما صنعت قريش، فأراد رسول الله ﷺ أن يرسل سفيراً آخر بتبليغ قريش رسالة رسول الله ﷺ .';
const String p30 =
    'وقع اختيار الرسول ﷺ في بداية الأمر على عمر بن الخطاب، فاعتذر لرسول الله ﷺ عن الذهاب إليهم، وأشار على رسول الله ﷺ أن يبعث عثمان مكانه، وعرض عمر رضي الله عنه رأيه هذا معززاً بالحجة الواضحة، وهي ضرورة توافر الحماية لمن يخالط هؤلاء الأعداء وحيث أن هذا الأمر لم يكن متحققاً بالنسبة لعمر رضي الله عنه، فقد أشار على النبي ﷺ بعثمان رضي الله عنه، لأن له قبيلة تحميه من أذى المشركين حتى يبلغ رسالة رسول الله ﷺ وقال لرسول الله: إني أخاف قريشاً على نفسي، قد عرفت عداوتي لها، وليس بها من بني عدي من يمنعني، وإن أحببت يارسول الله دخلت عليهم فلم يقل رسول الله شيئاً، قال عمر: ولكن أدلك يارسول الله على رجل أعز بمكة مني، وأكثر عشيرة وأمنع، عثمان بن عفان، فدعا رسول الله ﷺ عثمان رضي الله عنه فقال: اذهب إلى قريش فخيرهم أنا لم نأت لقتال أحد، وإنما جئنا زواراً لهذا البيت، معظمين لحرمته، معنا الهدي، ننحره وننصرف، فخرج عثمان بن عفان رضي الله عنه حتى أتى بلدح -مكان قريب من مكة- فوجد قريشاً هنالك فقالوا: أين تريد؟';
const String p31 =
    'قال: بعثني رسول الله ﷺ اليكم، يدعوكم إلى الله وإلى الإسلام تدخلون في الدين كافة، فإن الله مظهر دينه ومعز نبيه، وأخرى تكفون ويلي هذا منه غيركم فإن ظفروا بمحمد فذلك ما أردتم، وإن ظفر محمد كنتم بالخيار أن تدخلوا فيما دخل فيه الناس أو تقاتلوا وأنتم وافرون جامون، إن الحرب قد نهكتكم وأذهبت بالأماثل منكم... فجعل عثمان يكلمهم فيأتيهم بما لايريدون ويقولون: قد سمعنا ماتقول ولاكان هذا أبداً ولادخلها علينا عنوة، فارجع إلى صاحبك فأخبره أنه لايصل إلينا.';
const String p32 =
    'فقام إليه أبان بن سعيد بن العاص فرحب به وأجاره: وقال: لاتقصر عن حاجتك، ثم نزل عن فرس كان عليه، فحمل عثمان على السرج وردفه وراءه فدخل عثمان مكة، فأتى أشرافهم رجلاً رجلاً، أبا سفيان ابن حرب، وصفوان بن أمية وغيرهم منهم من لقي ببلدح ومنهم من لقي بمكة، فجعلوا يردون عليه: إن محمداً لايدخلها علينا أبداً.';
const String p33 =
    'وعرض المشركون على عثمان رضي الله عنه أن يطوف بالبيت فأبى، وقام عثمان بتبليغ رسالة رسول الله ﷺ إلى المستضعفين بمكة وبشرهم بقرب الفرج والمخرج، وأخذ منهم رسالة شفهية إلى رسول الله ﷺ جاء فيها: اقرأ على رسول الله ﷺ منا السلام، إن الذي أنزله بالحديبية لقادر على أن يدخله بطن مكة.';
const String p34 =
    'واختلط المسلمون بالمشركين في أمر الصلح، فرمى رجل من أحد الفريقين رجلاً من الفريق الآخر، وكانت معركة، وتراموا بالنبل والحجارة، وصاح الفريقين كلاهما، وارتهن كل واحد من الفريقين بمن فيهم، وقد روى مسلم : أن ثمانين رجلاً من أهل مكة هبطوا على رسول الله ﷺ من جبل التنعيم متسلحين، يريدون غرة النبي ﷺ وأصحابه، فأخذهم سلماً واستبقهم، فأنزل الله عز وجل : وَهُوَ الَّذِي كَفَّ أَيْدِيَهُمْ عَنْكُمْ وَأَيْدِيَكُمْ عَنْهُمْ بِبَطْنِ مَكَّةَ مِنْ بَعْدِ أَنْ أَظْفَرَكُمْ عَلَيْهِمْ وَكَانَ اللَّهُ بِمَا تَعْمَلُونَ بَصِيرًا - سورة الفتح';
