const int sectionIndex = 49;
const String sectionTitle = 'الأحزاب - لا نصر إلا بعد شدة';

const List t1 = ['1', 'شدة تضرع الرسول ﷺ'];
const List t2 = ['2', 'نزول النصر'];
const List t3 = ['3', 'الريح'];
const List t4 = ['4', 'لا إله إلا الله وحده أعز جنده ونصر عبده'];
const List t5 = ['5', 'ألا رجل يأتينا بخبر القوم'];
const List t6 = ['6', 'حذيفة بن اليمان'];
const List t7 = ['7', 'التخلص من بني قريظة'];
const List t8 = ['8', 'حُكم سعد بن معاذ'];
const List t9 = ['9', 'المرأة الوحيدة التى قُتلت من بنى قريضة'];
const List t10 = ['10', 'التخلص من اليهود فى المدينة'];

const String p1 =
    'مع أن المسلمين أخذوا بكافة الاحتياطات في تأمين جبهتهم الداخلية ومحاولة الدفاع عن الإسلام والمدينة من جيش الأحزاب الزاحف إلا أن سنة الله الماضية لانصر إلا بعد شدة، ولامنحة إلا بعد محنة، وكلما اقترب النصر زاد البلاء، والامتحان.';
const String p2 =
    'كان رسول الله ﷺ كثير التضرع والدعاء والاستعانة بالله وخصوصاً في مغازيه وعندما اشتد الكرب على المسلمين أكثر مما سبق حتى بلغت القلوب الحناجر وزلزلوا زلزالاً شديداً، فما كان من المسلمين إلا أن توجهوا إلى الرسول ﷺ وقالوا يارسول الله هل من شيء نقوله؟ فقد بلغت القلوب الحناجر، فقال: نعم اللهم استر عوراتنا وآمن روعاتنا وجاء في الصحيحين من حديث عبدالله بن أبي أوفى قال: دعا رسول الله ﷺ على الأحزاب فقال: اللهم منزل الكتاب سريع الحساب اهزم الأحزاب، اللهم اهزمهم وزلزلهم.';
const String p3 =
    'فأستجاب الله سبحانه وتعالى لدعاء نبيه ﷺ فأقبلت بشائر الفرج، فقد صرفهم الله بحوله وقوته، وزلزل أبدانهم وقلوبهم وشتت جمعهم بالخلاف، ثم أرسل عليهم الريح الباردة الشديدة، وألقى الرعب في قلوبهم وأنزل جنوداً من عنده سبحانه قال تعالى: يَاأَيُّهَا الَّذِينَ ءَامَنُوا اذْكُرُوا نِعْمَةَ اللَّهِ عَلَيْكُمْ إِذْ جَاءَتْكُمْ جُنُودٌ فَأَرْسَلْنَا عَلَيْهِمْ رِيحًا وَجُنُودًا لَمْ تَرَوْهَا وَكَانَ اللَّهُ بِمَا تَعْمَلُونَ بَصِيرًا - سورة الأحزاب';
const String p4 =
    'قال القرطبي رحمه الله وكانت هذه الريح معجزة للنبي ﷺ لأن النبي ﷺ والمسلمين كانوا قريباً منهم، ولم يكن بينهم إلا عرض الخندق، وكانوا في عافية منها، ولاخبر عندهم لها... وبعث الله عليهم الملائكة فقلعت الأوتاد وقطعت أطناب الفساطيط -جمع فسطاط نوع من الأبنية في السفر وهو دون السرادق- ، وأطفأت النيران وأكفأت القدور وجالت الخيول بعضها في بعض، وأرسل عليهم الرعب، وكثر تكبير الملائكة في جوانب المعسكر حتى كان سيد كل خباء يقول: يابني فلان هلم إليّ، فإذا اجتمعوا قال لهم: النجاء النجاء، لما بعث الله عليهم الرعب.';
const String p5 =
    'وحرص الرسول عليه الصلاة والسلام أن يؤكد لصحبه ثم للمسلمين في الأرض، أن هذه الأحزاب التي تجاوزت عشرة آلاف مقاتل لم تُهزم بالقتال من المسلمين - رغم تضحياتهم - ولم تهزم بعبقرية المواجهة، إنما هزمت بالله وحده يَاأَيُّهَا الَّذِينَ ءَامَنُوا اذْكُرُوا نِعْمَةَ اللَّهِ عَلَيْكُمْ إِذْ جَاءَتْكُمْ جُنُودٌ فَأَرْسَلْنَا عَلَيْهِمْ رِيحًا وَجُنُودًا لَمْ تَرَوْهَا وَكَانَ اللَّهُ بِمَا تَعْمَلُونَ بَصِيرًا - سورة الأحزاب';
const String p6 =
    'وعن أبي هريرة رضي الله عنه أن رسول الله ﷺ كان يقول: لا إله إلا الله وحده، أعز جنده، ونصر عبده، وغلب الأحزاب وحده، فلاشيء بعده.';
const String p7 =
    'إن رسول الله ﷺ يعلمنا سنة الأخذ بالأسباب وضرورة الإلتجاء إلى الله وإخلاص العبودية له، لأنه لاتجدي وسائل القوة كلها إذا لم تتوفر وسيلة التضرع إلى الله والإكثار من الإقبال عليه بالدعاء والاستغاثة، فقد كان الدعاء والتضرع إلى الله من الأعمال المتكررة الدائمة التي فزع إليها رسول الله ﷺ في حياته كلها.';
const String p8 =
    'كان رسول الله ﷺ يتابع أمر الأحزاب وأحب أن يتحرى عن ماحدث عن قرب فقال: ألا رجل يأتينا بخبر القوم جعله الله معي يوم القيامة ، فاستعمل ﷺ أسلوب الترغيب وكرره ثلاث مرات وعندما لم يُجْدِ هذا الأسلوب لجأ إلى أسلوب الجزم والحزم في الأمر، فعين واحداً بنفسه فقال: قم ياحذيفة فائتنا بخبر القوم ولاتذعرهم علي.';
const String p9 =
    'وفي هذا معنى تربوي وهو أن القيادة الناجحة هي التي توجه جنودها إلى أهدافها عن طريق الترغيب والتشجيع ولاتلجأ إلى الأمر والحزم إلا عند الضرورة.';
const String p10 =
    'قال حذيفة رضي الله عنه: فمضيت كأنما أمشي في حمام فإذا أبو سفيان يصلي ظهره بالنار فوضعت سهماً في كبد القوس وأردت أن أرميه ثم ذكرت قول رسول الله ﷺ لاتذعرهم عليَّ ولو رميته لأصبته فرجعت كأنما أمشي في حمام، فأتيت رسول الله ﷺ وأصابني البرد حين رجعت وقررت، فأخبرت رسول الله ﷺ والبسني فضل عباءة كانت عليه يصلي فيها، فلم أبرح نائماً حتى الصبح فلما أن أصبحت قال رسول الله ﷺ : قم يا نومان.';
const String p11 =
    'بعد عودة النبي ﷺ من الخندق ووضعه السلاح أمر الله تعالى نبيه بقتال بني قريظة، فأمر الحبيب ﷺ أصحابه بالتوجه إليهم وقد أعلمهم بأن الله تعالى قد أرسل جبريل ليزلزل حصونهم ويقذف في قلوبهم الرعب وأوصاهم بأن لايصلين أحد العصر إلا في بني قريظة.';
const String p12 =
    'وضرب المسلمون الحصار على بني قريظة خمساً وعشرين ليلة، ولما اشتد الحصار وعظم البلاء على بني قريظة، أرادوا الاستسلام والنزول على أن يحكّم الرسول ﷺ فيهم سعد بن معاذ رضي الله عنه ونزلوا على حكمه ورأوا أنه سيرأف بهم بسبب الحلف بينهم وبين قومه الأوس، فجئ بسعد محمولاً لأنه كان قد أصابه سهم في ذراعه يوم الخندق فقضى أن تقتل المقاتلة وأن تسبى النساء والذرية، وأن تقسم أموالهم، فأقره رسول الله ﷺ وقال: قضيت بحكم الله ، ونفذ حكم الإعدام في أربعمائة في سوق المدينة حيث حفرت أخاديد وقتلوا فيها بشكل مجموعات، وقد نجا مجموعة قليلة جداً بسبب وفائها للعهد ودخولها في الإسلام، وقسمت أموالهم وذراريهم على المسلمين.';
const String p13 =
    'وهذا جزاء عادل نزل بمن أراد الغدر وتبرأ من حلفه للمسلمين وكان جزائهم من جنس عملهم حين عرّضوا بخيانتهم أرواح المسلمين للقتل وأموالهم للنهب، ونساءهم وذراريهم للسبي، فكان أن عوقبوا بذلك جزاء وفاقاً.';
const String p14 =
    'ولم تقتل من نساء بني قريظة إلا واحدة ونترك السيدة عائشة رضي الله عنها تحدثنا عنها قالت السيدة عائشة: لم يقتل من نسائهم إلا إمرأة واحدة قالت: والله إنها لعندي تتحدث معي تضحك ظهر وبطناً، ورسول الله ﷺ يقتل رجالهم بالسوق، إذ هتف هاتف باسمها: أين فلانة؟ قالت: أنا والله، قالت: قلت: ويلك ومالك؟ قالت: أقتل: قلت: ولم؟ قالت: حدثاً أحدثته قالت: فانطلق بها، فضربت عنقها، وكانت عائشة رضي الله عنها تقول: والله ما أنسى عجبي من طيب نفسها، وكثرة ضحكها، وقد عرفت أنها تقتل.';
const String p15 =
    'وبالقضاء على بني قريظة خلت المدينة تماماً من الوجود اليهودي، وصارت خالصة للمسلمين، وخلت الجبهة الداخلية من عنصر خطر، لديه القدرة على المؤامرة والكيد والمكر، واضمحل حلم قريش لأنها كانت تعوِّل، وتؤمل في يهود بأن يكون لهم موقف ضد المسلمين، وابتعد خطر اليهود الذي كان يمد المنافقين بأسباب التحريض والقوة.';
