const int sectionIndex = 74;
const String sectionTitle = 'غزوة تبوك - توحيد جزيرة العرب';

const List t1 = ['1', 'العسرة'];
const List t2 = ['2', 'تأملات قرآنية'];
const List t3 = ['3', 'مشورة أبي بكر الصديق فى العطش'];
const List t4 = ['4', 'مشورة عمر بن الخطاب في ترك نحر الإبل'];
const List t5 = ['5', 'مشورة عمر في ترك اجتياز حدود الشام'];
const List t6 = ['6', 'التدريب العملي العنيف'];
const List t7 = ['7', 'إسقاط هيبة الروم'];
const List t8 = ['8', 'إظهار قوة الدولة الإسلامية'];
const List t9 = ['9', 'القبائل العربية الشامية'];
const List t10 = ['10', 'توحيد الجزيرة العربية تحت حكم الرسول'];

const String p1 =
    'إن الآيات التي أنزلها الله في كتابه المتعلقة بغزوة العسرة هي أطول مانزل في قتال بين المسلمين وخصومهم، وقد بدأت باستنهاض الهمم لرد هجوم المسيحية وإشعارهم، بأن الله لايقبل ذرة تفريط في حماية دينه ونصرة نبيه وإن التراجع أمام الصعوبات الحائلة دون قتال الروم يعتبر مزلقة إلى الردة والنفاق.';
const String p2 =
    'وعاتب القرآن الكريم من تخلف عتاباً شديداً وتميزت غزوة تبوك عن سائر الغزوات بأن الله حث على الخروج فيها وعاتب من تخلف عنها والآيات الكريمة جاءت بذلك كقوله تعالى: انْفِرُوا خِفَافًا وَثِقَالا وَجَاهِدُوا بِأَمْوَالِكُمْ وَأَنْفُسِكُمْ فِي سَبِيلِ اللَّهِ ذَلِكُمْ خَيْرٌ لَكُمْ إِنْ كُنْتُمْ تَعْلَمُونَ - سورة التوبة';
const String p3 =
    'وقد ختمت الغزوات النبوية بهذه الغزوة وقد كان تطبيقاً عملياً لوضع النص القرآني في قوله تعالى: يَاأَيُّهَا الَّذِينَ ءَامَنُوا قَاتِلُوا الَّذِينَ يَلُونَكُمْ مِنَ الْكُفَّارِ ، موضع التنفيذ وميز القرآن الكريم هذه الغزوة عن غيرها فسماها الله تعالى ساعة العسرة قال تعالى: لَقَدْ تَابَ اللَّهُ عَلَى النَّبِيِّ وَالْمُهَاجِرِينَ وَالأَنْصَارِ الَّذِينَ اتَّبَعُوهُ فِي سَاعَةِ الْعُسْرَةِ فقد كانت غزوة عسرة بمعنى الكلمة.';
const String p4 =
    'ومن معالم منهج القرآن في عرضه لهذه الغزوة العظيمة أن الله رد على المنافقين لمزهم فقراء الصحابة عندما جاء أحدهم بنصف صاع وتصدق به فقالوا: إن الله لغني عن صدقة هذا ومافعل هذا إلا رئاء، فنزلت الآية: الَّذِينَ يَلْمِزُونَ الْمُطَّوِّعِينَ مِنَ الْمُؤْمِنِينَ فِي الصَّدَقَاتِ وَالَّذِينَ لا يَجِدُونَ إِلا جُهْدَهُمْ فَيَسْخَرُونَ مِنْهُمْ سَخِرَ اللَّهُ مِنْهُمْ وَلَهُمْ عَذَابٌ أَلِيمٌ - سورة التوبة';
const String p5 =
    'قال عمر بن الخطاب: خرجنا إلى تبوك في قيظ شديد، فنزلنا منزلاً وأصابنا فيه عطش حتى ظننا أن رقابنا ستنقطع حتى إن الرجل لينحر بعيره فيعتصر فرثه فيشربه ثم يجعل مابقى على كبده، فقال أبو بكر الصديق: يارسول الله إن الله قد عوّدك في الدعاء خيراً فادع الله قال: أتحب ذلك؟ قال: نعم فرفع يديه فلم يردهما حتى حالت السماء فأظلت ثم سكبت فملؤوا مامعهم ثم ذهبنا ننظر فلم نجدها جاوزت العسكر.';
const String p6 =
    'أصابت جيش العسرة مجاعة أثناء سيرهم إلى تبوك فاستأذنوا النبي ﷺ في نحر إبلهم حتى يسدّوا جوعتهم فلما آذن لهم النبي ﷺ في ذلك جاءه عمر رضي الله عنه فأبدى مشورته في هذه المسألة وهي أن الجند إن فعلوا ذلك نفذت رواحلهم وهم أحوج مايكون إليها في هذا الطريق الطويل ثم ذكر رضي الله عنه حلاً لهذه المعضلة وهو: جمع أزواد القوم ثم الدعاء لهم بالبركة فيها فعمل ﷺ بهذه المشورة حتى صدر القوم عن بقية من هذا الطعام بعد أن ملؤوا أوعيتهم منه وأكلوا حتى شبعوا.';
const String p7 =
    'عندما وصل النبي ﷺ إلى منطقة تبوك وجد أن الروم فرّوا خوفاً من جيش المسلمين، فاستشار أصحابه في اجتياز حدود الشام فأشار عليه عمر بن الخطاب رضي الله عنه بأن يرجع بالجيش إلى المدينة، وعلّل رأيه بقوله: إن للروم جموعاً كثيرة وليس بها أحد من أهل الإسلام ولقد كانت مشورة مباركة فإن القتال داخل بلاد الرومان يعد أمراً صعباً، إذ أنه يتطلب تكتيكاً خاصاً لأن الحرب في الصحراء تختلف في طبيعتها عن الحرب في المدن، بالإضافة إلى أن عدد الرومان في الشام يقرب من مائتين وخمسين ألفاً ولاشك في أن تجمع هذا العدد الكبير في تحصنّه داخل المدن يعرّض جيش المسلمين للخطر.';
const String p8 =
    'كان خروج الرسول ﷺ بأصحابه إلى تبوك بأصحابه، فيه فوائد كثيرة منها تدريبهم تدريباً عنيفاً فقطع بهم ﷺ مسافة طويلة في ظروف جوّية صعبة حيث كانت حرارة الصيف اللاّهب، بالإضافة إلى الظروف المعيشية التي كانوا يعانون منها، فقد كان هناك قلة في الماء حتى كادوا يهلكون من شدة العطش، وأيضاً كان هناك قلة في الزاد والظهر ولاشك في أنّ هذه الأمور تعد تدريباً عنيفاً لايتحمله إلاّ الأقوياء من الرجال، وفي هذا الدرس يقول الأستاذ محمود شيت خطاب: تعمل الجيوش الحديثة على تدريب جنودها تدريباً عنيفاً كاجتياز مواقع وعراقيل صعبة جداً وقطع مسافات طويلة في ظروف جوية مختلفة وحرمان من الطعام والماء بعض الوقت وذلك لإعداد هؤلاء الجنود لتحمل أصعب المواقف المحتمل مصادفتها في الحرب، ولقد تحمل جيش العسرة مشقات لاتقل صعوبة عن مشقات هذا التدريب العنيف إن لم تكن أصعب منها بكثير، لقد تركوا المدينة في موسم نضج ثمارها وقطعوا مسافات طويلة شاقة في صحراء الجزيرة العربية صيفاً وتحملوا الجوع والعطش مدة طويلة.';
const String p9 =
    'إن غزوة تبوك تدريب عنيف للمسلمين، كان غرض الرسول ﷺ منه إعدادهم لتحمل رسالة حماية حرية نشر الإسلام خارج شبه الجزيرة العربية، فقد كانت هذه الغزوة آخر غزوات الرسول ﷺ ، فلابد من الاطمئنان إلى كفاءة جنوده قبل أن يلحق بالرفيق الأعلى، وقد ساعد هذا التدريب العملي الصحابة في عصر الخلفاء فقاموا بفتح بلاد الشام وبلاد الفرس بقوة إيمانهم وثقتهم بخالقهم وساعدهم على ذلك لياقتهم البدنية العالية ومعرفتهم العملية لاستخدام السيوف والرماح وأنواع الأسلحة في زمانهم.';
const String p10 =
    'سقطت هيبة الروم من نفوس العرب جميعاً مسلمهم وكافرهم على السواء، لأن قوة الروم كانت في حس العرب لاتقاوم ولاتُغْلب ومن ثم فقد فزعوا من ذكر الروم وغزوهم، ولعل الهزيمة التي لحقت بالمسلمين في غزوة مؤتة كانت مؤكدة على ماترسخ في ذهن العربي في جاهليته من أن الروم قوة لاتقهر، فكان لابد من هذا النفير العام لإزاحة هذه الهزيمة النفسية من نفوس العرب.';
const String p11 =
    'وقد ظهرت قوة الدولة الإسلامية كقوة وحيدة في المنطقة قادرة على تحدي القوى العظمى عالمياً -حينذاك- ليس بدافع عصبي أو عرقي أو تحقيق أطماع زعامات معاصرة، وإنما بدافع تحريري حيث تدعو الإنسانية إلى تحرير نفسها من عبودية العباد إلى عبودية رب العباد، ولقد حققت هذه الغزوة الغرض المرجو منها بالرغم من عدم الاشتباك الحربي مع الروم الذين آثروا الفرار شمالاً فحققوا انتصاراً للمسلمين دون قتال حيث أخلوا مواقعهم للدولة الإسلامية، وترتب على ذلك خضوع النصرانية التي كانت تمت بصلة الولاء لدولة الروم مثل إمارة دومة الجندل وإمارة إيلة مدينة العقبة حاليا على خليج العقبة، وكتب رسول الله ﷺ بينه وبينهم كتاباً يحدد مالهم وماعليهم.';
const String p12 =
    'وتوحدت القبائل العربية الشامية الأخرى التي لم تخضع للسيطرة الإسلامية في تبوك تتعرض بشدة للتاثير الإسلامي وبدأ الكثير من هذه القبائل يراجع موقفه ويقارن بين جدوى الاستمرار في الولاء للدولة البيزنطية أو تحويل هذا الولاء إلى الدولة الإسلامية الناشئة، ويعد ماحدث في تبوك نقطة البداية العملية للفتح الإسلامي لبلاد الشام وإن كانت هناك محاولات قبلها ولكنها لم تكن في قوة التأثير كغزوة تبوك فقد كانت هذه الغزوة بمثابة المؤشر لبداية عمليات متواصلة لفتح البلدان والتي واصلها خلفاء رسول الله ﷺ من بعده ومما يؤكد هذا أن الرسول ﷺ قبل موته جهّز جيشاً بقيادة أسامة بن زيد بن حارثة ليكون رأس حربه موجَّهة صوب الروم وطليعة لجيش الفتح ضم هذا الجيش جُلَّ صحابة رسول الله ولكنه لم يقم بمهمته إلا بعد وفاته ﷺ ، لقد وضع رسول الله ﷺ الأسس الأولى والخطوات المثلى لفتح بلاد الشام والفتوحات الإسلامية.';
const String p13 =
    'تأثر موقف القبائل العربية من الرسول ﷺ والدعوة الإسلامية بمؤثرات متداخلة كفتح مكة وخيبر وغزوة تبوك، فبادر كل قوم بإسلامهم بعد ما امتد سلطان المسلمين إلى خطوط التماس مع الروم ثم مصالحة نجران في الأطراف الجنوبية على أن يدفعوا الجزية، فلم يعد أمام القبائل العربية إلا المبادرة الشاملة إلى اعتناق الإسلام والالتحاق بركب النبوة بالسمع والطاعة، ونظراً لكثرة وفود القبائل العربية التي قدمت إلى المدينة من أنحاء الجزيرة العربية بعد عودة النبي ﷺ من غزوة تبوك لتعلن إسلامها هي ومن وراءها فقد سُمِّيَ العام التاسع للهجرة في المصادر الإسلامية بعام الوفود.';
const String p14 =
    'وبهذه الغزوة المباركة ينتهي الحديث عن غزوات النبي ﷺ التي قادها بنفسه، فقد كانت حياته المباركة غنية بالدروس والعبر التي تتربى عليها أمته في أجيالها المقبلة ومليئة بالدروس والعبر في تربية الأمة وإقامة الدولة التي تحكم شرع الله.';
