const int sectionIndex = 25;
const String sectionTitle = 'الهجرة - صراع الحق والباطل';

const List t1 = ['1', 'صراع الحق والباطل'];
const List t2 = ['2', 'أسماء بنت أبي بكر ولطم أبوجهل لخدها '];
const List t3 = ['3', 'فطنة أسماء رضى اللَّه عنها'];
const List t4 = ['4', 'الثناء على المهاجرين'];
const List t5 = ['5', 'الوعيد للمتخلفين عن الهجرة'];
const List t6 = ['6', 'احملوني فإني لست من المستضعفين'];

const String p1 =
    'الصراع بين الحق والباطل صراع قديم وممتد وهو سنّة إلهية نافذة، قال عزوجل: الَّذِينَ أُخْرِجُوا مِنْ دِيَارِهِمْ بِغَيْرِ حَقٍّ إِلاَّ أَنْ يَقُولُوا رَبُّنَا اللَّهُ وَلَوْلاَ دَفْعُ اللَّهِ النَّاسَ بَعْضَهُمْ بِبَعْضٍ لَهُدِّمَتْ صَوَامِعُ وَبِيَعٌ وَصَلَوَاتٌ وَمَسَاجِدُ يُذْكَرُ فِيهَا اسْمُ اللَّهِ كَثِيرًا وَلَيَنْصُرَنَّ اللَّهُ مَنْ يَنْصُرُهُ إِنَّ اللَّهَ لَقَوِيٌّ عَزِيزٌ - سورة الحج ولكن هذا الصراع معلوم العاقبة: كَتَبَ اللَّهُ لأَغْلِبَنَّ أَنَا وَرُسُلِي إِنَّ اللَّهَ قَوِيٌّ عَزِيزٌ - سورة المجادلة';
const String p2 =
    'مكر خصوم الدعوة بالداعية أمر مستمر متكرر سواء عن طريق الحبس أو القتل أو النفي والإخراج من الأرض، وعلى الداعية أن يلجأ الى ربه وأن يثق به ويتوكل عليه ويعلم أن المكر السيء لا يحيق إلا بأهله كما قال عز وجل: وَإِذْ يَمْكُرُ بِكَ الَّذِينَ كَفَرُوا لِيُثْبِتُوكَ أَوْ يَقْتُلُوكَ أَوْ يُخْرِجُوكَ وَيَمْكُرُونَ وَيَمْكُرُ اللَّهُ وَاللَّهُ خَيْرُ الْمَاكِرِينَ - سورة الانفال';
const String p3 =
    'ومن مكر أهل الباطل وخصوم الدعوة استخدام سلاح المال لإغراء النفوس الضعيفة للقضاء على الدعوة والدعاة ولذلك رصدوا مائة ناقة لمن يأتي بأحد المهاجرين حياً أو ميتاً، فتحرك الطامعون ومنهم سراقة الذي عاد بعد هذه المغامرة الخاسرة مادياً بأوفر ربح وأطيب رزق وهو رزق الإيمان وأخذ يعمِّي الطريق على الطامعين الآخرين الذين اجتهدوا في الطلب وهكذا يرد الله عن أوليائه والدعاة قال تعالى: إِنَّ الَّذِينَ كَفَرُوا يُنْفِقُونَ أَمْوَالَهُمْ لِيَصُدُّوا عَنْ سَبِيلِ اللَّهِ فَسَيُنْفِقُونَهَا ثُمَّ تَكُونُ عَلَيْهِمْ حَسْرَةً ثُمَّ يُغْلَبُونَ وَالَّذِينَ كَفَرُوا إِلَى جَهَنَّمَ يُحْشَرُونَ - سورة الأنفال';
const String p4 =
    ' ساهمت اسماء ذات النطاقين رضى اللَّه  عنها في تموين الرسول ﷺ وصاحبه في الغار بالماء والغذاء، وتحملت الأذى في سبيل الله، فقد حدثتنا عن ذلك فقالت: لما خرج رسول الله ﷺ وأبو بكر رضي الله عنه أتانا نفر من قريش فيهم أبوجهل بن هشام فوقفوا على باب أبي بكر فخرجت إليهم فقالوا: أين أبوك يابنت أبي بكر؟ قالت: قلت: لا أدري والله أين أبي؟ قالت: فرفع أبوجهل يده وكان فاحشاً خبيثاً فلطم خدِّي لطمة طرح منها قرطي قالت: ثم أنصرفوا..';
const String p5 =
    'فهذا درس من أسماء رضي الله عنها تعلمه لنساء المسلمين جيلاً بعد جيل كيف تخفي أسرار المسلمين عن الأعداء وكيف تقف صامدة شامخة أمام قوى البغي والظلم ';
const String p6 =
    'وعندما دخل عليها جدها أبو قحافة وقد ذهب بصره فقال: والله إني لأراه قد فجعكم بماله مع نفسه قالت: كلا يا أبتِ ضع يدك على هذا المال، قالت: فوضع يده عليه، فقال: لابأس، إذا كان ترك لكم هذا فقد أحسن وفي هذا بلاغ لكم ولا والله ماترك لنا شيئاً ولكني أردت أن أسكّن الشيخ بذلك.';
const String p7 =
    'وبهذه الفطنة والحكمة سترت أسماء أباها وسكنّت قلب جدها الضرير من غير أن تكذب، فإن أباها قد ترك لهم حقاً هذه الأحجار التي كوّمتها لتطمئن لها نفس الشيخ إلا أنه قد ترك لهم معها إيماناً بالله لاتزلزله الجبال، ولا تحركه العواصف الهوج ولا يتأثر بقلة أو كثرة في المال، وورثهم يقيناً وثقة به لاحد لها وغرس فيهم همة تتعلق بمعالي الأمور ولا تلتفت الى سفاسفها فضرب بهم للبيت المسلم مثالاً عزّ ان يتكرر وقلّ أن يوجد نظيره.';
const String p8 =
    'لقد ضربت أسماء رضي الله عنها بهذه المواقف لنساء وبنات المسلمين مثلاً هُنّ من أمس الحاجة الى الاقتداء به والنسج على منواله، وظلت أسماء مع إخواتها في مكة لا تشكو ضيقاً ولا تظهر حاجة حتى بعث النبي ﷺ زيد بن حارثة وابا رافع مولاه وأعطاهما بعيرين وخمسمائة درهم الى مكة فقدما عليه بفاطمة وأم كلثوم ابنتيه وسوده بنت زمعة زوجه وأسامة بن زيد وأمة بركة المكناة بأم أيمن، وخرج معهما عبدالله بن أبي بكر بعيال أبي بكر فيهم عائشة وأسماء فقدموا المدينة فأنزلهم في بيت حارثة بن النعمان.';
const String p9 =
    'اثنى الله سبحانه وتعالى على المهاجرين في القرآن الكريم وذلك لأنهم أخرجوا من ديارهم وأموالهم أكرههم على الخروج الأذى والاضطهاد والتنكر لهم من قرابتهم وعشيرتهم في مكة وما أخرجوا إلا أن يقولوا ربنا الله.';
const String p10 =
    'الصبر: قال تعالى: وَالَّذِينَ هَاجَرُوا فِي اللَّهِ مِنْ بَعْدِ مَا ظُلِمُوا لَنُبَوِّئَنَّهُمْ فِي الدُّنْيَا حَسَنَةً وَلأَجْرُ الآخِرَةِ أَكْبَرُ لَوْ كَانُوا يَعْلَمُونَ الَّذِينَ صَبَرُوا وَعَلَى رَبِّهِمْ يَتَوَكَّلُونَ - سورة النحل';
const String p11 =
    'الصدق: قال تعالى: لِلْفُقَرَاءِ الْمُهَاجِرِينَ الَّذِينَ أُخْرِجُوا مِنْ دِيارِهِمْ وَأَمْوَالِهِمْ يَبْتَغُونَ فَضْلاً مِنَ اللَّهِ وَرِضْوَانًا وَيَنْصُرُونَ اللَّهَ وَرَسُولَهُ أُولَئِكَ هُمُ الصَّادِقُونَ - سورة الحشر';
const String p12 =
    'الجهاد والتضحية: قال تعالى: الَّذِينَ ءَامَنُوا وَهَاجَرُوا وَجَاهَدُوا فِي سَبِيلِ اللَّهِ بِأَمْوَالِهِمْ وَأَنْفُسِهِمْ أَعْظَمُ دَرَجَةً عِنْدَ اللَّهِ وَأُولَئِكَ هُمُ الْفَائِزُونَ - سورة التوبة';
const String p13 =
    'حق السبق في الإيمان والعمل: قال تعالى: وَالسَّابِقُونَ الأَوَّلُونَ مِنَ الْمُهَاجِرِينَ وَالأَنْصَارِ وَالَّذِينَ اتَّبَعُوهُمْ بِإِحْسَانٍ رَضِيَ اللَّهُ عَنْهُمْ وَرَضُوا عَنْهُ وَأَعَدَّ لَهُمْ جَنَّاتٍ تَجْرِي تَحْتَهَا الأَنْهَارُ خَالِدِينَ فِيهَا أَبَدًا ذَلِكَ الْفَوْزُ الْعَظِيمُ - سورة التوبة';

const String p14 =
    'سعة رزق الله لهم في الدنيا: قال تعالى: وَمَنْ يُهَاجِرْ فِي سَبِيلِ اللَّهِ يَجِدْ فِي الأَرْضِ مُرَاغَمًا كَثِيرًا وَسَعَةً وَمَنْ يَخْرُجْ مِنْ بَيْتِهِ مُهَاجِرًا إِلَى اللَّهِ وَرَسُولِهِ ثُمَّ يُدْرِكْهُ الْمَوْتُ فَقَدْ وَقَعَ أَجْرُهُ عَلَى اللَّهِ وَكَانَ اللَّهُ غَفُورًا رَحِيمًا - سورة النساء';
const String p15 =
    'تكفير سيئاتهم ومغفرة ذنوبهم: قال تعالى: فَاسْتَجَابَ لَهُمْ رَبُّهُمْ أَنِّي لاَ أُضِيعُ عَمَلَ عَامِلٍ مِنْكُمْ مِنْ ذَكَرٍ أَوْ أُنْثَى بَعْضُكُمْ مِنْ بَعْضٍ فَالَّذِينَ هَاجَرُوا وَأُخْرِجُوا مِنْ دِيَارِهِمْ وَأُوذُوا فِي سَبِيلِي وَقَاتَلُوا وَقُتِلُوا لأُكَفِّرَنَّ عَنْهُمْ سَيِّئَاتِهِمْ وَلأُدْخِلَنَّهُمْ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الأَنْهَارُ ثَوَابًا مِنْ عِنْدِ اللَّهِ وَاللَّهُ عِنْدَهُ حُسْنُ الثَّوَابِ - سورة آل عمران';
const String p16 =
    'إن الأسلوب القرآني في الوعد والوعيد يهدف إلى الخشية والرجاء في النفوس، رجاء يدفعها إلى الطاعة والاستقامة وخشية تمنعها من المعصية وتسرع بها إلى الاستغفار والتوبة والمؤمن بينهما في معادلة جد دقيقة لئلا يقع فريسة لليأس والقنوط ولايندفع إلى الجراءة على محارم الله أو التهاون فيما أمر الله ولقد استطاع القرآن الكريم بسلاحيه هذين أن يحفظ للفرد شخصيته وللمجتمع مقوماته في الحياة والمال والعقل والعرض والدين وهي كليات تقوم عليها الحياة الرشيدة الفاضلة، ولقد رأت الحياة النور في أجيال عديدة أنارها القرآن بالوعد والرجاء وبالوعيد والخشية ولما خفت ذلك النور ببعد الناس عن القرآن اصطدم الفرد بفطرته والمجتمع بواقعه فاضطربت القيم وانهارت الأخلاق وفسدت المعاملات والمناهج والتصورات، ولن يصلح آخر هذه الأمة إلا بما صلح به أولها وأن تخشى الله لاتخشى سواه وأن ترجوه لاترجو إلا إياه.';
const String p17 =
    'وعن ابن عباس رضي الله عنه قال: كان قوم من أهل مكة أسلموا وكانوا يستخفون بالإسلام فأخرجهم المشركون يوم بدر معهم فأصيب بعضهم، فقال المسلمون عنهم  قال تعالى: إِنَّ الَّذِينَ تَوَفَّاهُمُ الْمَلاَئِكَةُ ظَالِمِي أَنْفُسِهِمْ قَالُوا فِيمَ كُنْتُمْ قَالُوا كُنَّا مُسْتَضْعَفِينَ فِي الأَرْضِ قَالُوا أَلَمْ تَكُنْ أَرْضُ اللَّهِ وَاسِعَةً فَتُهَاجِرُوا فِيهَا فَأُولَئِكَ مَأْوَاهُمْ جَهَنَّمُ وَسَاءَتْ مَصِيرًا - سورة النساء';
const String p18 =
    'ومنهم من خرجوا فلحقهم المشركون فأعطوهم الفتنة فنزلت فيهم: وَمِنَ النَّاسِ مَنْ يَقُولُ ءَامَنَّا بِاللَّهِ فَإِذَا أُوذِيَ فِي اللَّهِ جَعَلَ فِتْنَةَ النَّاسِ كَعَذَابِ اللَّهِ وَلَئِنْ جَاءَ نَصْرٌ مِنْ رَبِّكَ لَيَقُولُنَّ إِنَّا كُنَّا مَعَكُمْ أَوَلَيْسَ اللَّهُ بِأَعْلَمَ بِمَا فِي صُدُورِ الْعَالَمِينَ - سورة العنكبوت ، فكتب إليهم المسلمون بذلك فخرجوا وأيسوا من كل خير ثم نزلت فيهم: ثُمَّ إِنَّ رَبَّكَ لِلَّذِينَ هَاجَرُوا مِنْ بَعْدِ مَا فُتِنُوا ثُمَّ جَاهَدُوا وَصَبَرُوا إِنَّ رَبَّكَ مِنْ بَعْدِهَا لَغَفُورٌ رَحِيمٌ - سورة النحل';
const String p19 =
    'وهذا ضمرة بن جندب لما بلغه قوله تعالى: إِنَّ الَّذِينَ تَوَفَّاهُمُ الْمَلاَئِكَةُ ظَالِمِي أَنْفُسِهِمْ، وهو بمكة قال لبنيه: احملوني فإني لست من المستضعفين وإني لأهتدي الطريق وإني لا أبيت الليلة بمكة، فحملوه على سرير متوجهاً إلى المدينة وكان شيخاً كبيراً فمات بالتنعيم، ولما أدركه الموت أخذ يصفق بيمينه على شماله ويقول: اللهم هذه لك وهذه لرسولك ﷺ ، أبايعك على مابايع عليه رسولك ولما بلغ خبر موته الصحابة رضي الله عنهم قالوا: ليته مات بالمدينة فنزل قوله تعالى: إِلاَّ الْمُسْتَضْعَفِينَ مِنَ الرِّجَالِ وَالنِّسَاءِ وَالْوِلْدَانِ لاَ يَسْتَطِيعُونَ حِيلَةً وَلاَ يَهْتَدُونَ سَبِيلاً صدق الله العظيم فَأُولَئِكَ عَسَى اللَّهُ أَنْ يَعْفُوَ عَنْهُمْ وَكَانَ اللَّهُ عَفُوًّا غَفُورًا - سورة النساء';
const String p20 =
    'وهذا الموقف يرينا ماكان عليه جيل الصحابة من سرعة في امتثال الأمر وتنفيذه في النشاط والشدة كائنة ماكانت ظروفهم، فلا يلتمسون لأنفسهم المعاذير ولايطلبون الرخص.';
const String p21 =
    'وبعد أن ذكر الله عزوجل وعيده للمتخلفين عن الهجرة بسوء مصيرهم، استثنى في ذلك من لاحيلة لهم في البقاء في دار الكفر والتعرض للفتنة في الدين والحرمان من الحياة في دار الإسلام من الشيوخ والضعاف والنساء والأطفال فيعلقهم بالرجاء في عفو الله ومغفرته ورحمته بسبب عذرهم البين وعجزهم عن الفرار قال تعالى: إِلاَّ الْمُسْتَضْعَفِينَ مِنَ الرِّجَالِ وَالنِّسَاءِ وَالْوِلْدَانِ لاَ يَسْتَطِيعُونَ حِيلَةً وَلاَ يَهْتَدُونَ سَبِيلاً صدق الله العظيم فَأُولَئِكَ عَسَى اللَّهُ أَنْ يَعْفُوَ عَنْهُمْ وَكَانَ اللَّهُ عَفُوًّا غَفُورًا - سورة النساء';
const String p22 =
    'وبهذا قد تمت هجرته ﷺ وهجرة أصحابه رضي الله عنهم ولم تنته الهجرة بأهدافها وغاياتها بل بدأت بعد وصول رسول الله ﷺ سالماً الى المدينة وبدأت معها رحلة المتاعب والمصاعب والتحديات، فتغلب عليها رسول الله ﷺ للوصول للمستقبل الباهر للأمة والدولة الاسلامية التي استطاعت أن تصنع حضارة إنسانية رائعة على أسس من الإيمان والتقوى والإحسان والعدل بعد أن تغلبت على اقوى دولتين كنتا تحكمان في العالم وهما الفرس و الروم.';
