const int sectionIndex = 15;
const String sectionTitle = 'محاربة الدعوة وإيذاء النبى ﷺ';

const List t1 = ['1', 'محاولات إبعاد أبي طالب عن النبى'];
const List t2 = ['2', 'مروءة أبي طالب'];
const List t3 = ['3', 'ذرنِي وَمن خَلقتُ وَحِيدًا'];
const List t4 = ['4', 'إسلام ضماد الأزدي رضي الله عنه'];
const List t5 = ['5', 'الأذى والتعذيب'];
const List t6 = ['6', 'أبو بكر وإِعْتاق المستضعفين'];
const List t7 = ['7', 'فأما من أعطى واتقى'];
const List t8 = ['8', 'قمم الخير والعطاء'];

const String p1 =
    'اجمع المشركون على محاربة الدعوة التي عرت واقعهم الجاهلي وعابت آلهتهم وسفهت أحلامهم وتصوراتهم عن الله والحياة والإنسان والكون فاتخذوا العديد من الوسائل والمحاولات لإيقاف الدعوة وإسكات صوتها أو تحجيمها وتحديد مجال انتشارها.';
const String p2 =
    'فقد جاءت قريش الى أبي طالب فقالوا: إن ابن أخيك هذا قد آذانا في نادينا ومسجدنا فانهه عنا، فقال أبوطالب لرسول الله ﷺ : أن بني عمك هؤلاء زعموا أنك تؤذيهم في ناديهم ومسجدهم فانته عن أذاهم، فحلق رسول الله ﷺ ببصره الى السماء فقال: ترون هذه الشمس، قالوا: نعم قال: فما أنا بأقدر أن أدع ذلك منكم على أن تشعلوا منها بشعلة فقال أبو طالب: والله ماكذب ابن أخي قط فأرجعوا راشدين.';
const String p3 =
    'اشتد امر الحماية على قريش غماً وحسداً ومكراً فمشوا إليه بعمارة بن الوليد بن المغيرة فقالوا له: يا أبا طالب هذا عمارة بن الوليد أنهد فتى في قريش وأجمله فلك عقله ونصره واتخذه ولداً فهو لك وأسلم إلينا ابن أخيك هذا الذي خالف دينك ودين آبائك وفرّق جماعة قومك وسفه أحلامنا فنقتله فأنما هو رجل برجل قال: والله لبئس ماتسومونني أتعطونني أبنكم أغذوه لكم؟ واعطيكم ابني فتقتلونه هذا والله ما لا يكون أبداً.';
const String p4 =
    'وإن المرء ليسمع عجباً ويقف مذهولاً أمام مروءة أبي طالب مع رسول الله ﷺ ، فقد ربط أبوطالب مصيره بمصير ابن أخيه محمد ﷺ ، بل واستفاد من كونه زعيم بني هاشم أن ضم بني هاشم وبني المطلب إليه في حلف واحد على الحياة والموت تأييداً لرسول الله ﷺ مسلمهم ومشركهم على السواء وأجار ابن أخيه محمد إجارة مفتوحة لاتقبل التردد أو الإحجام، كانت هذه الأعراف الجاهلية والتقاليد العربية تسخر من قبل النبي ﷺ لخدمت الإسلام، وقد قام ابو طالب حين رأى قريشاً تصنع ماتصنع في بني هاشم وبني المطلب فدعاهم الى ما هو عليه من منع رسول الله ﷺ والقيام دونه فاجتمعوا إليه وقاموا معه وأجابوه الى مادعاهم إليه إلا ماكان من أبي لهب عدو الله اللعين.';
const String p5 =
    'إنها ظاهرة فذة أن تقوم الجاهلية بحماية من يسب آلهته ويعيب دينها ويسفه أحلامها وباسم هذه القيم يقدمون المهج والأرواح ويخوضون المعارك والحروب ولا يمس محمد بسوء.';
const String p6 =
    'قام مشركوا مكة بتشويه دعوة الرسول ﷺ ولذلك نظمت قريش حرب أعلامية ضده لتشويهه قادها الوليد بن المغيرة حيث اجتمع مع نفر من قومه، وكان ذا سن فيهم، وقد حضر موسم الحج فقال لهم: يامعشر قريش! إنه قد حضر الموسم وإن وفود العرب ستقدم عليكم، وقد سمعوا بأمر صاحبكم هذا فأجمعوا فيه رأياً واحداً ولا تختلفون فيكذب بعضكم بعضاً ويرد قول بعضكم بعضاً.';
const String p7 =
    'فقالوا: فأنت يا أبا عبد شمس فقل وأقم لنا رأياً نقول به قال: بل أنتم قولوا أسمع، فقالوا: نقول كاهن فقال: ماهو بكاهن لقد رأيت الكهان فما هو بزمزمة الكاهن وسجعه';
const String p8 =
    'فقالوا: نقول مجنون فقال: ماهو بمجنون لقد راينا الجنون وعرفناه فماهو تخنقه ولا تخالجه ولا وسوسته';
const String p9 =
    'فقالوا: نقول شاعر فقال: ماهو بشاعر قد عرفنا الشعر برجزه وقريضة ومقبوضه ومبسوطه، فما هو بالشعر';
const String p10 =
    'قالوا: فنقول ساحر قال: ماهو بساحر لقد رأينا السحّار وسحرهم، فماهو بنفثه ولاعقده ، قالوا: فما نقول يا أبا عبد شمس؟ قال: والله إن لقوله لحلاوة وإن أصله لعذق، وإن فرعه لجناة وما أنتم بقائلين من هذا شيئاً إلا عرف أنه باطل، وإن أقرب القول لأن تقولوا: ساحر فقولوا: ساحر يفرق بين المرء وبين أبيه وبين المرء وأخيه وبين المرء وزوجه وبين المرء وعشيرته.';
const String p11 =
    'فأنزل الله تعالى في الوليد: ذَرْنِي وَمَنْ خَلَقْتُ وَحِيدًا وَجَعَلْتُ لَهُ مَالاً مَمْدُودًا وَبَنِينَ شُهُودًا وَمَهَّدْتُ لَهُ تَمْهِيدًا، ثُمَّ يَطْمَعُ أَنْ أَزِيدَ كَلاَّ إِنَّهُ كَانَ لآيَاتِنَا عَنِيدًا سَأُرْهِقُهُ صَعُودً إِنَّهُ فَكَّرَ وَقَدَّرَ فَقُتِلَ كَيْفَ قَدَّرَ ثُمَّ قُتِلَ كَيْفَ قَدَّرَ ثُمَّ نَظَرَ ثُمَّ عَبَسَ وَبَسَرَ ثُمَّ أَدْبَرَ وَاسْتَكْبَرَ فَقَالَ إِنْ هَذَا إِلاَّ سِحْرٌ يُؤْثَرُ إِنْ هَذَا إِلاَّ قَوْلُ الْبَشَرِ سَأُصْلِيهِ سَقَرَ';
const String p12 =
    'جاء ضماد الأزدي الى مكة وتأثر بدعاوي المشركين عن رسول الله ﷺ حتى استقر في نفسه أنه مصاب بالجنون كما يتهمه بذلك زعماء مكة وكان ضماد من أزد شنوءه وكان يعالج من الجنون، فلما سمع سفهاء مكة يقولون إن محمداً ﷺ مجنون.';
const String p13 = 'فقال: لو أني رأيت هذا الرجل لعل الله يشفيه على يدي';
const String p14 =
    'قال: فلقيه، فقال: يامحمد إني أرقي من هذاه الريح وإن الله يشفي على يدي من شاء فهل لك؟ فقال رسول الله ﷺ : إن الحمد لله نحمده ونستعينه من يهده الله فلا مضل له ومن يضلل فلا هادي له وأشهد أن لا إله إلا الله وحده لا شريك له وأن محمداً عبده ورسوله، أما بعد';
const String p15 =
    'فقال: أعد علي كلماتك هؤلاء، فأعدهن عليه رسول الله ﷺ ثلاث مرات، قال فقال: لقد سمعت قول الكهنة وقول السحرة وقول الشعراء فما سمعت مثل كلماتك هؤلاء ولقد بلغنِ قاموس البحر فقال لرسول الله ﷺ : هات يدك أبايعك على الاسلام قال: فبايعه، فقال رسول الله ﷺ : وعلى قومك قال: وعلى قومي.';
const String p16 =
    'وعندما قامت دولة الاسلام في المدينة، وكانت سرايا رسول الله تبعث، فمروا على قوم ضماد فقال صاحب السرية للجيش: هل أصبتم من هؤلاء شيئاً؟ فقال رجل من القوم: أصبت منهم مطهرة فقال: ردوها فإن هؤلاء قوم ضماد.';
const String p17 =
    'قال عبدالله بن مسعود رضي الله عنه : أول من أظهر الاسلام سبعة، رسول الله ﷺ وابوبكر وعمار وأمه سمية وصهيب وبلال والمقداد فأما رسول الله ﷺ فمنعه الله بعمه ابي طالب، وأما أبو بكر فمنعه الله بقومه، وأما سائرهم فأخذهم المشركون فألبسوهم أدرع الحديد وصهروهم في الشمس فما منهم إنسان إلا وقد واتاهم على ما ارادوا إلا بلال فإنه هانت عليه نفسه في الله وهان على قومه فأعطوه الولدان وأخذوا يطوفون به شعاب مكة وهو يقول: أحدٌ أحد.';
const String p18 =
    'لم يكن لبلال رضي الله عنه ظهر يسنده ولا عشيرة تحميه ولا سيوف تذود عنه، ومثل هذا الانسان في المجتمع الجاهلي المكي يعادل رقماً من الأرقام فليس له دور في الحياة إلا أن يخدم ويطيع ويباع ويشترى كالسائمة، أما أن يكون له رأي أو يكون صاحب فكر أو صاحب دعوة أو صاحب قضية فهذه جريمة شنعاء في المجتمع الجاهلي المكي تهز أركانه وتزلزل أقدامه، ولكن الدعوة الجديدة التي سارع لها الفتيان وهم يتحدون تقاليد وأعراف آبائهم الكبار لامست قلب هذا العبد المرمي المنسي فأخرجته إنساناً جديداً على الوجود، فقد تفجرت معاني الإيمان في إعماقه بعد أن آمن بهذا الدين وانضم الى محمد ﷺ وإخوانه في موكب الايمان العظيم.';
const String p19 =
    'وها هو بلال يتعرض للتعذيب من أجل عقيدته ودينه فقصد وزير رسول الله ﷺ أبو بكر الصديق وفاوض أمية بن خلف وقال له: ألا تتقي الله في هذا المسكين؟ حتى متى قال: أنت الذي أفسدته فأنقذه مما ترى فقال أبو بكر: أفعل، عندي غلام أسود أجلد منه وأقوى على دينك أعطيكه به قال: قد قبلت فقال: هو لك فأعطاه ابوبكر الصديق رضي الله عنه غلامه ذلك وأخذه فأعتقه، وفي رواية اشتراه.';
const String p20 =
    'وكذلك عامر بن فهيرة الذى شهد بدراً وأحداً وقتل يوم بئر معونة شهيداً وأم عبيس وزنِّيرة وأصيب بصرها حين أعتقها فقالت قريش: ما أذهب بصرها إلا اللات والعزى فقالت: كذبوا وبيت الله ماتضر اللات والعزى وماتنفعان، فرد الله بصرها.';
const String p21 =
    'وأعتق النهدية وبنتها وكانتا لامرأة من بني عبدالدار مرّ بهما، وقد بعثتهما سيدتهما بطحين لها وهي تقول: والله لا أعتقكما أبداً: فقال ابو بكر رضي الله عنه حِلُّ ياأم فلان، فقالت: حل أنت أفسدتهما فأعتقهما قال: فبكم هما؟ قالت : بكذا وكذا، قال: قد أخذتهما وهما حرتان أليها طيحنها قالتا: أو نفرغ منه يا أبا بكر ثم نرده إليها؟ قال: وذلك إن شئتما.';
const String p22 =
    'كان المجتمع المكي يتندر بأبي بكر رضي الله عنه الذي يبذل هذا المال كله لهؤلاء المستضعفين، ولم يكن الصديق يقصد بعمله هذا محمدة ولا جاهاً ولا دنيا، وإنما كان يريد وجه الله ذا الجلال والإكرام.';
const String p23 =
    'لقد قال له أبوه ذات يوم: يابني إنى اراك تعتق رقاباً ضعافاً، فلو أنك إذ فعلت أعتقت رجالاً جلد يمنعونك ويقومون دونك؟ فقال أبوبكر رضي الله عنه : يا أبتِ إني إنما أريد ما أريد لله عز وجل، فلا عجب إذا كان الله سبحانه أنزل في شأن الصديق قرآناً يتلى الى يوم الدين قال تعالى: فَأَمَّا مَنْ أَعْطَى وَاتَّقَى وَصَدَّقَ بِالْحُسْنَى فَسَنُيَسِّرُهُ لِلْيُسْرَى وَأَمَّا مَنْ بَخِلَ وَاسْتَغْنَى وَكَذَّبَ بِالْحُسْنَى فَسَنُيَسِّرُهُ لِلْعُسْرَى وَمَا يُغْنِي عَنْهُ مَالُهُ إِذَا تَرَدَّى إِنَّ عَلَيْنَا لَلْهُدَى وَإِنَّ لَنَا لَلآخِرَةَ وَالأُولَى - سورة الليل';
const String p24 =
    'كان هذا التكافل بين أفراد الجماعة الاسلامية الأولى قمة من قمم الخير والعطاء ولقد فشلت محاولات التشويه والحرب الإعلامية، الذي كان الكفار يمارسونه على الدعوة الاسلامية في بداية عهدها، لأن صوت رسول الله ﷺ كان أقوى من أصواتهم، ووسائله في التبليغ كانت أبلغ من وسائلهم، وثباته على مبدئه السامي كان أعلى بكثير مما كان يتوقعه أعداؤه، فالرسول ﷺ لم يجلس في بيته ولم ينزو في زاوية من زوايا المسجد الحرام ليستخفي بدعوته وليقي نفسه من سهام أعدائه المسمومة بل إنه غامر بنفسه فكان يخرج في مضارب العرب قبل أن يفدوا الى مكة، وكان يجهر بتلاوة القرآن في المسجد الحرام ليسمع من كان في قلبه بقية من حياة وأثارة من حرية وإباء فيتسرب نور الهدى الى مجامع لبه وسويداء قلبه، وكان من هؤلاء ضماد الأزدي وعمرو بن عبسة وأبي ذر الغفاري والطفيل بن عمرو الدوسي وحصين والدعمران بن الحصين رضي الله عنهم وهذا دليل قاطع وبرهان ساطع على فشل حملات التشويه التي شنتها قريش ضد رسول الله ﷺ .';
