const int sectionIndex = 57;
const String sectionTitle = 'صلح الحديبية - الفتح المبين';

const List t1 = ['1', 'سورة أحب إليَّ مما طلعت عليه الشمس'];
const List t2 = ['2', 'لِيزدَادُوا إِيمَانًا مَع إِيمَانهِم'];
const List t3 = ['3', 'التكريم والوعد العظيم'];
const List t4 = ['4', 'نتائج الصلح'];
const List t5 = ['5', 'قصة أبو بصير - سيجعل الله فرجاً '];
const List t6 = ['6', 'فرار المستضعفون بمكة لسيف البحر'];
const List t7 = ['7', 'امتناع النبي ﷺ عن رد المهاجرات'];
const List t8 = ['8', 'أحكام فقهية - حكم القيام على رأس الكبير وهو جالس'];
const List t9 = ['9', 'أحكام فقهية - هل يجوز التبرك بفضلات الصالحين وآثارهم'];
const List t10 = ['10', 'أحكام فقهية - الفدية'];
const List t11 = ['11', 'أحكام فقهية - مشروعية الصلاة في الرحال'];
const List t12 = ['12', 'أحكام فقهية - نوم المسلمين عن صلاة الصبح'];
const List t13 = ['13', 'أحكام فقهية - مشروعية الهدنة بين المسلمين وأعدائهم '];
const List t14 = ['14', 'أحكام فقهية - المطلق يجري على اطلاقه'];
const List t15 = ['15', 'أحكام فقهية - وجوب طاعته ﷺ وإن خالف الظاهر ذلك'];
const List t16 = ['16', 'من التربية النبوية - صعود الثنية'];

const String p1 =
    'انصرف رسول الله ﷺ من الحديبية قاصداً المدينة حتى إذا كان بين مكة والمدينة نزلت سورة الفتح، قال تعالى: سَيَقُولُ لَكَ الْمُخَلَّفُونَ مِنَ الأَعْرَابِ شَغَلَتْنَا أَمْوَالُنَا وَأَهْلُونَا فَاسْتَغْفِرْ لَنَا يَقُولُونَ بِأَلْسِنَتِهِمْ مَا لَيْسَ فِي قُلُوبِهِمْ قُلْ فَمَنْ يَمْلِكُ لَكُمْ مِنَ اللَّهِ شَيْئًا إِنْ أَرَادَ بِكُمْ ضَرًّا أَوْ أَرَادَ بِكُمْ نَفْعًا بَلْ كَانَ اللَّهُ بِمَا تَعْمَلُونَ خَبِيرًا - سورة الفتح';
const String p2 =
    'وقد عبَّر رسول الله ﷺ عن عظيم فرحته بنزولها وقال: أنزلت عليَّ الليلة سورة لهي أحب إليَّ مما طلعت عليه الشمس، فقال أصحاب رسول الله: هنيئاً مريئاً فمالنا؟ فأنزل الله: لِيُدْخِلَ الْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الأَنْهَارُ خَالِدِينَ فِيهَا وَيُكَفِّرَ عَنْهُمْ سَيِّئَاتِهِمْ وَكَانَ ذَلِكَ عِنْدَ اللَّهِ فَوْزًا عَظِيمًا - سورة الفتح';
const String p3 =
    'وقد أسرع الناس إلى رسول الله ﷺ وهو واقف على راحلته بكراع الغميم فقرأ عليهم: إِنَّا فَتَحْنَا لَكَ فَتْحًا مُبِينًا فقال رجل: يارسول الله: أفتح هو؟ قال: نعم والذي نفسي بيده إنه لفتح، فانقلبت كآبة المسلمين وحزنهم إلى فرح غامر، وأدركوا أنهم لايمكن أن يحيطوا بالأسباب والنتائج، وأن التسليم لأمر الله ورسوله فيه كل الخير لهم ولدعوة الإسلام.';
const String p4 =
    'ينزل القرآن الكريم ويبين للمسلمين بأن هذا الصلح هو فتح مبين ويؤكد أن النبي ﷺ كان على صواب في قبول الصلح، بل لتزداد ثقة المؤمنين برسول الله ﷺ حين يبشره الله على الملأ من الدنيا بأن الله تعالى فتح بالصلح ليغفر له ماتقدم من ذنبه وما تأخر كرامة منه سبحانه لرسوله ليزداد المسلمون ثقة واطمئناناً بأنهم على الصواب وأن مافعلوه هو الحق ومآله السعادة، ثم بين سبحانه أن توفيق الله كان مع المؤمنين فهو الذي وفقهم للصبر مع رسوله وموافقتهم أخيراً على ماجنح له من أمر الصلح، وأن ذلك كان بسبب إنزال السكينة على قلوبهم حتى على قلوب من أنكر بعض شروط الصلح، واستسلم للأمر على مضض فلم يحصل رفض لهذا الصلح، بل كلهم نزلوا على أمر رسوله ﷺ بفضل السكينة التي أنزلها عليهم قال تعالى: هُوَ الَّذِي أَنْزَلَ السَّكِينَةَ فِي قُلُوبِ الْمُؤْمِنِينَ لِيَزْدَادُوا إِيمَانًا مَعَ إِيمَانِهِمْ وَلِلَّهِ جُنُودُ السَّمَوَاتِ وَالأَرْضِ وَكَانَ اللَّهُ عَلِيمًا حَكِيمًا - سورة الفتح';
const String p5 =
    'فالقرآن الكريم يبين أن الله هو الذي أنزل السكينة عليهم ليتذكروا فضله، ويداوموا على شكره، وهذا الإعلام بإنزال السكينة مما يتميز به حديث القرآن الكريم عن هذه الغزوة إذ السكينة أمر معنوي لايعلم نزوله إلا الله، وأشار القرآن الكريم إلى بيعة الرضوان وهي مبايعة الصحابة للنبي على الموت فأثنى الله سبحانه وتعالى على هذه البيعة، وكتب لها الخلود في القرآن وقرر أنها مبايعة لله عزوجل فقال تعالى: إِنَّ الَّذِينَ يُبَايِعُونَكَ إِنَّمَا يُبَايِعُونَ اللَّهَ يَدُ اللَّهِ فَوْقَ أَيْدِيهِمْ فَمَنْ نَكَثَ فَإِنَّمَا يَنْكُثُ عَلَى نَفْسِهِ وَمَنْ أَوْفَى بِمَا عَاهَدَ عَلَيْهُ اللَّهَ فَسَيُؤْتِيهِ أَجْرًا عَظِيمًا - سورة الفتح.';
const String p6 =
    'قال تعالى: هُوَ الَّذِي أَرْسَلَ رَسُولَهُ بِالْهُدَى وَدِينِ الْحَقِّ لِيُظْهِرَهُ عَلَى الدِّينِ كُلِّهِ وَكَفَى بِاللَّهِ شَهِيدًا مُحَمَّدٌ رَسُولُ اللَّهِ وَالَّذِينَ مَعَهُ أَشِدَّاءُ عَلَى الْكُفَّارِ رُحَمَاءُ بَيْنَهُمْ تَرَاهُمْ رُكَّعًا سُجَّدًا يَبْتَغُونَ فَضْلا مِنَ اللَّهِ وَرِضْوَانًا سِيمَاهُمْ فِي وُجُوهِهِمْ مِنْ أَثَرِ السُّجُودِ ذَلِكَ مَثَلُهُمْ فِي التَّوْرَاةِ وَمَثَلُهُمْ فِي الإِنْجِيلِ كَزَرْعٍ أَخْرَجَ شَطْأَهُ فَآزَرَهُ فَاسْتَغْلَظَ فَاسْتَوَى عَلَى سُوقِهِ يُعْجِبُ الزُّرَّاعَ لِيَغِيظَ بِهِمُ الْكُفَّارَ وَعَدَ اللَّهُ الَّذِينَ ءَامَنُوا وَعَمِلُوا الصَّالِحَاتِ مِنْهُمْ مَغْفِرَةً وَأَجْرًا عَظِيمًا - سورة الفتح';
const String p7 =
    'واستشرف وجود هؤلاء الرجال السعداء وقلوبهم وهم يتلقون هذا الفيض الإلهي من الرضى والتكريم والوعد العظيم، وهم يرون أنفسهم هكذا في اعتبار الله وفي ميزان الله، وانظر إليهم وهم عائدون من الحديبية وقد نزلت هذه السورة وقد قرئت عليهم، وهم يعيشون فيها بأرواحهم وقلوبهم ومشاعرهم وسماتهم، وينظر بعضهم في وجوه بعض فيرى أثر النعمة التي يحسها وهو في كيانه لقد أيقن الصحابة الكرام أن الدعوة قد دخلت في طور جديد وفتح أكيد وآفاق أوسع وامتداد أرحب، وأن من طبيعة هذا الدين أن ينموا وينتعش في أجواء السلم والأمن أكثر منه وقت الحرب ولمسوا مع الأيام نتائج صلح الحديبية';
const String p8 =
    'اعترفت قريش في هذه المعاهدة بكيان الدولة المسلمة، فالمعاهدة دائماً لاتكون إلا بين ندين.';
const String p9 =
    'دخلت المهابة في قلوب المشركين والمنافقين وتيقن الكثير منهم بغلبة الإسلام وقد تجلت بعض مظاهر ذلك في مبادرة كثير من صناديد قريش إلى الإسلام مثل خالد بن الوليد وعمرو بن العاص';
const String p10 =
    'أعطت الهدنة فرصة لنشر الإسلام وتعريف الناس به مما أدى إلى دخول كثير من القبائل فيه.';
const String p11 =
    'أمن المسلمون جانب قريش فحولوا ثقلهم على اليهود ومن كان يناوئهم من القبائل الأخرى، فكانت غزوة خيبر بعد صلح الحديبية.';
const String p12 =
    'ساعد صلح الحديبية النبي ﷺ على إرسال رسائل إلى ملوك الفرس والروم والقبط يدعوهم إلى الإسلام.';
const String p13 =
    'في أعقاب صلح الحديبية مباشرة استطاع أبو بصير عتبة بن أسيد أن يفر بدينه من سجون الشرك في مكة المكرمة، وأن يلتحق برسول الله ﷺ في المدينة، فبعث قريش في إثره اثنين من رجالها إلى رسول الله، ليرجعا به، تنفيذاً لشرط المعاهدة، فقال رسول الله ﷺ لأبي بصير: يا أبا بصير، إنا قد أعطينا هؤلاء القوم ماقد علمت ولايصلح لنا في ديننا الغدر، وإن الله جاعل لك ولمن معك من المستضعفين فرجاً ومخرجاً، فانطلق إلى قومك، فقال أبو بصير: يارسول الله، أتردني إلى المشركين يفتنوني في ديني؟ قال: يا أبا بصير، انطلق فإن الله سيجعل لك ولمن معك من المستضعفين فرجاً ومخرجا فانطلق معهما، وقد شق ذلك على المسلمين وهم ينظرون بحزن إلى أخيهم في العقيدة، وهو يعود إلى سجنه بمكة بعد أن استطاع أن يفلت من ظلم قريش، ولكن رسول الله ﷺ كان يهتم بالوفاء بالعهود والمواثيق ولم يكن عنده مجرد نظرية مكتوبة على الورق ولكنه كان سلوكاً عملياً في حياته وفي علاقته الدولية، فقد أوصى الله سبحانه وتعالى بالوفاء بالعهود، وحذر من نقض الأيمان بعد توكيدها في كثير من الآيات القرآنية قال تعالى: وَأَوْفُوا بِعَهْدِ اللَّهِ إِذَا عَاهَدْتُمْ وَلا تَنْقُضُوا الأَيْمَانَ بَعْدَ تَوْكِيدِهَا وَقَدْ جَعَلْتُمُ اللَّهَ عَلَيْكُمْ كَفِيلا إِنَّ اللَّهَ يَعْلَمُ مَا تَفْعَلُونَ - سورة النحل';
const String p14 =
    'لقد التزم رسول الله ﷺ بعهده مع قريش وسلم أبا بصير إليهما وانطلق معهما، فلما كانا بذي الحليفة، قال لأحد صاحبيه: أصارم سيفك هذا يا أخا بني عامر؟ فقال: نعم قال: أنظر إليه؟ قال: انظر، إن شئت، فاستله أبو بصير، ثم علاه به حتى قتله، ففر الآخر إلى رسول الله ﷺ فقال: قتل صاحبكم صاحبي، فما لبث أبو بصير أن حضر، متوشحاً السيف، وقال: يارسول الله وفت ذمتك، وأدى الله عنك، أسلمتني بيد القوم، وقد امتنعت بديني أن أفتن فيه، أو يعبث بي، فقال النبي ﷺ : ويل أمه مسعر حرب لو كان له أحد فلما سمع ذلك عرف أنه سيرده عليهم فخرج حتى أتى سيف البحر، وقد فهم المستضعفون بمكة من عبارة الرسول ﷺ أن أبا بصير بحاجة إلى الرجال، فأخذوا يفرون من مكة إلى أبي بصير في سيف البحر، فلحق به أبو جندل بن سهيل بن عمرو وغيره حتى اجتمع عند أبي بصير عصبة قوية، فما يسمعون بعير لقريش خرجت إلى الشام إلا اعترضوا طريقها وقتلوا من فيها، وأخذوا الأموال التي كانوا يتّجرون بها، فأرسل المشركون إلى النبي ﷺ يناشدونه بالله والرحم لما أرسل إلى أبي بصير ومن معه، ومن أتاه منهم فهو آمن، وتخلوا في ذلك عن أقسى شروطهم التي صبوا فيها كؤوس كبريائهم، فذلت قريش من حيث طلبت العز.';
const String p15 =
    'فأرسل إليهم النبي ﷺ وهم بناحية العيص، فقدموا عليه وكانوا قريباً من الستين أو السبعين فآوى النبي ﷺ تلك العصبة المؤمنة التي أقضت مضاجع قريش، وأرغمتها على إسقاط شرطها التعسفي، فزادت بهم قوة المسلمين، وقويت بهم شوكتهم، واشتد بأسهم غير أن أبا بصير، رأس تلك العصابة ومؤسسها، لم يقدر له أن يكون معها، فقد وافاه كتاب النبي ﷺ بالعودة إلى المدينة، وهو على فراش الموت، فلفظ أنفاسه حيث كان في الثغر، وهواه في قلب المجتمع النبوي في المدينة.';
const String p16 =
    'إن المتأمل في هذه الأحداث يرأى رعاية الله التي أولاها لهؤلاء الصحابة الكرام، ولاشك أن هناك أسباباً بذلوها فأهلتهم لتلك الرعاية من الله سبحانه، فقد بين سبحانه في كتابه المؤهلات لرعايته وعنايته قال تعالى: إِنَّ اللَّهَ مَعَ الَّذِينَ اتَّقَوْا وَالَّذِينَ هُمْ مُحْسِنُونَ - سورة النحل';
const String p17 =
    'صمم مجموعة من النساء المستضعفات في مكة على الهجرة من دار الكفر إلى دار الإسلام، وفي مقدمة هؤلاء النساء أم كلثوم بنت عقبة بن أبي معيط، فقد هاجرت إلى رسول الله ﷺ بعد صلح الحديبية، فأراد كفار مكة أن يردوهن فأنزل الله تعالى في حقهن: يَاأَيُّهَا الَّذِينَ ءَامَنُوا إِذَا جَاءَكُمُ الْمُؤْمِنَاتُ مُهَاجِرَاتٍ فَامْتَحِنُوهُنَّ اللَّهُ أَعْلَمُ بِإِيمَانِهِنَّ فَإِنْ عَلِمْتُمُوهُنَّ مُؤْمِنَاتٍ فَلا تَرْجِعُوهُنَّ إِلَى الْكُفَّارِ لا هُنَّ حِلٌّ لَهُمْ وَلا هُمْ يَحِلُّونَ لَهُنَّ وَءَاتُوهُمْ مَا أَنْفَقُوا وَلا جُنَاحَ عَلَيْكُمْ أَنْ تَنْكِحُوهُنَّ إِذَا ءَاتَيْتُمُوهُنَّ أُجُورَهُنَّ وَلا تُمْسِكُوا بِعِصَمِ الْكَوَافِرِ وَاسْأَلُوا مَا أَنْفَقْتُمْ وَلْيَسْأَلُوا مَا أَنْفَقُوا ذَلِكُمْ حُكْمُ اللَّهِ يَحْكُمُ بَيْنَكُمْ وَاللَّهُ عَلِيمٌ حَكِيمٌ - سورة الممتحنة';
const String p18 =
    'ومعنى الآيات الكريمة قال ابن عباس: كان امتحانهن أن يشهدن أن لا إله إلا الله وأن محمداً عبدالله ورسوله، وقوله تعالى: فَإِنْ عَلِمْتُمُوهُنَّ مُؤْمِنَاتٍ فَلا تَرْجِعُوهُنَّ إِلَى الْكُفَّارِ لا هُنَّ حِلٌّ لَهُمْ وَلا هُمْ يَحِلُّونَ لَهُنَّ هذه الآية هي التي حرمت المسلمات على المشركين، قال القرطبي: هذا أول دليل على أن الذي أوجب فرقة المسلمة من زوجها إسلامها لاهجرتها ثم قال تعالى: وَءَاتُوهُمْ مَا أَنْفَقُوا وَلا جُنَاحَ عَلَيْكُمْ أَنْ تَنْكِحُوهُنَّ إِذَا ءَاتَيْتُمُوهُنَّ أُجُورَهُنَّ.';
const String p19 =
    'وفي قوله: وَلا تُمْسِكُوا بِعِصَمِ الْكَوَافِرِ العصم: جمع العصمة وأصل العصمة: الحبل، وكل ما أمسك شيئاً فقد عصمه، والمراد بالعصمة هنا النكاح، الكوافر جمع كافرة، والمعنى: أن الله تعالى نهى المؤمنين عن المقام على نكاح الكوافر، وأمرهم بفراقهن،وقد طلق عمر بن الخطاب امرأتين كانتا له في الشرك لما نزلت هذه الآية.';
const String p20 =
    'في قيام المغيرة بن شعبة على رأس النبي ﷺ بالسيف ولم يكن من عادته أن يقام على رأٍسه وهو قاعد سنة يقتدى بها عند قدوم رسل العدو من اظهار العز والفخر وتعظيم الإمام وطاعته ووقايته بالنفوس وهذه هي العادة الجارية عند قدوم رسل المؤمنين على الكافرين وقدوم رسل الكافرين على المؤمنين وليس هذا من النوع الذي ذمه النبي ﷺ بقوله: من أحب أن يتمثل له الرجال قياماً فليتبؤا مقعده من النار.';
const String p21 =
    'كما أن الفخر والخيلاء في الحرب ليسا من هذا النوع المذموم في غيره، ويشبه هذا مافعله أبو دجانة في غزوة أحد، فكل مايدل على التكبر أو التجبر في المشي ممنوع شرعاً ولكنه جائز في حالة الحرب بخصوصها بدليل قوله ﷺ عن مشية أبي دجانة: إنها مشية يكرهها الله إلا في هذا الموضع.';
const String p22 =
    'ففي حديث عروة بن مسعود وهو يصف أصحاب رسول الله حوله قال: فوالله ماتنخم رسول الله ﷺ نخامة إلا وقعت في كف رجل منهم فدلك بها وجهه وجلده... وإذا توضأ كادوا يقتتلون على وضوئه.';
const String p23 =
    'وقد علق الشاطبي على هذا الحديث وأحاديث أخرى تماثله فقال: فالظاهر في مثل هذا النوع أن يكون مشروعاً في حق من ثبت ولايته واتباعه لسنة رسول الله ﷺ وأن يتبرك بفضل وضوءه ويتدلك بنخامته ويستشفي بآثاره كلها، ويرجى نحو مما كان في آثار المتبوع الأصل ﷺ إلا أنه عارضنا في ذلك أصل مقطوع به في متنه مشكل في تنزيله وهو أن الصحابة رضي الله عنهم بعد موته عليه السلام لم يقع من أحد منهم في شيء من ذلك.';
const String p24 =
    'قال كعب بن عجرة رضي الله عنه: وقف عليّ رسول الله ﷺ بالحديبية ورأسي يتهافت قملاً فقال: أيؤذيك هوامك -مايدب من الأخشاش- قلت: نعم قال: فاحلق رأسك أو قال: احلق قال: فنزلت هذه ال فَمَنْ كَانَ مِنْكُمْ مَرِيضًا أَوْ بِهِ أَذًى مِنْ رَأْسِهِ فَفِدْيَةٌ مِنْ صِيَامٍ أَوْ صَدَقَةٍ أَوْ نُسُكٍ - سورة البقرة فقال النبي ﷺ : صم ثلاثة أيام أو تصدق بفرق بين ستة أو انسك بما تيسر.';
const String p25 =
    'روى ابن ماجة عن أبي المليح بن أسامة قال: خرجت إلى المسجد في ليلة مطيرة فلما رجعت استفتحت فقال أبي : من هذا؟ قال: أبو المليح قال: لقد رأيتنا مع رسول الله ﷺ يوم الحديبية وأصابتنا سماء لم تبل أسافل نعالنا فنادى منادي رسول الله ﷺ صلوا في رحالكم. وهذا الحديث صحيح، فسنده متصل برواية الثقات وقد صححه ابن حجر.';
const String p26 =
    'بعد أن تحلل المسلمون من عمرتهم تلك قفلوا راجعين إلى المدينة فلما كان من الليل عدلوا عن الطريق للنوم ووكلوا بلالاً بحراستهم، فنام بلال ولم يوقظهم إلا حر الشمس كما جاء في حديث عبدالله بن مسعود رضي الله عنه حيث قال: أقبلنا مع رسول الله ﷺ زمن الحديبية فقال رسول الله ﷺ : من يكلؤونا -يحرسنا- ؟ فقال بلال: أنا فناموا حتى طلعت الشمس واستيقظ النبي ﷺ فقال: افعلوا كما كنتم تفعلون قال: ففعلنا قال: فكذلك فافعلوا لمن نام أو نسى وقد وردت أحاديث أخرى تفيد أن قصة نومهم عن صلاة الصبح وقعت في غير الحديبية وحاول بعض العلماء التوفيق بين هذه النصوص وذهب الدكتور حافظ الحكمي إلى أن ماورد من اختلاف بين حديث عبدالله بن مسعود في قصة الحديبية وغيره محمول على تعدد القصة كما رجح ذلك النووي، وجنح إليه ابن كثير وابن حجر، والزرقاني، بل قال السيوطي لايجمع إلا بتعدد القصة.';
const String p27 =
    'استدل العلماء والأئمة بصلح الحديبية على جواز عقد هدنة بين المسلمين وأهل الحرب من أعدائهم إلى مدة معلومة، سواء أكان ذلك بعوض يأخذونه منهم أم بغير عوض، أما بدون عوض فلأن هدنة المدينة كانت كذلك، وأما بعوض فبقياس الأولى لأنها إذا جازت بدون عوض، فلأن تجوز بعوض أقرب وأوجه.';
const String p28 =
    'هذه قاعدة أصولية يؤيدها مارواه ابن هشام عن أبي عبيد أنه قال: إن بعض من كان مع رسول الله ﷺ ، قال له لما قدم المدينة: ألم تقل يارسول الله إنك تدخل مكة آمناً؟ قال: بلى، أفقلت لكم من عامي هذا؟ قالوا: لا، قال: فهو كما قال لي جبريل عليه السلام وفي هذا الأثرتبشير المؤمنين بفتح مكة، في المستقبل، وإيماء بالوحي الصادق إلى ذلك النصر، ولفت لهم إلى وجوب التسليم لأمره بإطلاق كلما ورد مطلقاً، دون تحميله زيادات وقيوداً تصرفه عن إطلاقه.';
const String p29 =
    'جاء في قصة الحديبية أن عمر بن الخطاب وبعض الصحابة رضي الله عنهم كرهوا الصلح مع قريش لما رأوا في شروطها من الظلم والإجحاف في حقهم، لكنهم ندموا بعد ذلك على صنيعهم ورأوا أنهم وقعوا في حرج، إذ كيف يكرهون شيئاً رضيه رسول الله ﷺ ، وظلت تلك الحادثة درساً لهم فيما استقبلوا من حياتهم، وكانوا يحذرون غيرهم من الوقوع فيما وقعوا فيه من الاعتماد على الرأي : فكان عمر بن الخطاب رضي الله عنه يقول: أيها الناس اتهموا الرأي على الدين فلقد رأيتني أرد أمر رسول الله ﷺ برأي اجتهاداً فوالله ماآلوا عن الحق وذلك يوم أبي جندل.';
const String p30 =
    'في قول رسول الله ﷺ : من يصعد الثنية ثنية المرار فإنه يحط عنه ماحط عن بني إسرائيل.';
const String p31 =
    'يظهر في هذا الحديث جانب عظيم من جوانب التربية النبوية يستحق التأمل والتدبر، فرسول الله ﷺ يشجع أصحابه على صعود الثنية ثم يخبرهم أن الذي يجتازها سينال مغفرة من الله تعالى.';
const String p32 =
    'ونتأمل هذا الحديث أن رسول الله ﷺ يريد أن يربط قلوب أصحابه باليوم الآخر في كل لحظة من لحظات حياتهم.';
const String p33 =
    'وأنه ﷺ يريد لفت أنظارهم إلى أن كل حركة يتحركونها وكل عمل يقومون به -حتى مايرون أنه من العادات أو من دواعي الغريزة- يجب استغلاله للتزود لذلك اليوم، وكان ﷺ يسعى دائماً لترسيخ تلك المعاني في نفوس الصحابة فنراه يقول في موطن آخر : وفي بضع أحدكم صدقة قالوا: يارسول الله! أيأتي أحدنا شهوته ويكون له فيها أجر؟ قال: أرأيتم لو وضعها في حرام أكان عليه فيها وزر؟ فكذلك إذا وضعها في الحلال كان له أجر، ويقول في موطن ثالث: وإنك مهما أنفقت من نفقة فإنها صدقة حتى اللقمة التي ترفعها إلى في امرأتك.';
const String p34 =
    'إن تلك المعاني -إذا تمكنت في قلب المسلم- لكفيلة بأن تصبغ حياته كلها بصبغة العبودية لله وحده، وإذا شملت العبادة كل نواحي حياة المسلم فإن لهذا الشمول آثار مباركة سوف يشعر بها الفرد في نفسه ثم يلمسها فيمن حوله.';
const String p35 =
    'ومن آثر ذلك أن يصبغ حياة المسلم وأعماله بالصبغة الربانية ويجعله مشدوداً إلى الله في كل مايؤديه، فهو يقوم به بنية العابد الخاشع وروح القانت المخبت، وهذا يدفعه إلى الاستكثار من كل عمل نافع وكل انتاج صالح، وكل ماييسر له ولأبناء نوعه الانتفاع بالحياة، على أمثل وجوهها، فإن ذلك يزيد رصيده من الحسنات والقربات عند الله تعالى كما يدعوه هذا المعنى إلى إحسان عمله الدنيوي وتجويده واتقانه، مادام يقدمه إلى ربه سبحانه ابتغاء رضوانه وحسن مثوبته.';
const String p36 =
    'لقد عاش الصحابة الكرام تلك المعاني وحوّلوها إلى حقائق ملموسة في حياتهم كلها، وماحفظ الله سيرتهم إلا لكي نقتدي بهم في حياتنا وتكون حجة على كل من جاء بعدهم.';
