const int sectionIndex = 20;
const String sectionTitle = 'بيعة العقبة';

const List t1 = ['1', 'الإتصال بالأنصار في الحج والعمرة'];
const List t2 = ['2', 'بيعة العقبة الأولى'];
const List t3 = ['3', 'بيعة العقبة الثانية'];
const List t4 = ['4', 'إختيار النقباء والانصراف'];
const List t5 = ['5', 'التخطيط العظيم'];
const List t6 = ['6', ' السرية التامة'];
const List t7 = ['7', 'بل الدم الدم والهدم الهدم'];
const List t8 = ['8', 'كيفية اختيار النقباء'];
const List t9 = ['9', 'معرفة زعماء مكة بالبيعة'];
const List t10 = ['10', 'صدق الأنصار '];

const String p1 =
    'قال جابر بن عبدالله الأنصاري: مكث رسول الله ﷺ بمكة عشر سنين يتبع الناس في منازلهم بعُكاظ ومجنّة وفي المواسم بمنى يقول: من يؤويني؟ من ينصرني حتى أبلّغ رسالة ربي وله الجنة؟ حتى إن الرجل ليخرج من اليمن أو مضر فيأتيه قومه فيقولون: احذر غلام قريش لايفتننك، ويمشي بين رجالهم وهم يشيرون إليه بالأصابع حتى بعثنا الله إليه من يثرب فآويناه وصدقناه، فيخرج الرجل منا فيؤمن به ويقرئه القرآن فينقلب إلى أهله فيسلمون بإسلامه حتى لم يبقى دار من دور الأنصار إلا وفيها رهط من المسلمين يظهرون الإسلام.';
const String p2 =
    'كانت البداية المثمرة مع وفد من الخزرج في موسم الحج عند عقبة منى قال لهم رسول الله ﷺ : من أنتم؟ قالوا: نفر من الخزرج.';
const String p3 = 'قال: أمن موالي يهود؟ قالوا: نعم';
const String p4 =
    'قال: أفلا تجلسون أكلمكم؟ قالوا: بلى، فجلسوا معه فدعاهم إلى الله عزوجل وعرض عليهم الإسلام وتلا عليهم القرآن.';
const String p5 =
    'ومن الجدير بالتنبيه أن هذه المقابلة التي حدثت عند العقبة وتلاقى فيها فريق من الخزرج بالنبي ﷺ وأسلموا على يديه لم تكن فيها بيعة، لأنها كانت من نفر صغير لم يروا لأنفسهم الحق في أن يلتزموا بمعاهدة دون الرجوع إلى قبائلهم في المدينة ولكنهم أخلصوا في تبليغ رسالة الإسلام.';
const String p6 =
    'بعد عام من المقابلة الأولى التي تمت بين الرسول ﷺ وأهل يثرب عند العقبة وافى الموسم من الأنصار اثنا عشر رجلاً فلقوه ﷺ بالعقبة وبايعوه العقبة الأولى، عشرة من الخزرج واثنان من الأوس، مما يشير إلى أن نشاط وفد الخزرج الذين أسلموا في العام الماضي تركز على وسطهم القبلي بالدرجة الأولى لكنهم تمكنوا بنفس الوقت من اجتذاب رجال الأوس وكان ذلك بداية ائتلاف القبيلتين تحت راية الإسلام.';
const String p7 =
    'وقد تحدث عبادة بن الصامت الخزرجي عن البيعة في العقبة الأولى فقال: كنت فيمن حضر العقبة الأولى وكنا اثنى عشر رجلاً، فبايعنا رسول الله ﷺ على بيعة النساء - وذلك قبل أن يفترض علينا الحرب: على أن لانشرك بالله ولانسرق ولانزني ولانقتل أولادنا ولانأتي ببهتان نفتريه من بين أيدينا وأرجلنا ولانعصيه في معروف فإن وفيتم فلكم الجنة وإن غشيتم من ذلك شيئاً فأمركم إلى الله عزوجل إن شاء غفر وإن شاء عذب.';
const String p8 =
    'وقد نزل مصعب بن عمير رضي الله عنه في يثرب على أسعد بن زرارة رضي الله عنه، ونشط المسلمون في الدعوة إلى الله يقود تلك الحركة الدعوية الرائدة مصعب رضي الله عنه وقد انتهج منهج القرآن الكريم في دعوته وهذا الذي تعلمه من أستاذه ﷺ وقد شرح لنا بعض الآيات القرآنية المكية بصورة عملية حية قال تعالى: ادْعُ إِلَى سَبِيلِ رَبِّكَ بِالْحِكْمَةِ وَالْمَوْعِظَةِ الْحَسَنَةِ وَجَادِلْهُمْ بِالَّتِي هِيَ أَحْسَنُ إِنَّ رَبَّكَ هُوَ أَعْلَمُ بِمَنْ ضَلَّ عَنْ سَبِيلِهِ وَهُوَ أَعْلَمُ بِالْمُهْتَدِينَ - سورة النحل';
const String p9 =
    'ففى رواية الصحابي كعب بن مالك الأنصاري وهو أحد المبايعين في العقبة الثانية قال: خرجنا في حجاج قومنا من المشركين وقد صلينا وفقهنا .. ثم خرجنا إلى الحج، وواعدنا رسول الله ﷺ العقبة من أوسط أيام التشريق .. وكنا نكتم من معنا من المشركين أمرنا، فنمنا تلك الليلة مع قومنا في رحالنا حتى إذا مضى ثلث الليل خرجنا من رحالنا لميعاد رسول الله نتسلل تسلل القطا مستخفين، حتى اجتمعنا في الشعب عند العقبة ونحن ثلاثة وسبعون رجلاً ومعنا امرأتان من نسائنا نسيبة بنت كعب وأسماء بنت عمرو فاجتمعنا في الشعب ننتظر رسول الله ﷺ حتى جاءنا ومعه العباس بن عبد المطلب وهو يومئذ على دين قومه إلا أنه أحب أن يحضر أمر ابن أخيه ويتوثق له، فلما جلس كان أول متكلم العباس بن عبدالمطلب: فبين أن الرسول في منعة من قومه بني هاشم ولكنه يريد الهجرة إلى المدينة ولذلك فإن العباس يريد التأكد من حماية الأنصار له وإلا فليدعوه فطلب الأنصار أن يتكلم رسول الله فيأخذ لنفسه ولربه مايحب من الشروط.';
const String p10 =
    'قال: أبايعكم على أن تمنعوني مما تمنعون منه نساءكم وأبنائكم فأخذ البراء بن معرور بيده ثم قال: نعم والذي بعثك بالحق لنمنعنّك مما نمنع منه أُزرنا فبايعنا يارسول الله فنحن والله أهل الحرب وأهل الحلقة ورثناها كابراً عن كابر، فقاطعه أبو الهيثم بن التيهان متسائلاً: يارسول الله إن بيننا وبين القوم حبالاً وإنا قاطعوها -يعني اليهود- فهل عسيتم إن نحن فعلنا ذلك ثم أظهرك الله أن ترجع إلى قومك وتدعنا؟ فتبسم رسول الله ﷺ ثم قال: بل الدم بالدم، والهدم بالهدم أنا منكم وأنتم مني أحارب من حاربتم وأسالم من سالمتم.';
const String p11 =
    'ثم قال: أخرجوا إليَّ منكم اثني عشر نقيباً ليكونوا على قومهم بما فيهم فأخرجوا منهم اثني عشر نقيباً تسعة من الخزرج وثلاثة من الأوس.';
const String p12 =
    'وقد طلب الرسول ﷺ منهم الإنصراف إلى رحالهم، وقد سمعوا الشيطان يصرخ منذراً قريشاً، فقال العباس بن عبادة بن نضلة والله الذي بعثك بالحق، إن شئت لنميلنَّ على أهل منى غداً بأسيافنا.';
const String p13 =
    'فقال رسول الله ﷺ : لم نؤمر بذلك ولكن ارجعوا إلى رحالكم، فرجعوا إلى رحالهم، وفي الصباح جاءهم جمع من كبار قريش، يسألونهم عما بلغهم من بيعتهم للنبي ودعوتهم له للهجرة، فحلف المشركون من الخزرج والأوس بأنهم لم يفعلوا والمسلمون ينظرون إلى بعضهم قال: ثم قام القوم وفيهم الحارث بن هشام بن المغيرة المخزومي وعليه نعلان جديدان قال: فقلت له كلمة كأني أريد أن أشرك القوم فيما قالوا: يا أبا جابر أما تستطيع أن تتخذ وأنت سيد من ساداتنا مثل نعلي هذا الفتى من قريش؟ قال: فسمعهما الحارث فخلعهما من رجليه ثم رمى بها إليَّ وقال: والله لتنعلهما قال: يقول أبو جابر: مه أحفظت والله الفتى فاردد إليه نعليه قال: قلت: لا والله لا أردهما فأل والله صالح لئن صدق الفأل لأسلبنه.';
const String p14 =
    'يظهر التخطيط العظيم في بيعة العقبة حيث تمت في ظروف غاية في الصعوبة وكانت تمثل تحدياً خطيراً وجريئاً لقوى الشرك في ذلك الوقت ولذلك كان التخطيط النبوي لنجاحها في غاية الإحكام والدقة منها:';
const String p15 =
    'سرية الحركة والانتقال لجماعة المبايعين حتى لاينكشف الأمر فقد كان وفد المبايعة المسلم سبعين رجلاً وامرأتين من بين وفد يثربي قوامه نحو خمسمائة مما يجعل حركة هؤلاء السبعين صعبة وانتقالهم أمراً غير ميسور وقد تحدد موعد اللقاء في ثاني أيام التشريق بعد ثلث الليل، حيث النوم قد ضرب أعين القوم وحيث قد هدأت الرِّجْل كما تم تحديد المكان في الشعب الأيمن بعيداً عن عين من قد يستيقظ من النوم لحاجة.';
const String p16 =
    'الخروج المنظم لجماعة المبايعين إلى موعد ومكان الإجتماع فخرجوا يتسللون مستخفين رجلاً رجلاً أو رجلين رجلين.';
const String p17 =
    'ضرب السرية التامة على موعد ومكان الاجتماع، بحيث لم يعلم به سوى العباس بن عبدالمطلب الذي جاء مع النبي ﷺ ليتوثق له وعلي بن أبي طالب الذي كان عيناً للمسلمين على فم الشعب وأبو بكر الذي كان على فم الطريق وهو الآخر عيناً للمسلمين، أما من عداهم من المسلمين وغيرهم فلم يكن يعلم عن الأمر شيئاً وقد أمر جماعة المبايعين أن لايرفعوا الصوت وأن لايطيلوا في الكلام حذراً من وجود عين يسمع صوتهم أو يجس حركتهم.';
const String p18 =
    'اختيار الليلة الأخيرة من ليالي الحج وهي ليلة الثالثة عشر من ذي الحجة حيث سينفر الحجاج إلى بلادهم ظهر اليوم التالي وهو يوم الثالث عشر، ومن ثم تضيق الفرصة أمام قريش في اعتراضهم أو تعويقهم إذا انكشف أمر البيعة وهو أمر متوقع وهذا ماحدث.';
const String p19 =
    'كان أبو الهيثم بن التيهان صريحاً عندما قال للرسول ﷺ إن بيننا وبين الرجال حبالاً وإنا قاطعوها - يعني اليهود - فهل عسيتم إن نحن فعلنا ذلك ثم أظهرك الله أن ترجع إلى قومك وتدعنا؟ فتبسم رسول الله ﷺ وقال: بل الدم الدم والهدم الهدم أنا منكم وأنتم مني أحارب من حاربتم وأسالم من سالمتم وهذا الاعتراض يدلنا على الحرية العالية التي رفع الله تعالى المسلمين إليها بالإسلام، حيث عبر عما في نفسه بكامل حريته، وكان جواب سيد الخلق ﷺ عظيماً، فقد جعل نفسه جزءاً من الأنصار والأنصار جزءاً منه.';
const String p20 =
    'أن الرسول ﷺ لم يعين النقباء إنما ترك طريق اختيارهم إلى الذين بايعوا فإنهم سيكونون عليهم مسئولين وكفلاء والأولى أن يختار الإنسان من يكفله ويقوم بأمره وهذا أمر شوري وأراد الرسول ﷺ أن يمارسوا الشورى عملياً من خلال اختيار نقبائهم.';
const String p21 =
    'التمثيل النسبي في الاختيار من المعلوم أن الذين حضروا البيعة من الخزرج أكثر من الذين حضروا البيعة من الأوس، ثلاثة أضعاف من الأوس بل يزيدون ولذلك كان النقباء ثلاثة من الأوس وتسعة من الخزرج.';
const String p22 =
    'جعل رسول الله ﷺ النقباء مشرفين على سير الدعوة في يثرب حيث استقام عود الإسلام هناك وكثر مثقفوه وأراد الرسول ﷺ أن يشعرهم أنهم لم يعودوا غرباء لكي يبعث إليهم أحداً من غيرهم وأنهم غدوا أهل الإسلام وحماته وأنصاره.';
const String p23 =
    'تأكد زعماء مكة من حقيقة الصفقة التي تمت بين رسول الله ﷺ والأنصار، فخرجوا في طلب القوم فأدركوا سعد بن عبادة بأذخر والمنذر بن عمرو وكلاهما كان نقيباً، فأما المنذر فأعجز القوم وأما سعد فأخذوه فربطوا يديه إلى عنقه بنسع رحله ثم أقبلوا به حتى أدخلوه مكة يضربونه ويجذبونه بجمته وكان ذا شعر كثير، واستطاع أن يتخلص من قريش بواسطة الحارث بن حرب بن أمية وجبير بن مطعم لأنه كان يجير تجارتهم ببلده فقد انقذته أعراف الجاهلية، ولم تنقذه سيوف المسلمين ولم يجد في نفسه غضاضة من ذلك فهو يعرف أن المسلمين مطاردون في مكة وعاجزون عن حماية أنفسهم.';
const String p24 =
    'لقد صدق هؤلاء الأنصار عهدهم مع الله ورسوله ﷺ ، فمنهم من قضى نحبه ولقى ربه شهيد ومنهم من بقي حتى ساهم في قيادة الدولة المسلمة وشارك في أحداثها الجسام بعد وفاة رسول الله ﷺ ، وبمثل هذه النماذج قامت دولة الإسلام، النماذج التي تعطي ولا تأخذ، والتي تقدم كل شيء، ولاتطلب شيئاً إلا الجنة، ويتصاغر التاريخ في جميع عصوره ودهوره أن يحوي في صفحاته أمثال هؤلاء الرجال.';
