const int sectionIndex = 22;
const String sectionTitle = 'الهجرة - إيذاء المهاجرين';

const List t1 = ['1', 'قصة التفريق مع أم سلمة رضى الله عنها'];
const List t2 = ['2', 'عناية الله تعالى بأوليائه'];
const List t3 = ['3', 'الاختطاف - قصة عيَّاش'];
const List t4 = ['4', 'قل يَاعِبادِي الذِينَ أَسرَفوا عَلى أَنفسِهِم'];
const List t5 = ['5', 'الحبس'];
const List t6 = ['6', 'التجريد من المال'];
const List t7 = ['7', 'الفرق بين الحبشة والمدينة'];
const List t8 = ['8', 'لماذا اختيرت المدينة كعاصمة للدولة؟'];
const List t9 = ['9', 'من فضائل المدينة'];

const String p1 =
    'ونترك أم المؤمنين أم سلمة هند بنت أبي أمية تحدثنا عن روائع الإيمان وقوة اليقين في هجرتها وهجرة زوجها أبي سلمة قالت رضي الله عنها: لما أجمع أبي سلمة الخروج إلى المدينة رحل لي بعيره ثم حملني عليه وحمل معي ابني سلمة بن أبي سلمة في حجري، ثم خرج بي يقود بعيره فلما رأته رجال بني المغيرة بن عبدالله بن عمرو بن مخزوم قاموا إليه فقالوا: هذه نفسك غلبتنا عليها، أرأيت صاحبتنا هذه علام نتركك تسير بها إلى البلاد؟';
const String p2 =
    'قالت: فتركوا خطام البعير من يده فأخذوني منه، وغضب عند ذلك بنو عبدالأسد رهط أبي سلمة قالوا: لا والله لانترك ابننا عندها إذ نزعتموها من صاحبنا.';
const String p3 =
    'قالت: فتجاذبوا ابني سلمة بينهم حتى خلعوا يده وانطلق به بنو عبد الأسد وحبسني بنو المغيرة عندهم وانطلق زوجي أبو سلمة إلى المدينة.';
const String p4 =
    'قالت: ففُرق بيني وبين زوجي وبين ابني، فكنت أخرج كل غداة فأجلس بالأبطح فما أزال أبكي حتى أمسي سنة أو قريباً منها، حتى مرّ بي رجل من بني عمي - أحد بني المغيرة - فرأى مابي فرحمني، فقال لبني المغيرة: ألا تخرجون هذه المسكينة فرَّقتم بينها وبين زوجها وبين ولدها؟';
const String p5 =
    'قالت: فقالوا لي: الحقي بزوجك إن شئت، وردّ بنو عبد الأسد إليّ عند ذلك ابني، فارتحلت بعيري ثم أخذت ابني فوضعته في حجري ثم خرجت أريد زوجي بالمدينة ومامعي أحد من خلق الله.';
const String p6 =
    'قالت: فقلت: أتبلغ بمن لقيت حتى أقدم على زوجي حتى إذا كنت بالتنعيم لقيت عثمان بن طلحة بن أبي طلحة أخا بني عبدالدار، فقال لي: إلى أين يابنت أبي أمية؟';
const String p7 =
    'قالت: فقلت: أريد زوجي بالمدينة قال: أو مامعك أحد؟ فقلت: لاوالله إلا الله وبنيَّ هذا، قال: والله مالك من مترك.';
const String p8 =
    'فأخذ بخطام البعير فانطلق معي يهوي بي، فوالله ماصحبت رجلاً من العرب قط أرى أنه كان أكرم منه، كان إذا بلغ المنزل أناخ بي ثم أستأخر عني، حتى إذا نزلت عنه أستأخر ببعيري فحط عنه ثم قيَّده في الشجرة ثم تنحى إلى الشجرة فاضطجع تحتها فإذا دنا الرواح قام إلى بعيري فقدمه فرحله ثم استأخر عني فقال: اركبي فإذا ركبت فاستويت على بعيري أتى فأخذ بخطامه فقاد بي حتى ينزل بي فلم يزل يصنع ذلك بي حتى أقدمني المدينة، فلما نظر إلى قرية بني عمرو بن عوف بقباء قال: زوجك في هذه القرية وكان أبو سلمة بها نازلاً فادخليها على بركة الله ثم انصرف راجعاً إلى مكة.';
const String p9 =
    'قال فكانت تقول: والله ما أعلم أهل بيت في الإسلام أصابهم ما أصاب آل أبي سلمة وما رأيت صاحباً قط أكرم من عثمان بن طلحة.';
const String p10 =
    'وهكذا أثر الإيمان حين يخالط بشاشة القلوب فهذه أسرة فرق شملها، وامرأة تبكي شدة مصابها وطفل خلعت يده وحُرِم من أبويه وزوج وأب يسجل أروع صور التضحية والتجرد، ليكون أول مهاجر يصل أرض الهجرة محتسبين في سبيل الله مايلقون مصممين على المضي في طريق الإيمان والانحياز إلى كتيبة الهدى فماذا عسى أن ينال الكفر وصناديده من أمثال هؤلاء.';
const String p11 =
    'وأما صنيع عثمان بن طلحة رضي الله عنه فقد كان يومئذ كافراً وأسلم قبل الفتح، ومع ذلك تشهد له أم سلمة رضي الله عنها بكرم الصحبة وذلك شاهد صدق على نفاسة هذا المعدن وكمال مروءته وحمايته للضعيف فقد أبت عليه مروءته وخلقه العربي الأصيل أن يَدَع امرأة شريفة تسير وحدها في هذه الصحراء الموحشة.';
const String p12 =
    'إن هذه القصة ولها مُثُلُ ونظائر لتشهد أن ماكان للعرب من رصيد من الفضائل كان أكثر من مثالبهم ورذائلهم، فمن ثم اختار الله منهم خاتم انبيائه ورسله، وكانوا أهلاً لحمل الرسالة وتبليغها للناس كافة ، وتظهر عناية الله تعالى بأوليائه وتسخيره لهم فهو جل وعلا الذي سخر قلب عثمان بن طلحة للعناية بأم سلمة ولذلك بذل الجهد والوقت من أجلها، كما تظهر سلامة فطرة عثمان بن طلحة التي قادته أخيراً إلى الإسلام بعد صلح الحديبية ولعل إضاءة قلبه بدأت منذ تلك الرحلة في مصاحبته لأم سلمة رضي الله عنهم.';

const String p13 =
    'تعدت ذلك إلى محاولة قريش لإرجاع من دخل المدينة مهاجراً، فقامت بتنفيذ عملية اختطاف أحد المهاجرين ولقد نجحت هذه المحاولة وتم اختطاف المهاجرين من المدينة وأعيد إلى مكة وهذه الصورة التاريخية للاختطاف يحدثنا بها عمر بن الخطاب رضي الله عنه حيث قال: اتعدت لما أردنا الهجرة إلى المدينة أنا وعيَّاش بن أبي ربيعة، وهشام بن العاص بن وائل السهمي، التناضب اى الشجر، من أضَاة - على عشرة أميال من مكة - بني غفار فوق سَرِف - وادي متوسط الطول من أودية مكة - وقلنا: أينا لم يصبح عندها فقد حُبس فليمض صاحباه، قال: فأصبحت أنا وعياش بن أبي ربيعة عند التَّناضب وحُبس عنا هشام وفُتن فافتتن.';
const String p14 =
    'فلما قدمنا المدينة نزلنا في بني عمرو بن عوف بقباء وخرج أبو جهل بن هشام والحارث بن هشام إلى عيَّاش بن أبي ربيعة وكان ابن عمهما وأخاهما لأمهما، حتى قدما علينا المدينة ورسول الله ﷺ بمكة فكلَّماه وقالا: إن أمك قد نذرت أن لايمسَّ رأسها مُشطٌ حتى تراك ولاتستظلَّ من شمس حتى تراك فرقَّ لها فقلت له: عياش إنه والله إن يريدك القوم إلا ليفتنوك عن دينك فاحذرهم فوالله لو قد آذى أمك القمل لامتشطت ولو قد اشتد عليها حر مكة لاستظلت، قال: أبرُّ قسم أمي ولي هناك مال فآخذه';
const String p15 =
    'قال: فقلت: والله إنك لتعلم أني لمن أكثر قريش مالاً فلك نصف مالي ولاتذهب معهما، قال: فأبى عليَّ إلا أن يخرج معهما فلما أبى إلا ذلك قال: قلت له: أما إذ قد فعلت مافعلت، فخذ ناقتي هذه فإنها ناقة نجيبة ذلول - سهلة الركوب والانقياد - فالزم ظهرها فإن رابك من القوم ريب فانج عليها فخرج عليهما معهما، حتى إذا كانوا ببعض الطريق قال له أبو جهل: يا أخي والله لقد استغلظت بعيري هذا أفلا تُعقبني على ناقتك هذه؟ قال: بلى قال: فأناخ وأناخ ليتحول عليها، فلما استووا بالأرض عدوا عليه فأوثقاه ثم دخلا به مكة وفتناه فافتتن.';
const String p16 =
    'قال: فكنا نقول: ما الله بقابل ممن افتتن صرفاً ولا عدلاً ولاتوبة، قوم عرفوا الله ثم رجعوا إلى الكفر لبلاء أصابهم قال: وكانوا يقولون ذلك لأنفسهم فلما قدم رسول الله ﷺ المدينة أنزل الله تعالى فيهم وفي قولنا وقولهم لأنفسهم : قُلْ يَاعِبَادِيَ الَّذِينَ أَسْرَفُوا عَلَى أَنْفُسِهِمْ لاَ تَقْنَطُوا مِنْ رَحْمَةِ اللَّهِ إِنَّ اللَّهَ يَغْفِرُ الذُّنُوبَ جَمِيعًا إِنَّهُ هُوَ الْغَفُورُ الرَّحِيمُ وَأَنِيبُوا إِلَى رَبِّكُمْ وَأَسْلِمُوا لَهُ مِنْ قَبْلِ أَنْ يَأْتِيَكُمُ الْعَذَابُ ثُمَّ لاَ تُنْصَرُونَ وَاتَّبِعُوا أَحْسَنَ مَا أُنْزِلَ إِلَيْكُمْ مِنْ رَبِّكُمْ مِنْ قَبْلِ أَنْ يَأْتِيَكُمُ الْعَذَابُ بَغْتَةً وَأَنْتُمْ لاَ تَشْعُرُونَ - سورة الزمر';
const String p17 =
    'قال عمر بن الخطاب: فكتبتها بيدي في صحيفة وبعثت بها إلى هشام بن العاص قال: فقال هشام: فلّما أتتني جعلت أقرؤها بذي طوى أصَعَّد بها فيه وأصَوَّبُ ولا أفهمها حتى قلت: اللهمَّ فهِّمنيها، قال: فألقى الله تعالى في قلبي أنها إنما أنزلت فينا، وفيما كنا نقول في أنفسنا ويقال فينا قال: فرجعت إلى بعيري فجلست عليه، فلحقت برسول الله ﷺ وهو بالمدينة.';
const String p18 =
    'هذه الحادثة تظهر لنا كيف أعد عمر رضي الله عنه خطة الهجرة له ولصاحبيه عياش بن أبي ربيعة وهشام بن العاص بن وائل السهمي وكان ثلاثتهم كل واحد من قبيلة، وكان مكان اللقاء الذي اتعدوا فيه بعيداً عن مكة وخارج الحرم على طريق المدينة ولقد تحدد الزمان والمكان بالضبط بحيث أنه إذا تخلف أحدهم فليمض صاحباه ولا ينتظرانه، لأنه قد حبس وكما توقعوا فقد حبس هشام بن العاص رضي الله عنه بينما مضى عمر وعيّاش بهجرتهما ونجحت الخطة كاملة ووصلا المدينة سالمين.';
const String p19 =
    'إلا أن قريشاً صممت على متابعة المهاجرين ولذلك أعدت خطة محكمة قام بتنفيذها أبو جهل والحارث وهما أخوة عياش من أمه، الأمر الذي جعل عياشاً يطمئن لهما وبخاصة إذا كان الأمر يتعلق بأمه، فاختلق أبو جهل هذه الحيلة لعلمه بمدى شفقة ورحمة عياش بأمه والذي ظهر جلياً عندما أظهر موافقته على العودة معهم كما تظهر الحادثة الحس الأمني الرفيع الذي كان يتمتع به عمر رضي الله عنه، حيث صدقت فراسته في أمر الاختطاف.';
const String p20 =
    'لجأت قريش إلى الحبس كأسلوب لمنع الهجرة، فكل من تقبض عليه وهو يحاول الهجرة كانت تقوم بحبسه داخل أحد البيوت مع وضع يديه ورجليه في القيد وتفرض عليه رقابة وحراسة مشددة حتى لايتمكن من الهرب وأحياناً يكون الحبس داخل حائط بدون سقف كما فعل مع عياش وهشام بن العاص رضي الله عنهما حيث كانا محبوسين في بيت لاسقف له، وذلك زيادة في التعذيب إذ يضاف إلى وحشة الحبس حرارة الشمس وسط بيئة جبلية شديدة الحرارة مثل مكة.';
const String p21 =
    'كان النبي ﷺ بعد هجرته يقنت ويدعو للمستضعفين في مكة عامة ولبعضهم بأسمائهم خاصة فعن أبي هريرة رضي الله عنه أن النبي ﷺ كان إذا رفع رأسه من الركعة الأخيرة يقول: اللهم أنج عيّاش بن أبي ربيعة اللهم أنج سلمة بن هشام اللهم أنج الوليد بن الوليد اللهم أنج المستضعفين من المؤمنين، اللهم أشدد وطأتك على مضر اللهم اجعلها سنين كسني يوسف.';
const String p22 =
    'ولم يترك المسلمون أمر اختطاف عياش فقد ندب الرسول ﷺ أحد أصحابه وفعلاً استعد للمهمة ورتب لها مايحقق نجاحها وجاء الى مكة واستطاع بكل اقتدار وذكاء أن يصل الى البيت الذي حُبسا فيه وأطلق سراحهما ورجع بهما الى المدينة المنورة.';
const String p23 =
    'كان صهيب بن سنان النَّمري من النِّمر بن قاسط أغارت عليهم الروم فسُبي وهو صغير وأخذ لسان أولئك الذي سَبَوهْ ثم تقلَّب في الرِّق حتى ابتاعه عبدالله بن جدعان ثم اعتقه ودخل الإسلام هو وعمار بن ياسر رضي الله عنهما في يوم واحد.';
const String p24 =
    'وعن عكرمة رحمه الله قال: لما خرج صهيب مهاجراً تبعه أهل مكة فنشل كنانته فأخرج منها أربعين سهماً فقال: لا تصلون إليَّ حتى أضع في كل رجل منكم سهماً، ثم أصيرُ بعد إلى السيف فتعلمون أني رجل وقد خلَّفت بمكة قينتين، فهما لكم، وقال عكرمة: ونزلت على النبي ﷺ : وَمِنَ النَّاسِ مَنْ يَشْرِي نَفْسَهُ ابْتِغَاءَ مَرْضَاةِ اللَّهِ وَاللَّهُ رَءُوفٌ بِالْعِبَادِ - سورة البقرة ، فلما رآه النبي ﷺ قال: أبا يحيى ربح البيع قال: وتلا عليه الآية.';
const String p25 =
    'لكأني بصهيب رضي الله عنه يقدم الدليل القاطع على فساد عقل أولئك الماديين الذين يوزنون حركات التاريخ وأحداثه كلها بميزان المادة، فأين هي المادة التي سوف يكسبها صهيب في هجرته والتي ضحى من أجلها بكل مايملك؟ هل تراه ينتظر أن يعطيه محمد ﷺ منصباً يعوّضه عما فقده؟ أم هل ترى محمداً ﷺ يُمنيَّه بالعيش الفاخر في جوار أهل يثرب؟';
const String p26 =
    'إن صهيب مافعل ذلك وما انحاز إلى الفئة المؤمنة إلا ابتغاء مرضاة الله بالغاً مابلغ الثمن ليضرب لشباب الإسلام مثلاً في التضحية عزيزة المنال عساهم يسيرون على الدرب ويقتفون الأثر.';
const String p27 =
    'فهذه المقاسمة وهذا التكافل الإجتماعي كان من أهم العناصر التي مهدت لإقامة رسول الله ﷺ وصحابته المهاجرين معه وبعده إقامة طيبة تنبض بالأثرة على النفس وودّ الأخوة الصادقة المؤمنة.';
const String p28 =
    'نحن أمام مجتمع إسلامي بلغ الذروة في لحمته وانصهاره ولم يكن المهاجرون إلا القدوة للأنصار بالبذل والعطاء، فلم يكونوا أصلاً فقراء، بل كانوا يملكون المال ويملكون الدار وتركوا ذلك كله ابتغاء مرضات الله وبذلوه كله لطاعته جل وعلا، فكانوا كما وصفهم القرآن الكريم: لِلْفُقَرَاءِ الْمُهَاجِرِينَ الَّذِينَ أُخْرِجُوا مِنْ دِيارِهِمْ وَأَمْوَالِهِمْ يَبْتَغُونَ فَضْلاً مِنَ اللَّهِ وَرِضْوَانًا وَيَنْصُرُونَ اللَّهَ وَرَسُولَهُ أُولَئِكَ هُمُ الصَّادِقُونَ- سورة الحشر';
const String p29 =
    'ولابد من المقارنة بين المجتمع الذي قام بالحبشة من المسلمين وبين المجتمع الإسلامي في يثرب، لقد كانت الحبشة تحمل طابع اللجوء السياسي والجالية الأجنبية أكثر مما كانت تحمل طابع المجتمع الإسلامي الكامل صحيح أن المسلمين ملكوا حرية العبادة هناك لكنهم معزولون عن المجتمع النصراني لم يستطيعوا أن يؤثروا فيه التأثير المنشود وإن كانت هجرة الحبشة خطوة متقدمة على جو مكة، حيث لاتتوفر حرية الدعوة وحرية العبادة ولكنه دون المجتمع الإسلامي في المدينة بكثير ولذلك شرع مهاجري الحبشة بمجرد سماع خبر هجرة المدينة بالتوجه نحوها مباشرة أو عن طريق مكة إلا من طلبت منه القيادة العليا البقاء هناك لقد أصبحت المدينة مسلمة بعد أن عاشت قروناً وثنية مشركة.';
const String p30 =
    'وهكذا انتقلت الجماعة المسلمة المنظمة القوية إلى المدينة والتحمت مع إخوانها الأنصار وتشكل المجتمع المسلم الذي أصبح ينتظر قائده الأعلى عليه الصلاة والسلام ليعلن ولادة دولة الإسلام التي صنعت فيما بعد حضارة لم يعرف التاريخ مثلها حتى يومنا هذا.';
const String p31 =
    'كان من حكمة الله تعالى في اختيار المدينة داراً للهجرة ومركزاً للدعوة هذا عدا ما أراده الله من إكرام أهلها، أسرار لايعلمها إلا الله، إنها امتازت بتحصن طبيعي حربي، لاتزاحمها في ذلك مدينة قريبة في الجزيرة، فكانت حرة الوبرة مطبقة على المدينة من الناحية الغربية، وحرة واقم مطبقة على المدينة من الناحية الشرقية، وكانت المنطقة الشمالية من المدينة هي الناحية الوحيدة المكشوفة وهي التي حصنها رسول الله ﷺ بالخندق سنة خمس في غزوة الأحزاب وكانت الجهة الأخرى من أطراف المدينة محاطة بأشجار النخيل والزروع الكثيفة لايمر منها الجيش إلا في طرق ضيقة لا يتفق فيها النظام العسكري وترتيب الصفوف.';
const String p32 =
    'وكانت خفارات عسكرية صغيرة، كافية بإفساد النظام العسكري ومنعه من التقدم، يقول ابن اسحاق: كان أحد جانبي المدينة عورة، وسائر جوانبها مشككة بالبنيان والنخيل لايتمكن العدو منها.';
const String p33 =
    'ولعل النبي ﷺ قد أشار إلى هذه الحكمة الإلهية في اختيار المدينة بقوله لأصحابه قبل الهجرة: إني رأيت دار هجرتكم ذات نخيل بين لابتين وهما الحرتان فهاجر من هاجر قبل المدينة.';
const String p34 =
    'وكان أهل المدينة من الأوس والخزرج أصحاب نخوة وإباء وفروسية وقوة وشكيمة ألفوا الحرية، ولم يخضعوا لأحد ولم يدفعوا إلى قبيلة أو حكومة إتاوة أو جباية يقول ابن خلدون: ولم يزل هذان الحيان قد غلبوا على يثرب وكان الاعتزاز والمنعة تعرف لهم في ذلك ويدخل في ملتهم من جاورهم من قبائل مضر.';
const String p35 =
    'وكان بنو عدي بن النجار أخواله ﷺ ، فأم عبدالمطلب بن هاشم بن عدي بن النجار إحدى نسائهم فقد تزوج هاشم بسلمى بنت عمرو أحد بني عدي بن النجار وولدت لهاشم عبدالمطلب وتركه هاشم عندها حتى صار غلاماً دون المراهقة وتركه عمه المطلب، فجاء به إلى مكة وكانت الأرحام يحسب لها حساب كبير في حياة العرب الإجتماعية ومنهم أبو أيوب الأنصاري الذي نزل رسول الله ﷺ في داره في المدينة.';
const String p36 =
    'محبته ﷺ لها ودعاؤه برفع الوباء عنها: دعا النبي ﷺ ربه قائلاً: اللهم حبِّب إلينا المدينة كحبَّنا مكة أو أشد، وعن أنس رضي الله عنه :أن النبي ﷺ كان إذا قدم من سفر، فنظر إلى جُدُران المدينة أوضع راحلته وإن كان على دابة حرَّكها من حُبِّها.';
const String p37 =
    'عصمته من الدّجال والطاعون ببركته ﷺ : إن الله تعالى قيَّض لها ملائكة يحرسونها، فلا يستطيع الدجال إليها سبيلا بل يلقى إليه بإخوانه من الكفار والمنافقين، كما أن من لوازم دعاء النبي ﷺ بالصحة ورفع الوباء أن لاينزل بها الطاعون، كما أخبر بذلك المعصوم ﷺ .';
const String p38 =
    'فضيلة الموت فيها: فعن ابن عمر رضي الله عنه قال: قال رسول الله ﷺ : من استطاع أن يموت بالمدينة فليَمت بها، فإني أشفع لمن يموت بها، وكان عمر بن الخطاب رضي الله عنه يدعو بهذا الدعاء: اللهم ارزقني شهادة في سبيلك، واجعل موتي في بلد رسولك ﷺ .';
const String p39 =
    'وقال ﷺ : هذا جبل يحبنا ونحبه، اللهم إن إبراهيم حرّم مكة وإني أُحرّم مابين لابتيها - يعني المدينة، وقال ﷺ : لايُخْتلى خلالها ولاينفَّر صيدها ولاتحل لقطتها إلا لمن أشادها ولايصلح لرجل أن يحمل فيها السلاح لقتال ولا يصلح أن يقطع منها شجر إلا أن يعلف رجل بعيره.';
const String p40 =
    'إن هذه الفضائل العظيمة جعلت الصحابة يتعلقون بها، ويحرصون على الهجرة إليها والمقام فيها، وبذلك تجمعت طاقات الأمة فيها ثم توجهت نحو القضاء على الشرك بأنواعه والكفر بأشكاله وفتحوا مشارق الأرض ومغاربها.';
