const int sectionIndex = 53;
const String sectionTitle = 'تأديب الغادرين';

const List t1 = ['1', 'من الدفاع إلى الهجوم'];
const List t2 = ['2', 'غزوة بني لحيان'];
const List t3 = ['3', 'تضليل العدو'];
const List t4 = ['4', 'وصل النبي ﷺ بجيشه في ديارهم'];
const List t5 = ['5', 'إرهاب المشركين بمكة'];
const List t6 = ['6', 'غزوة الغابة'];
const List t7 = ['7', 'سرية كرز بن جابر الفهري إلى العرنيين'];
const List t8 = ['8', 'حكم الحرابة'];
const List t9 = ['9', 'سرية عبدالله بن عتيك لقتل أبي الحقيق'];
const List t10 = ['10', 'توجه السرية إلى خيبر'];
const List t11 = ['11', 'مقتل أبي رافع'];
const List t12 = ['12', 'بين رواية البخاري والروايات الآخرى'];
const List t13 = ['13', 'من فوائد معرفة لغة العدو'];
const List t14 = ['14', 'عناية الله ونجاح خطة ابن عتيك'];
const List t15 = ['15', 'سرية عبدالله بن رواحة إلى اليُسير اليهودي'];
const List t16 = ['16', 'المخابرات النبوية'];
const List t17 = ['17', 'الحسم فى التعامل'];
const List t18 = ['18', 'الآن نغزوهم ولايغزونا'];

const String p1 =
    'بعد رحيل الأحزاب انتقل المسلمون من دور الدفاع إلى دور الهجوم وأصبحوا يمسكون بأيديهم زمام المبادرة، وحان الوقت لتأديب بني لحيان الذين غدروا بخبيب وأصحابه يوم الرجيع وأخذ ثأر الشهداء، فخرج إليهم في مائتي صحابي وذلك في ربيع الأول أو جماد الأولى سنة ست من الهجرة.';
const String p2 =
    'كانت أرض بني لحيان من هُذيل تبعد عن المدينة أكثر من مئتين من الأميال، وهي مسافة بعيدة يلاقي مشاق كبيرة كل من يريد قطعها، ولكن النبي ﷺ كان حريصاً على الاقتصاص لأصحابه من الذين استشهدوا غدراً على يد هذه القبائل الهمجية التي لاقيمة للعهود عندها.';
const String p3 =
    'وكما هي عادة النبي ﷺ في تضليل العدو الذي يريد مهاجمته اتجه بجيشه نحو الشمال بينما تقع منازل بني لحيان في أقصى الجنوب.';
const String p4 =
    'وقد أعلن النبي ﷺ قبل تحركه نحو الشمال: انه يريد الإغارة على الشام وحتى أصحابه لم يعلموا أنه يريد بني لحيان إلا عندما انحرف بهم نحو الجنوب، بعد أن اتجه بهم متوغلاً نحو الشمال حوالي عشرين ميلاً وكان تغيير خط سيره من الشمال إلى الجنوب عند مكان يقال له البتراء ففي ذلك المكان عطف بجيشه نحو الغرب حتى استقام على الجادة مْنَصبَّا نحو الجنوب.';
const String p5 =
    'كانت بنو لحيان على غاية التيقظ والانتباه، فقد بثّت الأرصاد والجواسيس في الطرق ليتحسسوا لها ويتجسسوا لذلك فما كاد النبي ﷺ يقترب بجيشه من منازلهم حتى انسحبوا منها فارين وهربوا في رؤس الجبال، وذلك بعد أن نقلت إليهم عيونهم خبر اقتراب جيش المسلمين من ديارهم.';
const String p6 =
    'ولما وصل النبي ﷺ بجيشه عسكر في ديارهم ثم بث السرايا من رجاله ليتعقبوا هؤلاء الغادرين، ويأتون إليه بمن يقدرون عليه، واستمرت السرايا النبوية في البحث والمطاردة يومين كاملين إلا أنها لم تجد أيّ أثر لهذه القبائل تمنعت في رؤوس تلك الجبال الشاهقة، وأقام ﷺ في ديارهم يومين لإرهابهم وتحديهم وليظهر للأعداء مدى قوة المسلمين وثقتهم بأنفسهم وقدرتهم على الحركة حتى إلى قلب ديار العدو متى شاؤوا.';
const String p7 =
    'رأى النبي ﷺ أن يغتنم فرصة وجوده بجيشه قريباً من مكة فقرر أن يقوم بمناورة عسكرية يرهب بها المشركين في مكة، فتحرك بجيشه حتى نزل به وادي عُسفان - قرية بين مكة والمدينة على نحو يومين من مكة - وهناك استدعى أبا بكر الصديق، وأعطاه عشرة فوارس من أصحابه وأمره بأن يتحرك بهم نحو مكة ليبث الذعر والفزع في نفوسهم، فاتجه الصديق بالفرسان العشرة نحو مكة حتى وصل بهم كُراع الغميم ، وهو مكان قريب جداً من مكة، فسمعت قريش بذلك فظنت أن النبي ﷺ ينوي غزوها فانتابها الخوف والفزع والرعب، وساد صفوفها الذعر، هذا هو الذي هدف إليه النبي ﷺ بهذه الحركة التي كلف الصديق أن يقوم بها ، أما الصديق وفرسانه العشرة فبعد أن وصلوا كُراع الغميم - موضع بناحية الحجاز بين مكة والمدينة - وعلموا أنهم قد أحدثوا الذعر والفزع في نفوس أهل مكة عادوا سالمين إلى النبي ﷺ فتحرك بجيشه عائداً إلى المدينة.';
const String p8 =
    'وعندما وصل النبي ﷺ إلى بطن غران - واد بين ساية ومكة - حيث لقي الشهداء من أصحابه مصرعهم على أيدي الخونة من هذيل، ترّحم على هؤلاء الشهداء ودعا لهم.';
const String p9 =
    'لم تكد تمضي ليالٍ قلائل على عودة رسول الله ﷺ من غزوته لبني لحيان، حتى أغار عيينة بن حصن الفزاري في خيل لغطفان، كان عددها أربعين على لقاح الإبل الحوامل ذوات الألبان لرسول الله ﷺ بالغابة، وقتلوا ذر بن أبي ذر الغفاري وأسروا زوجته ليلى، واستاقوا الإبل التي عددها عشرين ولما علم الرسول ﷺ بخبر عيينة، خرج في خمسمائة من أصحابه في إثره، بعد ان استخلف سعد بن عبادة في ثلاثمائة من قومه، يحرسون المدينة، وعند جبل من ذي قَردَ أدرك رسول الله ﷺ العدو فقتل بعض أفراده واستنقذ الإبل.';
const String p10 =
    'وقد أبدى سلمة بن الأكوع في هذه المعركة بطولة نادرة وخاصة قبل وصول كتيبة الفرسان النبوية حيث كان من ظمن الرعاة في منطقة الغابة، وظل بمفرده يشاغل المغيرين ويراميهم بالنبل، وكان من أعظم الرماة في عصره وقد استخلص مجموعة من الإبل المنهوبة قبل قدوم كتيبة الفرسان.';
const String p11 =
    'قدم على رسول الله ﷺ جماعة من عُكَل وعرينة في شوال من العام السادس الهجري ، وتكلموا بالإسلام فقالوا: يانبي الله، إنا كنا أهل ضرع ولم نكن أهل ريف واستوخموا المدينة، فأمر لهم رسول الله ﷺ بذودٍ وراع، وأمرهم أن يخرجوا فيه فيشربوا من ألبانها ويتمسحوا بأبولها، فانطلقوا حتى إذا كانوا ناحية الحَرَّة كفروا بعد إسلامهم، وقتلوا راعي النبي ﷺ واستاقوا الذّود، فبلغ النبي ﷺ خبرهم فبعث الطلب في آثارهم ، فقبضوا عليهم فأمر بهم فسمروا أعينهم وقطعوا أيديهم وأرجلهم، وتركوا في ناحية الحرة حتى ماتوا على حالهم. قال قتادة راوي الحديث: بلغنا أن النبي ﷺ بعد ذلك كان يحث على الصدقة وينهي عن المثلة ، وقال أبو قلابة في حديثه: هؤلاء قوم سرقوا وقتلوا وكفروا بعد إيمانهم وحاربوا الله ورسوله.';
const String p12 =
    'إن حادثة العرانيين ترتب عليها تنفيذ حكم الحرابة ونزول آيات بينات في هذا الحكم، فقد حصر المولى عزوجل جزاء المحاربين في أربعة أمور وكان ذلك الحصر بأقوى أدوات الحصر. قال الجمهور إن الاية : إِنَّمَا جَزَاءُ الَّذِينَ يُحَارِبُونَ اللَّهَ وَرَسُولَهُ وَيَسْعَوْنَ فِي الأَرْضِ فَسَادًا أَنْ يُقَتَّلُوا أَوْ يُصَلَّبُوا أَوْ تُقَطَّعَ أَيْدِيهِمْ وَأَرْجُلُهُمْ مِنْ خِلافٍ أَوْ يُنْفَوْا مِنَ الأَرْضِ ذَلِكَ لَهُمْ خِزْيٌ فِي الدُّنْيَا وَلَهُمْ فِي الآخِرَةِ عَذَابٌ عَظِيمٌ - سورة المائدة ، قد نزلت في هؤلاء العرنيين ، وقيلت أٍسباب أخرى في نزولها ، ثم إنه وصف هؤلاء المحاربين بأوصاف يشمئز منها كل عاقل، ذلك أنه وصفهم بأنهم حرب لله تعالى ولرسوله ﷺ ، وأنهم يريدون إفساد الأرض بتخويف سكانها، وتقتيلهم وسلبهم ونهب ممتلكاتهم ظلماً وجوراً لامستند لهم ولا باعث إلا الإفساد والطغيان.';
const String p13 =
    'كان أبو رافع سلام بن أبي الحقيق من يهود بني النضير كثير التحريض على الدولة الإسلامية حتى إنه جعل لغطفان ومن حوله من قبائل مشركي العرب الجعل العظيم إن هي قامت لحرب رسول الله ﷺ ، وشاع أمر أبي رافع وانتشر وكان ممن آلب الأحزاب على رسول الله ﷺ وأصبح تحريضه على دولة الإسلام من الأخطار التي يجب أن يوضع لها الحد.';
const String p14 =
    'بعث رسول الله ﷺ إلى أبي رافع اليهودي رجالاً من الأنصار فأمر عليهم عبدالله بن عتيك ، وكان أبو رافع في حصن له فلما دنوا منه وقد غربت الشمس وراح الناس بسرحهم قال عبدالله بن عتيك لأصحابه: اجلسوا مكانكم فإني منطلق ومتلطف للبواب لعلي أن أدخل، فأقبل حتى دنا من الباب ثم تقنع بثوبه كأنه يقضي حاجة، وقد دخل الناس، فهتف به البواب: ياعبدالله إن كنت تريد أن تدخل فادخل فإني أريد أن أغلق الباب، فدخلت، فكمنت، فلما دخل الناس أغلق الباب، ثم غلّق الأغاليق على وتد قال ابن عتيك، فقمت إلى الأقاليد فأخذتها ففتحت الباب.';
const String p15 =
    'لما دخل أبو عتيك رضي الله عنه ومن معه من أفراد سريته إلى داخل الحصن وأخذوا ينتظرون الفرصة المناسبة لقتل هذا اليهودي الخبيث أبي رافع.';
const String p16 =
    'وقد جاء في البخاري: أن عبدالله بن عتيك أدرك نفراً من أصحاب أبي رافع يسمرون عنده، وكان في علالي له فكمن حتى ذهب عنه أهل سمره صعد إليه، وكلما دخل بابا أغلقه عليه، من الداخل حتى لايحول أحد بينه وبين تنفيذ العقوبة بحق أبي رافع، فانتهى إلى أبي رافع فإذا هو في بيت مظلم وسط عياله لايدري أين هو من البيت ، قال ابن عتيك: فقلت: يا أبا رافع ، قال: من هذا؟ قال: ابن عتيك، فأهويت نحو الصوت فأضربه ضربة بالسيف وأنا دهش ما أغنيت شيئاً.';
const String p17 =
    'وصاح، فخرجت من البيت فأمكث غير بعيد ثم دخلت إليه ، فقلت: ماهذا الصوت يا أبا رافع؟';
const String p18 =
    'قال: لأمك الويل إن رجلاً في البيت ضربني قبل بالسيف، قلت: فأضربه ضربة أثخنته ولم اقتله ثم وضعت ظبة السيف في بطنه حتى أخذ في ظهره فعرفت أني قتلته.';
const String p19 =
    'فجعلت أفتح الأبواب باباً باباً حتى انتهيت إلى درجة له فوضعت رجلي وأنا أرى أني قد انتهيت إلى الأرض، فوقعت في ليلة مقمرة فانكسرت ساقي فعصبتها بعمامة، ثم انطلقت حتى جلست على الباب فقلت: لا أخرج الليلة حتى أعلم أقتلته فلما صاح الديك قام الناعي على السور: أنعى أبا رافع تاجر أهل الحجاز، فانطلقت إلى أصحابي فقلت: النجاء، فقد قتل الله أبا رافع فانتهيت إلى النبي ﷺ فقال: ابسط رجلك، فبسطت رجلي فمسحها فكأنها لم أشتكها قط وفي رواية أخرى للبخاري قال عبدالله بن عتيك قلت: يا أبا رافع قال: من هذا؟ ، قال فعمدت نحو الصوت فأضربه وصاح فلم تغن شيئاً ثم جئت كأني اغيثه، فقلت: مالك يا أبا رافع وغيرت صوتي.';
const String p20 =
    'فقال: ألا أعجبك لأمك الويل دخل علي رجل فضربني بالسيف قال: فعمدت له أيضاً فأضربه أخرى فلم تغن شيئاً، فصاح وقام أهله، ثم جئت وغيرت صوتي كهيئة المغيث فإذا هو مستلق على ظهره فأضع بالسيف في بطنه ثم انكفئ عليه حتى سمعت صوت العظم.';
const String p21 =
    'وقد ذكرت كتب السيرة أن امرأة أبي رافع حينما ضرب بالسيف صاحت فأراد قتلها ثم كف عن ذلك لأن رسول الله ﷺ قد نهاهم عن قتل النساء والصبيان وأن ابن عتيك كان يرطن بلغة اليهود وأنه استخدمها مع زوجة أبي رافع اليهودي وأهل بيته.';
const String p22 =
    'ويذكر كتاب السيرة أن سرية ابن عتيك كلها شاركت في ضرب أبي رافع وأن كل واحد منهم ادعى انه ضربته كانت هي القاضية على أبي رافع، فقال رسول الله ﷺ عجلوا بأسيافكم فأتوا بأسيافهم فنظروا إليها، ثم قال: هذا قتله ، وهو سيف عبدالله بن أنيس، هذا أثر الطعام في سيف عبدالله بن أنيس وقد يتوهم القارئ الكريم أن هناك تناقضاً بين رواية البخاري ورواية كتب السيرة الأخرى التي تقول أن الضربة القاضية كانت من عبدالله بن أنيس والحق أنه ليس كذلك، ذلك لأن عبدالله بن عتيك يخبر عن نفسه وأنه غلب على ظنه أنه هو القاتل وأنه قد حكى عن دوره في ضرب اليهودي أبي رافع، ولايعني هذا أن غيره لم يشارك في قتله، إذ لم ينف هو مشاركة غيره له في قتل أبي رافع، والروايات يفسر بعضها بعضاً ويشرح بعضها بعضاً والروايات تذكر أن كل واحد من أفراد السرية كان يدعى أن ضربته هي القاضية والمميتة لأبي رافع، وقد نظر رسول الله ﷺ في دعواهم وفحص سيوفهم وحكم بعد ذلك بأن الضربة القاضية كانت بسيف عبدالله بن أنيس رضي الله عنه لظهور أثر الطعام عليه، أي أن هذا السيف قد دخل جوف أبي رافع ومزق أحشاءه وقطع أمعاءه وخلط غذاءه في جوفه.';
const String p23 =
    'فقد استطاع عبدالله بن عتيك أن يصعد إلى حصن أبي رافع وأن يخاطب امرأته وأن يدخل بيته مطمئناً لأنه خاطبه بلغته لغة اليهود في ذلك الوقت، ويؤخذ من ذلك استحباب تعلم لغة غير المسلمين لاسيما الأعداء منهم وخاصة لأولئك العسكريين الذين يذهبون لمهمات استطلاعية تجمع أخبار العدو وتزود القيادة بها، والقيادة ترسم.';
const String p24 =
    'قرر ابن عتيك أن يذهب وحيداً إلى الحصن ويحاول أن يدخله ومن ثم يفتش عن طريقة يدخل بها أفراد سريته، تصرفه العادي الذي لم يلفت انتباه أحد من الحراس، قدرته على التمويه على الحارس، وإيهامه أنه يقضي حاجته وهذا منع الحارس من النظر إليه وتفحصه وتفرسه في وجهه، مراقبة حركة الحارس الدقيقة بعد دخول الحصن وإغلاقه فقد كمن في مكان لم يشعر به الحارس وراقب الحارس حتى وضع مفتاح الحصن في مكان معين وتابعه حتى انصرف، وأخذ المفتاح وأصبح يستخدمه كيفما يشاء وفي أي وقت شاء.';
const String p25 =
    'استمر بعون من الله وعناية سبحانه أن يمشي ويبذل طاقته حتى بعد أن أصيبت رجله، وكأنه لايشكو من علة حتى إذا انتهت مهمته تماماً وأصبح غير محتاج لبذل الجهد عاد إليه الألم، وحمله أصحابه، فلما حدّث النبي ﷺ خبره قال له: ابسط رجلك، قال فبسطت رجلي فمسحها فكأنها لم اشتكها قط.';
const String p26 =
    'إن كل من فى هذه السرية كانوا من الخزرج فقد حرصوا على أن ينافسوا إخوانهم من الأوس الذين قتلوا كعب بن الأشرف فقد كانوا كفرسي رهان في المسابقة في الخيرات فهم لايتنافسون على اغتنام مظاهر الحياة الدنيا من المال والمناصب، وإنما يتسابقون إلى الفوز بمرضاة النبي ﷺ التي مآلها رضوان الله تعالى والسعادة الأخروية.';
const String p27 =
    'بلغ رسول الله ﷺ أن اليسير بن رزام أمير اليهود بخيبر بعد سلام بن أبي الحقيق، أخذ في جمع يهود الشمال وتحريضهم على رسول الله ﷺ ، ولم يكتف بذلك، بل بدأ بتأليب قبائل غطفان وجمعها لقتال رسول الله ﷺ ، وحين علم رسول الله ﷺ مايبيته اليهود له من الخديعة والمكر رأى ﷺ أن يتأكد من ذلك قبل أن يقدم على أمر ما، فأرسل عبدالله ابن رواحة في نفر من المسلمين، رواداً يكتشفون ماتخبئه يهود ومن لف لفها من مشركي العرب.';
const String p28 =
    'وقد تأكدت المخابرات النبوية من أمر اليُسير بن رِزَام وكان هذا كافياً لقيام النبي ﷺ ببعث سرية في ثلاثين راكباً عليهم عبدالله بن رواحة، وفيهم عبدالله بن أنيس، فأتوه فقالوا: أرسلنا إليك رسول الله ﷺ ليستعملك على خيبر، فلم يزالوا به حتى تبعهم في ثلاثين رجلاً مع كل رجل منهم رديف من المسلمين، وكان هو رديف عبدالله بن أنيس على بعيره، حتى إذا كانوا بَقْرقَرة ثيار على ستة أميال من خيبر، ندم اليسير على مسيره إلى رسول الله ﷺ ، فأهوى بيده على سيف رديفه ابن أنيس، ففطن له، فاقتحم به، ثم ضربه بالسيف، فقطع رجله وضربه اليسير بِمِخْرَش - شبه المقرعة يضرب به - في يده من شواحط ، فضرب به وجه عبدالله فجرحه في رأسه ، ومال كل رجل من المسلمين على رديفه من اليهود فقتله، إلا رجلاً واحداً أفلت على رجليه، فلما قدم ابن أنيس على رسول الله ﷺ تفل على شجنه، فلم تقح ولم تؤذه.';
const String p29 = 'وكانت هذه السرية في شوال سنة ست من الهجرة.';
const String p30 =
    'كانت الخطة النبوية هي محاولة إيقاف نهر الدم بين اليهود والمسلمين ابتداءً، فقد كان دور عبدالله بن رواحة في هذا الاتجاه، غير أن الحقد اليهودي الذي أشرب قلوبهم والسم الذي ينفثونه على المسلمين، هو الذي غلب آخر الأمر، وأفسد الخطة كلها، فقد حاولوا الغدر بالمسلمين فوقعت الدائرة عليهم.';
const String p31 =
    'إن البأس في الحرب مالم تكن غليظة وشديدة، فلن تحسم المواجهة مع العدو، وستجعل الحرب تفنى كل شيء وتأكل كل شيء، فلابد من بث الرهبة والرعب في قلب العدو، ولابد من الشدة معه حين لايجدي الحوار أو المناقشة، ولابد من الغلظة التي تشعر العدو أن من يقاتله لايخشى في الله لومة لائم.';
const String p32 =
    'شهد العام السادس من الهجرة تصعيداً عنيفاً في عمليات المواجهة مع العدو، ولايكاد يمر شهر دون سرية أو سريتين تضرب في الصحراء، وتفض جمعاً أو تحطم عدواً أو تغتال طاغوتاً، فقد كان شعار المرحلة: الآن نغزوهم ولايغزونا، فقد كان حزب الله ينطلق في الآفاق باسم الله، يحمل المبادئ الخالدة والقيم العليا يقدمها للخلق كافة، ويزيح كل طاغوت يحول دون وصول هذه المبادئ، ونشهد حزب الله في أفراده جميعاً والذين تلقوا أعلى مستويات التربية الخلقية والفكرية والعسكرية والسياسية، كيف ينفذون هذا المنهج وكيف يكون واقعهم ترجمة عملية وحية لمبادئهم، وكيف يتقدمون ليتصدروا مرحلة جديدة تبدأ معالمها وملامحها مع صلح الحديبية.';
