const int sectionIndex = 12;
const String sectionTitle = 'الجهر بالدعوة بين الناس';

const List t1 = ['1', 'على جبل الصفا'];
const List t2 = ['2', 'إعلان الدعوة بين الناس'];
const List t3 = ['3', 'اعتراضات زعماء الشرك'];
const List t4 = ['4', 'كفرهم بالآخرة'];
const List t5 = ['5', 'اعتراضهم على الرسول ﷺ'];
const List t6 = ['6', 'موقفهم من القرآن الكريم'];
const List t7 = ['7', 'تحدى اللَّه لهم'];

const String p1 =
    'بعد الإعداد العظيم الذي قام به النبي ﷺ لتربية أصحابه وبناء الجماعة المسلمة المنظمة الأولى على أسس عقدية وتعبدية وخلقية رفيعة المستوى حان موعد إعلان الدعوة بنزول قول الله تعالى: فَلَا تَدْعُ مَعَ اللَّهِ إِلَٰهًا آخَرَ فَتَكُونَ مِنَ الْمُعَذَّبِينَ وَأَنذِرْ عَشِيرَتَكَ الْأَقْرَبِينَ وَاخْفِضْ جَنَاحَكَ لِمَنِ اتَّبَعَكَ مِنَ الْمُؤْمِنِينَ فَإِنْ عَصَوْكَ فَقُلْ إِنِّي بَرِيءٌ مِّمَّا تَعْمَلُونَ - سورة الشعراء';
const String p2 =
    'صعد النبي ﷺ على الصفا فجعل ينادي: يابني فهر، يابني عدي -لبطون قريش- حتى أجتمعوا، فجعل الرجل إذا لم يستطع أن يخرج أرسل رسولا لينظر ماهو فجاء أبو لهب وقريش فقال: أرأيتكم لو أخبرتكم أن خيلا بالوادي تريد أن تغير عليكم أكنتم مصدقي؟ قالوا: نعم ماجربنا منك فقط طبققاً، قال: فإني نذير لكم بين يدي عذاب شديد فقال أبو لهب: تباً لك سائر اليوم الهذا جمعتنا؟ فنزلت: تبت يدا أبي لهب وتب ما أغنى عنه ماله وما كسب - سورة المسد';
const String p3 =
    'ولما تمت هذه المرحلية الطبيعية البدائية وتحققت شهادة المستمعين قال رسول الله ﷺ : فإني نذير لكم بين يدي عذاب شديد وكان ذلك تعريفا بمقام النبوة وماينفرد به من علم بالحقائق الغيبية والعلوم الوهبية وموعظة وانذارا، في حكمة وبلاغة لانظير لهما في تاريخ الديانات والنبوات فلم تكن طريق أقصر من هذا الطريق ولا أسلوب أوضح من هذا الأسلوب فسكت القوم ولكن أبا لهب قال : تبا لك سائر اليوم أما دعوتنا إلا لهذا؟ وبهذا كان النبي ﷺ قد وضع للأمة أسس الأعلام فقد اختار مكاناً عالياً وهو الجبل ليقف عليه وينادي على جميع لناس فيصل صوته إلى الجميع، وهذا ماتفعله محطات الإرسال في عصرنا الحديث لتزيد من عملية الانتشار الإذاعي، ثم اختار لدعوته الأساس المتين ليبني عليه كلامه وهو الصدق وبهذا يكون ﷺ قد علم رجال الإعلام والدعوة أن الإتصال بالناس بهدف إعلامهم أو دعوتهم، يجب أن يؤكد وبصفة أساسية على الثقة التامة بين المرسل والمستقبل.';
const String p4 =
    'ثم جاءت مرحلة أخرى بعدها، فأصبح يدعو فيها كل من يلتقي به من الناس على اختلاف قبائلهم وبلدانهم ويتبع الناس في أنديتهم، ومجامعهم ومحافلهم، وفي المواسم ومواقف الحج ويدعو من لقيه من حر وعبد، وقوي وضعيف وغني وفقير حين نزول قوله تعالى: فَاصْدَعْ بِمَا تُؤْمَرُ وَأَعْرِضْ عَنِ الْمُشْرِكِينَ إِنَّا كَفَيْنَاكَ الْمُسْتَهْزِئِينَ الَّذِينَ يَجْعَلُونَ مَعَ اللَّهِ إِلَٰهًا آخَرَ فَسَوْفَ يَعْلَمُونَ وَلَقَدْ نَعْلَمُ أَنَّكَ يَضِيقُ صَدْرُكَ بِمَا يَقُولُونَ فَسَبِّحْ بِحَمْدِ رَبِّكَ وَكُن مِّنَ السَّاجِدِينَ وَاعْبُدْ رَبَّكَ حَتَّىٰ يَأْتِيَكَ الْيَقِينُ - سورة الحجر';
const String p5 =
    'وكانت النتيجة لهذا الصدع هي الصد والإعراض والسخرية والإيذاء والتكذيب والكيد المدبر المدروس، وقد اشتد الصراع بين النبي ﷺ وصحبه وبين شيوخ الوثنية وزعمائها وأصبح الناس في مكة يتناقلون أخبار ذلك الصراع في كل مكان وكان هذا في حد ذاته مكسب عظيم للدعوة، ساهم فيه أشد وألد أعدائها ممن كان يشيعون في القبائل قالة السوء عنها فليس كل الناس يسلمون بدعاوى زعماء الكفر والشرك.';
const String p6 =
    'كانت الوسيلة الإعلامية في ذلك العصر تناقل الناس للأخبار مشافهة وسمع القاصي والداني بنبوة الرسول ﷺ وصار هذا الحدث العظيم حديث الناس في المجالس ونوادي القبائل، وفي بيوت الناس.';
const String p7 =
    'لم يكن كفار مكة ينكرون بأن الله خلقهم وخلق كل شيء، قال تعالى: وَلَئِنْ سَأَلْتَهُمْ مَنْ خَلَقَ السَّمَوَاتِ وَالأَرْضَ لَيَقُولُنَّ اللَّهُ قُلِ الْحَمْدُ لِلَّهِ بَلْ أَكْثَرُهُمْ لاَ يَعْلَمُونَ، لكنهم كانوا يعبدون الأصنام ويزعمون أنها تقربهم إلى الله قال تعالى: أَلاَ لِلَّهِ الدِّينُ الْخَالِصُ وَالَّذِينَ اتَّخَذُوا مِنْ دُونِهِ أَوْلِيَاءَ مَا نَعْبُدُهُمْ إِلاَّ لِيُقَرِّبُونَا إِلَى اللَّهِ زُلْفَى إِنَّ اللَّهَ يَحْكُمُ بَيْنَهُمْ فِي مَا هُمْ فِيهِ يَخْتَلِفُونَ إِنَّ اللَّهَ لاَ يَهْدِي مَنْ هُوَ كَاذِبٌ كَفَّارٌ -سورة الزمر، ومطالبة المشركين باتباع الحق وعدم القول بالظنون والأوهام قال تعالى: إِنَّ الَّذِينَ لاَ يُؤْمِنُونَ بِالآخِرَةِ لَيُسَمُّونَ الْمَلاَئِكَةَ تَسْمِيَةَ الأُنْثَى وَمَا لَهُمْ بِهِ مِنْ عِلْمٍ إِنْ يَتَّبِعُونَ إِلاَّ الظَّنَّ وَإِنَّ الظَّنَّ لاَ يُغْنِي مِنَ الْحَقِّ شَيْئًا - سورة النجم';
const String p8 =
    'أما دعوة الرسول ﷺ إلى الإيمان باليوم الآخر فقد قابلها المشركون بالسخرية والتكذيب قال تعالى: وَقَالَ الَّذِينَ كَفَرُوا هَلْ نَدُلُّكُمْ عَلَى رَجُلٍ يُنَبِّئُكُمْ إِذَا مُزِّقْتُمْ كُلَّ مُمَزَّقٍ إِنَّكُمْ لَفِي خَلْقٍ جَدِيدٍ أَفْتَرَى عَلَى اللَّهِ كَذِبًا أَمْ بِهِ جِنَّةٌ بَلِ الَّذِينَ لاَ يُؤْمِنُونَ بِالآخِرَةِ فِي الْعَذَابِ وَالضَّلاَلِ الْبَعِيدِ - سورة سبإ';
const String p9 =
    'فقد كانوا ينكرون بعث الموتى قال تعالى: وَقَالُوا إِنْ هِيَ إِلاَّ حَيَاتُنَا الدُّنْيَا وَمَا نَحْنُ بِمَبْعُوثِينَ ويقسمون على ذلك الإيمان المغلظة قال تعالى: وَأَقْسَمُوا بِاللَّهِ جَهْدَ أَيْمَانِهِمْ لاَ يَبْعَثُ اللَّهُ مَنْ يَمُوتُ بَلَى وَعْدًا عَلَيْهِ حَقًّا وَلَكِنَّ أَكْثَرَ النَّاسِ لاَ يَعْلَمُونَ لِيُبَيِّنَ لَهُمُ الَّذِي يَخْتَلِفُونَ فِيهِ وَلِيَعْلَمَ الَّذِينَ كَفَرُوا أَنَّهُمْ كَانُوا كَاذِبِينَ، وكانوا يظنون أنه لاتوجد حياة في غير الدنيا ويطلبون إحياء آبائهم ليصدقوا بالآخرة قال تعالى: وَقَالُوا مَا هِيَ إِلاَّ حَيَاتُنَا الدُّنْيَا نَمُوتُ وَنَحْيَا وَمَا يُهْلِكُنَا إِلاَّ الدَّهْرُ وَمَا لَهُمْ بِذَلِكَ مِنْ عِلْمٍ إِنْ هُمْ إِلاَّ يَظُنُّونَ - سورة النحل';
const String p10 =
    'اعترضوا على شخص الرسول ﷺ فقد كانوا يتصورون أن الرسول لايكون بشراً مثلهم، وأنه ينبغي أن يكون ملكاً، أو مصحوباً بالملائكة ، قال تعالى: وَقَالُوا مَالِ هَذَا الرَّسُولِ يَأْكُلُ الطَّعَامَ وَيَمْشِي فِي الأَسْوَاقِ لَوْلاَ أُنْزِلَ إِلَيْهِ مَلَكٌ فَيَكُونَ مَعَهُ نَذِيرًا أَوْ يُلْقَى إِلَيْهِ كَنْزٌ أَوْ تَكُونُ لَهُ جَنَّةٌ يَأْكُلُ مِنْهَا وَقَالَ الظَّالِمُونَ إِنْ تَتَّبِعُونَ إِلاَّ رَجُلاً مَسْحُورًا - سورة الفرقان';
const String p11 =
    'ويريدون أن يكون الرسول كثير المال كبيراً في أعينهم قال تعالى: وَقَالُوا لَوْلاَ نُزِّلَ هَذَا الْقُرْءانُ عَلَى رَجُلٍ مِنَ الْقَرْيَتَيْنِ عَظِيمٍ، ويريدون الوليد بن المغيرة بمكة وعروة بن مسعود الثقفي بالطائف.';
const String p12 =
    'ونسبوا الرسول ﷺ السحر والكذب قال تعالى : وَعَجِبُوا أَنْ جَاءَهُمْ مُنْذِرٌ مِنْهُمْ وَقَالَ الْكَافِرُونَ هَذَا سَاحِرٌ كَذَّابٌ، وقال تعالى :نَحْنُ أَعْلَمُ بِمَا يَسْتَمِعُونَ بِهِ إِذْ يَسْتَمِعُونَ إِلَيْكَ وَإِذْ هُمْ نَجْوَى إِذْ يَقُولُ الظَّالِمُونَ إِنْ تَتَّبِعُونَ إِلاَّ رَجُلاً مَسْحُورًا انْظُرْ كَيْفَ ضَرَبُوا لَكَ الأَمْثَالَ فَضَلُّوا فَلاَ يَسْتَطِيعُونَ سَبِيلاً - سورة الإسراء';
const String p13 =
    'كذلك لم يصدقوا أن القرآن الكريم منزل من الله واعتبروه ضرباً من الشعر الذي كان ينظمه الشعراء مع أن كل من قارن بين القرآن وبين أشعار العرب يعلم أنه مختلف عنها قال تعالى : وَمَا عَلَّمْنَاهُ الشِّعْرَ وَمَا يَنْبَغِي لَهُ إِنْ هُوَ إِلاَّ ذِكْرٌ وَقُرْءَانٌ مُبِين لِيُنْذِرَ مَنْ كَانَ حَيًّا وَيَحِقَّ الْقَوْلُ عَلَى الْكَافِرِينَ، وكيف يكون القرآن شعراً وقد نزل فيه ذم للشعراء الذين يضلون الناس ويقولون خلاف الحقيقة قال تعالى : وَالشُّعَرَاءُ يَتَّبِعُهُمُ الْغَاوُونَ أَلَمْ تَرَ أَنَّهُمْ فِي كُلِّ وَادٍ يَهِيمُونَ وَأَنَّهُمْ يَقُولُونَ مَا لاَ يَفْعَلُونَ - سورة الشعراء';
const String p14 =
    'واعترضوا على طريقة نزول القرآن، فطلبوا أن ينزل جملة واحدة مع أن نزوله مفرِّقاً أدعى لتثبيت قلوب المؤمنين به وتيسير فهمه وحفظه وامتثاله قال تعالى: وَقَالَ الَّذِينَ كَفَرُوا لَوْلاَ نُزِّلَ عَلَيْهِ الْقُرْءَانُ جُمْلَةً وَاحِدَةً كَذَلِكَ لِنُثَبِّتَ بِهِ فُؤَادَكَ وَرَتَّلْنَاهُ تَرْتِيلاً - سورة الفرقان';
const String p15 =
    'فلما اعترض المشركون على القرآن وعلى من أنزل عليه بهذه الاعتراضات تحداهم الله بأن يأتوا بمثله وأعلن عن عجز الإنسان والجن مجتمعين عن ذلك قال تعالى: قُلْ لَئِنِ اجْتَمَعَتِ الإِنْسُ وَالْجِنُّ عَلَى أَنْ يَأْتُوا بِمِثْلِ هَذَا الْقُرْءَانِ لاَ يَأْتُونَ بِمِثْلِهِ وَلَوْ كَانَ بَعْضُهُمْ لِبَعْضٍ ظَهِيرًا - سورة الإسراء';
const String p16 =
    'بل هم عاجزون عن أن يأتوا بعشر سور مثله قال تعالى: أَمْ يَقُولُونَ افْتَرَاهُ قُلْ فَأْتُوا بِعَشْرِ سُوَرٍ مِثْلِهِ مُفْتَرَيَاتٍ وَادْعُوا مَنِ اسْتَطَعْتُمْ مِنْ دُونِ اللَّهِ إِنْ كُنْتُمْ صَادِقِينَ فَإِنْ لَمْ يَسْتَجِيبُوا لَكُمْ فَاعْلَمُوا أَنَّمَا أُنْزِلَ بِعِلْمِ اللَّهِ وَأَنْ لاَ إِلَهَ إِلاَّ هُوَ فَهَلْ أَنْتُمْ مُسْلِمُونَ - سورة هود';
const String p17 =
    'وحتى السورة الواحدة هم عاجزون عنها قال تعالى: وَمَا كَانَ هَذَا الْقُرْءَانُ أَنْ يُفْتَرَى مِنْ دُونِ اللَّهِ وَلَكِنْ تَصْدِيقَ الَّذِي بَيْنَ يَدَيْهِ وَتَفْصِيلَ الْكِتَابِ لاَ رَيْبَ فِيهِ مِنْ رَبِّ الْعَالَمِينَ أَمْ يَقُولُونَ افْتَرَاهُ قُلْ فَأْتُوا بِسُورَةٍ مِثْلِهِ وَادْعُوا مَنِ اسْتَطَعْتُمْ مِنْ دُونِ اللَّهِ إِنْ كُنْتُمْ صَادِقِينَ - سورة يونس';
