const int sectionIndex = 27;
const String sectionTitle = 'اليهود في المدينة';

const List t1 = ['1', 'الحملات الإعلامية لليهود'];
const List t2 = ['2', 'تصديع الجبهة الداخلية'];
const List t3 = ['3', 'سوء أدبهم مع رسول الله ﷺ'];
const List t4 = ['4', 'دعم حزب المنافقين'];
const List t5 = ['5', 'سمات اليهود'];
const List t6 = ['6', 'إن الله لايصلح عمل المفسدين'];
const List t7 = ['7', 'مكر اليهود'];
const List t8 = ['8', 'إِن كَيد الشيطانِ كان ضعِيفا'];
const List t9 = ['9', 'الفئة المؤمنة الصابرة'];

const String p1 =
    'قد شن اليهود على رسول الله ﷺ والذين آمنوا معه حملات اعلامية لتشويه صورة الرسول ﷺ وتنفير الناس منه، ونزع الثقة بينه وبين الناس، لقد شعر اليهود بخطورة هذا الدين على مصالحهم، وعلى عقيدتهم المنحرفة المزيفة القائمة على الاستعلاء واحتقار الناس عدا الجنس اليهودي، لقد جاء ينادي بعقيدة التوحيد وهم يقولون عزير ابن الله وجاء ينادي بالمساواة بين أفراد الجنس البشري وأنه لايعلو شعب على شعب ولاجماعة على جماعة، وهم يرون أنهم شعب الله المختار، يترفعون عن بقية الأجناس وينظرون إليهم على أنهم دونهم وأقل منهم ولذلك لم يلتزموا ببنود الوثيقة وشرعوا في التشكيك في نبوة الرسول ﷺ ورسالته وأكثروا من الأسئلة لإحراج رسول الله ﷺ وخدعوا المؤمنين ودلسوا عليهم.';
const String p2 =
    'ومن وسائلهم الخبيثة في حرب الإسلام محاولاتهم المستمرة لتمزيق الصف المسلم وتخريبه، بتقطيع أواصر المحبة بين المسلمين وذلك بإثارة الفتن الداخلية ،فقد مَرّ شأس بن قيس وكان شيخاً قد عسا - كبرت سنه - عظيم الكفر شديد الضِّغن على المسلمين شديد الحسد لهم، على نفرمن أصحاب رسول الله ﷺ من الأوس والخزرج في مجلس قد جمعهم يتحدثون فيه، فغاظه مارأى من ألفتهم وجماعتهم، وصلاح ذات بينهم على الإسلام، بعد الذي كان بينهم في الجاهلية فقال: قد اجتمع ملأ بني قيلة - الأوس والخزرج - بهذه البلاد لا والله مالنا معهم إذا اجتمع ملؤهم بها من قرار، فأمر فتى شابا من يهود كان معهم فقال: أعمد إليهم، فاجلس معهم ثم اذكر يوم من بُعاث وماكان قبله وكان يوم بعاث يوما اقتتلت فيه الأوس والخزرج.';
const String p3 =
    'فتكلم القوم عند ذلك وتنازعوا وتفاخروا حتى توائب رجلان من الحيين على الرُّكب: أوس بن قيظي أحد بني حارثة ابن الحارث من الأوس وجبار بن صخر أحد بني سلمة من الخزرج، فتقاولا ثم قال أحدهما لصاحبه: إن شئتم رددناها الآن جذعة، فغضب الفريقان جميعاً وقالوا قد فعلنا، موعدكم الظاهرة -الحرّة- السلاح السلاح فخرجوا إليها.';
const String p4 =
    'فبلغ ذلك رسول الله ﷺ فخرج إليهم، فيمن معه من أصحابه المهاجرين حتى جاءهم، فقال: يامعشر المسلمين الله الله أبدعوى الجاهلية وأنا بين أظهركم فعرف القوم أنها نزغة من الشيطان وكيد من عدوهم فبكوا وعانق الرجال من الأوس والخزرج بعضهم بعضاً.';
const String p5 =
    'وأنزل الله تعالى : يَاأَيُّهَا الَّذِينَ ءَامَنُوا إِنْ تُطِيعُوا فَرِيقًا مِنَ الَّذِينَ أُوتُوا الْكِتَابَ يَرُدُّوكُمْ بَعْدَ إِيمَانِكُمْ كَافِرِينَ وَكَيْفَ تَكْفُرُونَ وَأَنْتُمْ تُتْلَى عَلَيْكُمْ ءَايَاتُ اللَّهِ وَفِيكُمْ رَسُولُهُ وَمَنْ يَعْتَصِمْ بِاللَّهِ فَقَدْ هُدِيَ إِلَى صِرَاطٍ مُسْتَقِيمٍ يَاأَيُّهَا الَّذِينَ ءَامَنُوا اتَّقُوا اللَّهَ حَقَّ تُقَاتِهِ وَلا تَمُوتُنَّ إِلا وَأَنْتُمْ مُسْلِمُون وَاعْتَصِمُوا بِحَبْلِ اللَّهِ جَمِيعًا وَلا تَفَرَّقُوا وَاذْكُرُوا نِعْمَةَ اللَّهِ عَلَيْكُمْ إِذْ كُنْتُمْ أَعْدَاءً فَأَلَّفَ بَيْنَ قُلُوبِكُمْ فَأَصْبَحْتُمْ بِنِعْمَتِهِ إِخْوَانًا وَكُنْتُمْ عَلَى شَفَا حُفْرَةٍ مِنَ النَّارِ فَأَنْقَذَكُمْ مِنْهَا كَذَلِكَ يُبَيِّنُ اللَّهُ لَكُمْ ءَايَاتِهِ لَعَلَّكُمْ تَهْتَدُونَ - سورة آل عمران';
const String p6 =
    'وكان اليهود يسيئون الأدب مع رسول الله ﷺ في حضرته وأثناء خطابه، إذ يلمزونه ويحيونه بتحية فيها من الأذى والتهجم مايدل على سوء أخلاقهم فعن عائشة رضي الله عنها قالت: جاء ناس من اليهود إلى رسول الله ﷺ فقالوا: السام عليك يا أبا القاسم فقلت: السام عليكم وفعل الله بكم فقال رسول الله ﷺ : مه يا عائشة، فإن الله لا يحب الفحش ولا التفحش فقلت: يارسول الله، ترى مايقولون؟ فقال:ألست تريني أرد عليهم مايقولون؟ وأقول: وعليكم قالت: فنزلت هذه الآية في ذلك وهي قوله تعالى: أَلَمْ تَرَ إِلَى الَّذِينَ نُهُوا عَنِ النَّجْوَى ثُمَّ يَعُودُونَ لِمَا نُهُوا عَنْهُ وَيَتَنَاجَوْنَ بِالإِثْمِ وَالْعُدْوَانِ وَمَعْصِيَةِ الرَّسُولِ وَإِذَا جَاءُوكَ حَيَّوْكَ بِمَا لَمْ يُحَيِّكَ بِهِ اللَّهُ وَيَقُولُونَ فِي أَنْفُسِهِمْ لَوْلا يُعَذِّبُنَا اللَّهُ بِمَا نَقُولُ حَسْبُهُمْ جَهَنَّمُ يَصْلَوْنَهَا فَبِئْسَ الْمَصِيرُ - سورة المجادلة';
const String p7 =
    'حدثنا القرآن الكريم عن قيادة اليهود الفكرية لحزب المنافقين فهم شياطين المنافقين يخططون لهم، ويوجهونهم ويدّرسونهم أساليب الكيد والمكر والخداع والدهاء وإثارة الفتن قال تعالى: وَإِذَا لَقُوا الَّذِينَ ءَامَنُوا قَالُوا ءَامَنَّا وَإِذَا خَلَوْا إِلَى شَيَاطِينِهِمْ قَالُوا إِنَّا مَعَكُمْ إِنَّمَا نَحْنُ مُسْتَهْزِئُونَ - سورة البقرة';
const String p8 =
    'وكان اليهود في المدينة يتآمرون مع المنافقين ضد المسلمين وفي هذا التآمر قال تعالى: بَشِّرِ الْمُنَافِقِينَ بِأَنَّ لَهُمْ عَذَابًا أَلِيمًا الَّذِينَ يَتَّخِذُونَ الْكَافِرِينَ أَوْلِيَاءَ مِنْ دُونِ الْمُؤْمِنِينَ أَيَبْتَغُونَ عِنْدَهُمُ الْعِزَّةَ فَإِنَّ الْعِزَّةَ لِلَّهِ جَمِيعًا - سورة النساء، وقال تعالى: إِنَّ الَّذِينَ ارْتَدُّوا عَلَى أَدْبَارِهِمْ مِنْ بَعْدِ مَا تَبَيَّنَ لَهُمُ الْهُدَى الشَّيْطَانُ سَوَّلَ لَهُمْ وَأَمْلَى لَهُمْ ذَلِكَ بِأَنَّهُمْ قَالُوا لِلَّذِينَ كَرِهُوا مَا نَزَّلَ اللَّهُ سَنُطِيعُكُمْ فِي بَعْضِ الأَمْرِ وَاللَّهُ يَعْلَمُ إِسْرَارَهُمْ - سورة محمد، وقال تعالى: أَلَمْ تَرَ إِلَى الَّذِينَ تَوَلَّوْا قَوْمًا غَضِبَ اللَّهُ عَلَيْهِمْ مَا هُمْ مِنْكُمْ وَلا مِنْهُمْ وَيَحْلِفُونَ عَلَى الْكَذِبِ وَهُمْ يَعْلَمُونَ صدق الله العظيم أَعَدَّ اللَّهُ لَهُمْ عَذَابًا شَدِيدًا إِنَّهُمْ سَاءَ مَا كَانُوا يَعْمَلُونَاتَّخَذُوا أَيْمَانَهُمْ جُنَّةً فَصَدُّوا عَنْ سَبِيلِ اللَّهِ فَلَهُمْ عَذَابٌ مُهِينٌ - سورة المجادلة';
const String p9 =
    'الرشوة: إن من سمات اليهود في معالم مجتمعاتهم بحثهم عن تحقيق الغاية التي ينشدونها بشتى السبل والوسائل، ولو كانت مخالفة لشرعهم، كدفع الرشوة والمال الحرام، فأكل السحت من رشوة ومال حرام من طباعهم وقد وصفهم الحق سبحانه وتعالى: سَمَّاعُونَ لِلْكَذِبِ أَكَّالُونَ لِلسُّحْتِ فَإِنْ جَاءُوكَ فَاحْكُمْ بَيْنَهُمْ أَوْ أَعْرِضْ عَنْهُمْ وَإِنْ تُعْرِضْ عَنْهُمْ فَلَنْ يَضُرُّوكَ شَيْئًا وَإِنْ حَكَمْتَ فَاحْكُمْ بَيْنَهُمْ بِالْقِسْطِ إِنَّ اللَّهَ يُحِبُّ الْمُقْسِطِينَ - سورة المائدة';
const String p10 =
    'الحسد: قال تعالى: وَدَّ كَثِيرٌ مِنْ أَهْلِ الْكِتَابِ لَوْ يَرُدُّونَكُمْ مِنْ بَعْدِ إِيمَانِكُمْ كُفَّارًا حَسَدًا مِنْ عِنْدِ أَنْفُسِهِمْ مِنْ بَعْدِ مَا تَبَيَّنَ لَهُمُ الْحَقُّ فَاعْفُوا وَاصْفَحُوا حَتَّى يَأْتِيَ اللَّهُ بِأَمْرِهِ إِنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ - سورة البقرة';
const String p11 =
    'الغرور والتكبر: قال تعالى: وَقَالُوا لَنْ يَدْخُلَ الْجَنَّةَ إِلا مَنْ كَانَ هُودًا أَوْ نَصَارَى تِلْكَ أَمَانِيُّهُمْ قُلْ هَاتُوا بُرْهَانَكُمْ إِنْ كُنْتُمْ صَادِقِينَ - سورة البقرة';
const String p12 =
    'البخل: فكانوا يأتون رجالاً من الأنصار ويقولون لهم: لاتنفقوا أموالكم فإنا نخشى عليكم الفقر في ذهابها، ولاتسارعوا في النفقة، فإنكم لاتدرون علام يكون، فأنزل الله فيهم: الَّذِينَ يَبْخَلُونَ وَيَأْمُرُونَ النَّاسَ بِالْبُخْلِ وَيَكْتُمُونَ مَا ءَاتَاهُمُ اللَّهُ مِنْ فَضْلِهِ وَأَعْتَدْنَا لِلْكَافِرِينَ عَذَابًا مُهِينًا - سورة النساء';
const String p13 =
    'هذه بعض الصفات التي تجسدت في الشخصية اليهودية والتي أشار القرآن الكريم إليها، لنعرف اليهود على حقيقتهم حتى لاينغر المسلمون بهم في أي وقت أو أي زمان أو أي مكان.';
const String p14 =
    'إن هذه الوثيقة وضحت مدى العدالة التي تميزت بها معاملة النبي ﷺ لليهود وأعطت لمواطني الدولة مفهوم الحرية الدينية وضربت عرض الحائط مبدأ التعصب ومصادرة الأفكار والمعتقدات ولم تكن المسألة مسألة تكتيك مرحلي ريثما يتسنى للرسول ﷺ تصفية أعدائه في الخارج لكي يبدأ تصفية أخرى إزاء أولئك الذين عاهدهم .. وحاشاه وإنما صدر هذا الموقف وفق سياسة إسلامية منبثقة من شريعة ربانية.';
const String p15 =
    'لقد عقد الرسول ﷺ مع اليهود المعاهدات التي تؤمن لهم الحياة الكريمة، في ظل الدولة الإسلامية بحكم أنهم أهل كتاب أهل الذمة ولكن طبيعة اليهود الغدر والخيانة وعدم الوفاء، ولم يستطيعوا - ولن يستطيعوا لؤما وخسة - أن يتخلوا عن تلك الصفات الذميمة فنقضوا عهودهم مع رسول الله ﷺ ، وكانت نهايتهم بما يتلاءم مع تلك الأفعال حيث أجلى رسول الله ﷺ بني قينقاع وبني النضير وقتل رجال بني قريظة، وهذا ماسوف نراه بإذن الله تعالى في هذا الكتاب ولقد أشار القرآن الكريم إلى طبيعة اليهود مع العهود، فقال تعالى: الَّذِينَ عَاهَدْتَ مِنْهُمْ ثُمَّ يَنْقُضُونَ عَهْدَهُمْ فِي كُلِّ مَرَّةٍ وَهُمْ لا يَتَّقُونَ - سورة الأنفال';
const String p16 =
    'كان مكر اليهود في غاية الدهاء تكاد تزول منه الجبال، ولكنه لم يفلح مع الرعيل الأول بسبب القيادة النبوية والمنهج الرباني الذي سار عليه رسول الله ﷺ ، إن المسلمين اليوم يتساقطون أمام المخططات اليهودية ومؤامراتها لبعدهم عن المنهاج النبوي في تربية الأمة وكيفية التعامل مع اليهود، فالأمة في أشد الحاجة للقيادة الربانية الحكيمة الواعية الموفقة من عند الله، الخبيرة بأخلاق اليهود وصفاتهم فتتعامل معهم معاملة واعية مستمدة أصولها من السياسة النبوية الراشدة في التعامل مع هذا الصنف المنحرف من البشر.';
const String p17 =
    'إن في عصرنا هذا تغلفت الأصابع اليهودية القذرة في مجالات عديدة من حياة الشعوب والدول، تلك الأصابع التي تهدف إلى غاية محدودة هي الفساد في الأرض وهذا هو التعبير القرآني: وَيَسْعَوْنَ فِي الأَرْضِ - سورة المائدة';
const String p18 =
    'إن استعمال الفعل المضارع في الجملة يدل على التجدد والاستمرار، فليس سعيهم للفساد مرحلة تاريخية انتهت لكنه قدرهم الكوني إلى يوم يبعثون، وقد استطاع اليهود أن يهيمنوا على كثير من مقدرات الأمم من خلال كيدهم المدروس وفي غيبة الوجود الإسلامي القادر على إحباط مؤامراتهم وفضح ألاعيبهم.';
const String p19 =
    'إن العبقرية اليهودية في الهدم والتخريب ليست موضع جدل، تلك العبقرية التي تستغل الأحداث وتستثمرها لصالحها إن لليهود وجود مؤثر في الدول الكبرى اقتصادياً وسياسياً وإعلامياً ولم يكونوا غائبين في النظامين العالميين الرأسمالية والشيوعية ولا عن الثورات الكبرى في العالم، وهناك عدد من المنظمات العالمية تبذل جهداً ضخماً في تحقيق أهداف اليهود أبرزها الماسونية و الليونز و الروتاري و شهوديهوه ... الخ';
const String p20 =
    'إن إحساس الناس بأن كل شيء مدبر ومبيت ومدروس من قبل اليهود أو محافلهم يقعد بهم عن المقاومة والمواجهة والجهاد، ومايقال عن اليهود يمكن أن يقال عن أي عدو آخر ينتهج سياسة الإرهاب الفكري والعسكري، فمثلاً الجماعات الباطنية في العالم الإسلامي التي أصبحت ذات وجود قوي في عدد من المواقع والدول بل وأصبح لهم وجود قائم بذاته في أكثر من بلد إسلامي.';
const String p21 =
    'هذه الجماعات تجد أحياناً من يهول من شأنها ويعطيها أكبر من حجمها، فكل من يتحدث مثلاً عن هذه الفئة الغالية المنحرفة أو يكتب أو يحاضر فهو مهدد في رزقه وحياته إذن فيسكت الجميع حفاظاً على أرزاقهم وأرواحهم، إن هذا التضخيم الرهيب لأعدائنا اليهود ليس له حقيقة لأن أولياء الشيطان كيدهم مهما عظم وكبر ضعيف قال تعالى: الَّذِينَ ءَامَنُوا يُقَاتِلُونَ فِي سَبِيلِ اللَّهِ وَالَّذِينَ كَفَرُوا يُقَاتِلُونَ فِي سَبِيلِ الطَّاغُوتِ فَقَاتِلُوا أَوْلِيَاءَ الشَّيْطَانِ إِنَّ كَيْدَ الشَّيْطَانِ كَانَ ضَعِيفًا - سورة النساء';
const String p22 =
    'إن قوتهم بسبب ضعف إيماننا وبعدنا عن منهج ربنا، لأن الإيمان الصحيح تنهار أمامه جميع المؤامرات وتفشل جميع الخطط، لكن لابد من نزع عنصر الخوف الذي قتل كثيراً من الهمم وأحبط كثيراً من الأعمال والأحداث تؤكد أن الوهم قد يقتل.';
const String p23 =
    'وحين توجد الفئة المؤمنة الصابرة يتحطم الكيد كله يهودياً كان أم غير يهودي أمام عوامل التصدي والنهوض قال تعالى: إِنْ تَمْسَسْكُمْ حَسَنَةٌ تَسُؤْهُمْ وَإِنْ تُصِبْكُمْ سَيِّئَةٌ يَفْرَحُوا بِهَا وَإِنْ تَصْبِرُوا وَتَتَّقُوا لا يَضُرُّكُمْ كَيْدُهُمْ شَيْئًا إِنَّ اللَّهَ بِمَا يَعْمَلُونَ مُحِيطٌ - سورة آل عمران، وهذا لايعني تجاهل قوة العدو أو التقليل من شأنه، حتى لو كان عدواً حقيراً، فضلاً عن عدو مدجج وقديماً، والمطلوب أن نسلك طريق الاعتدال في تقدير حجم العدو فلا نبالغ في تهويل قوته بما يوهن قوانا ويفتت عزيمتنا ويسوغ لنا الهزيمة وفي المقابل لانستهين به أو نتجاهل وجوده، وستمضي في اليهود وغيرهم سنة الله تعالى: إِنَّ اللَّهَ لا يُصْلِحُ عَمَلَ الْمُفْسِدِينَ - سورة يونس';
