const int sectionIndex = 76;
const String sectionTitle = 'قصة التخيير';

const List t1 = ['1', 'تخيير النبي ﷺ لزوجاته'];
const List t2 = ['2', 'سبب نزول الآيات'];
const List t3 = ['3', 'الحياة المعيشية في بيوت رسول الله ﷺ'];
const List t4 = ['4', 'الإضاءة'];
const List t5 = ['5', 'الفراش'];
const List t6 = ['6', 'التمتع بنعم الله دون إسراف'];
const List t7 = ['7', 'التوسط في الإنفاق'];
const List t8 = ['8', 'موقف السيدة عائشة رضى الله عنها'];
const List t9 = ['9', 'قيادة الأمة مغرماً وليست مغنماً'];

const String p1 =
    'كان لتخيير النبي ﷺ لزوجاته ﷺ دروس وعبر، قال تعالى: يَاأَيُّهَا النَّبِيُّ قُلْ لأَزْوَاجِكَ إِنْ كُنْتُنَّ تُرِدْنَ الْحَيَاةَ الدُّنْيَا وَزِينَتَهَا فَتَعَالَيْنَ أُمَتِّعْكُنَّ وَأُسَرِّحْكُنَّ سَرَاحًا جَمِيلا وَإِنْ كُنْتُنَّ تُرِدْنَ اللَّهَ وَرَسُولَهُ وَالدَّارَ الآخِرَةَ فَإِنَّ اللَّهَ أَعَدَّ لِلْمُحْسِنَاتِ مِنْكُنَّ أَجْرًا عَظِيمًا - سورة الأحزاب';
const String p2 =
    'وقد دلت الأحاديث الصحيحة على أن نزول هاتين الآيتين كان بعد اعتزال النبي ﷺ لنسائه بعد أن أقسم أن لايدخل عليهن شهراً، فاعتزلهن في مشربة له وهي القصة المعروفة بقصة إيلائه من نسائه، وكان تاريخ نزول هذه الآيات في العام التاسع للهجرة.';
const String p3 =
    'وسبب نزول الآيات هو طلب زوجاته ﷺ التوسعة عليهن في النفقة، فقد أخرج مسلم عن جابر رضي الله عنه قال: دخل أبو بكر يستأذن على رسول الله ﷺ فوجد الناس جلوساً ببابه لم يؤذن لأحد منهم قال: فأذن لأبي بكر، فدخل ثم أقبل عمر فاستأذن فأذن له، فوجد النبي ﷺ جالساً حوله نساؤه واجما ساكتاً -الذي اشتد حزنه حتى أمسك عن الكلام- قال: فقال: لأقولن شيئاً أضحك النبي ﷺ فقال: يارسول الله: لو رأيت بنت خارجة سألتني النفقة فقمت إليها فوجأت عنقها، فضحك رسول الله ﷺ وقال: هن حولي كما ترى يسألنني النفقة، فقام أبو بكر إلى عائشة يجأ عنقها فقام عمر إلى حفصة يجأ عنقها، وكلاهما يقول أتسألن رسول الله ﷺ ماليس عنده فقلن: والله! لانسأل رسول الله شيئاً أبداً ليس عنده، ثم اعتزلهن شهراً أو تسعاً وعشرين ثم نزلت عليه هذه الآية.';
const String p4 =
    'كانت الحياة المعيشية في بيوت رسول الله ﷺ تجري على وتيرة واحدة بالرغم من إمكانية التوسع في بعض الأحيان، ونساء الرسول ﷺ هن من البشر يرغبن بما يرغب به الناس ويشتهين ما يشتهيه الناس فقد كان مساكنهن متواضعة بسيطة غاية البساطة فقد وصفها الدكتور أبو شهبة فقال: إن الرسول ﷺ بنى حجراً حول مسجده الشريف لتكون مساكن له ولأهله، ولم تكن الحجر كبيوت الملوك والأكاسرة والقياصرة بل كانت بيوت من ترفع عن الدنيا وزخرفها وابتغى الدار الآخرة، فقد كانت كمسجده مبنية من اللبن والطين وبعض الحجارة وسقوفها من جذوع النخل والجريد قريبة الفناء قصيرة البناء، ينالها الغلام الفارع بيده قال الحسن البصري وكان غلاماً مع أمه خيرة مولاة أم سلمة: قد كنت أنال أطول سقف في حجر النبي ﷺ بيدي وكان لكل حجرة بابان: خارجي وداخلي من المسجد ليسهل دخول النبي ﷺ إليه.';
const String p5 =
    'فلم يكن هناك مصباح يستضاء به، يدل على ذلك مارواه البخاري عن عائشة رضي الله عنها قالت: كنت أنام بين يدي رسول الله ﷺ ورجلاي في قبلته، فإذا سجد غمزني فقبضت رجلي فإذا قام بسطتهما قالت: والبيوت يومئذ ليس فيها مصابيح.';
const String p6 =
    'أما الفراش الذي يأوي إليه هذا النبي عليه أفضل الصلاة وأتم التسليم فهو عبارة عن رمال حصير ليس بينه وبينه فراش قد أثر الرمال بجنبه، ووسادته من أدم حشوها ليف، فقد كانت معيشته ﷺ تدل على الشدة، فعن أنس بن مالك رضي الله عنه قال: ما أعلم النبي ﷺ رأى رغيفاً مرققاً حتى لحق بالله ولا رأى شاة سميطاً -الذي أزيل شعره بالماء المسخن وشوي- بعينه قط، وعن عائشة قالت: إن كنا لننظر إلى الهلال ثلاثة أهلة في شهرين وما أوقدت في أبيات رسول الله ﷺ نار، فقال لها عروة بن الزبير: ماكان يعيشكم؟ قالت: الأسودان: التمر والماء هذا وقد فتح الله على المسلمين بعد خيبر وفتح مكة وغزوة تبوك.';
const String p7 =
    'وقد قرأت زوجات النبي ﷺ آيات في كتاب الله تبيح التمتع بنعم الله دون إسراف فرغبن أن ينلهن حظ من ذلك كما في قوله تعالى: يَابَنِي ءَادَمَ خُذُوا زِينَتَكُمْ عِنْدَ كُلِّ مَسْجِدٍ وَكُلُوا وَاشْرَبُوا وَلا تُسْرِفُوا إِنَّهُ لا يُحِبُّ الْمُسْرِفِينَ ، وحضى على أكل الطيبات من الرزق قال سبحانه: قُلْ مَنْ حَرَّمَ زِينَةَ اللَّهِ الَّتِي أَخْرَجَ لِعِبَادِهِ وَالطَّيِّبَاتِ مِنَ الرِّزْقِ قُلْ هِيَ لِلَّذِينَ ءَامَنُوا فِي الْحَيَاةِ الدُّنْيَا خَالِصَةً يَوْمَ الْقِيَامَةِ كَذَلِكَ نُفَصِّلُ الآيَاتِ لِقَوْمٍ يَعْلَمُونَ - سورة الأعراف';
const String p8 =
    'دعا رسول الله ﷺ  إلى التوسط في الإنفاق والاعتدال فيه فقال تعالى: وَلا تَجْعَلْ يَدَكَ مَغْلُولَةً إِلَى عُنُقِكَ وَلا تَبْسُطْهَا كُلَّ الْبَسْطِ فَتَقْعُدَ مَلُومًا مَحْسُورًا - سورة الإسراء ، إلا أن هناك جانباً آخر يتعلق به ﷺ ونمط من المعيشة اختاره بتوجيه من ربه عزوجل فلم يلتفت لشيء من هذا كما أدبه ربه سبحانه وتعالى بقوله: لا تَمُدَّنَّ عَيْنَيْكَ إِلَى مَا مَتَّعْنَا بِهِ أَزْوَاجًا مِنْهُمْ وَلا تَحْزَنْ عَلَيْهِمْ وَاخْفِضْ جَنَاحَكَ لِلْمُؤْمِنِينَ - سورة الحجر ، وقوله سبحانه: وَلا تَمُدَّنَّ عَيْنَيْكَ إِلَى مَا مَتَّعْنَا بِهِ أَزْوَاجًا مِنْهُمْ زَهْرَةَ الْحَيَاةِ الدُّنْيَا لِنَفْتِنَهُمْ فِيهِ وَرِزْقُ رَبِّكَ خَيْرٌ وَأَبْقَى - سورة طه ، ولذلك جاءت آيات التخيير فوقف زوجاته ﷺ من قضية التخيير موقفاً حاسماً لاتردد فيه، فإنهن اخترن الله ورسوله والدار الآخرة، فقد كن يطلبن منه ﷺ التوسعة في النفقة وكن يدافعن عن ذلك ما استطعن فلما وصل الأمر إلى وضعهن أمام خيارين: الحياة الدنيا وزينتها أو الله ورسوله والدار الآخرة، لم يترددن لحظة واحدة في سلوك الخيار الثاني بل قلن جميعهن بصوت واحد: نريد الله ورسوله والدار الآخرة.';
const String p9 =
    'وعن عائشة رضي الله عنها قالت: لما أمر رسول الله ﷺ بتخيير أزواجه بدأ بي فقال: إني ذاكر لك أمراً فلا عليك أن تعجلي حتى تستأمري أبويك قالت: وقد علم أن أبويَّ لم يكونا يأمراني بفراقه قالت: ثم قال إن الله جلّ ثناؤه قال: يَاأَيُّهَا النَّبِيُّ قُلْ لأَزْوَاجِكَ إِنْ كُنْتُنَّ تُرِدْنَ الْحَيَاةَ الدُّنْيَا وَزِينَتَهَا فَتَعَالَيْنَ أُمَتِّعْكُنَّ وَأُسَرِّحْكُنَّ سَرَاحًا جَمِيلا وَإِنْ كُنْتُنَّ تُرِدْنَ اللَّهَ وَرَسُولَهُ وَالدَّارَ الآخِرَةَ فَإِنَّ اللَّهَ أَعَدَّ لِلْمُحْسِنَاتِ مِنْكُنَّ أَجْرًا عَظِيمًا - سورة الأحزاب ، قالت: فقلت ففي أيّ هذا أستأمر أبويَّ؟ فإني أريد الله ورسوله والدار الآخرة قالت: ثم فعل أزواج رسول الله ﷺ مثل مافعلت.';
const String p10 =
    'وهكذا تتجلى في موقفهن رضي الله عنهن صورة ناصعة لقوة الإيمان، واختبار حقيقي للإخلاص والصدق مع الله تعالى فإن قوله تعالى في الآية الأولى من آيتي التخيير: إِنْ كُنْتُنَّ تُرِدْنَ الْحَيَاةَ الدُّنْيَا وَزِينَتَهَا فَتَعَالَيْنَ كالوعد بحصولهن على مبتغاهن في الحياة الدنيا وزينتها إن اخترن ذلك، ولكنهن رفضن هذا واخترن الله ورسوله والدار الآخرة وفي قوله تعالى في الآية الثانية: وَإِنْ كُنْتُنَّ تُرِدْنَ اللَّهَ وَرَسُولَهُ وَالدَّارَ الآخِرَةَ فَإِنَّ اللَّهَ أَعَدَّ لِلْمُحْسِنَاتِ مِنْكُنَّ أَجْرًا عَظِيمًا ، إشارة إلى أن مايَنَلْنَه من الأجر سببه كونهن محسنات ومن ذلك اختيارهن الله ورسوله والدار الآخرة إذ لايكفي لحصولهن على هذا الأجر كونهن زوجات للرسول ﷺ .';
const String p11 =
    'وتنكير الأجر أى غير معروف، ثم وصفه بأنه عظيم، فيه ترغيب لهن بالكف عن التطلع إلى الحياة الدينا وزينتها فهذا الأجر لايقدر قدره إلا الله وهو شامل لخيري الدنيا والآخرة.';
const String p12 =
    'إن قيادة الأمة تكليف ومغرم وليست مغنماً ولابد للذين يتولونها أن يحسبوا أهمية التعالي على حطام الدنيا والشوق إلى الله والدار الآخرة.';
