const int sectionIndex = 23;
const String sectionTitle = 'الهجرة - إِلا تنصرُوهُ فقد نصَرَهُ اللَّه';

const List t1 = ['1', 'فشل خطة المشركين لأغتيال النبي ﷺ'];
const List t2 = ['2', 'الترتيب النبوي للهجرة'];
const List t3 = ['3', 'خروج الرسول ﷺ ووصوله إلى الغار'];
const List t4 = ['4', 'دعا النبي ﷺ عند خروجه من مكة'];
const List t5 = ['5', 'عناية الله سبحانه لرسوله ﷺ'];

const String p1 =
    'بعد أن منيت قريش بالفشل في منع الصحابة رضي الله عنهم من الهجرة إلى المدينة على الرغم من أساليبهم الشنيعة والقبيحة فقد أدركت قريش خطورة الموقف وخافوا على مصالحهم الاقتصادية وكيانهم الإجتماعي القائم بين قبائل العرب، لذلك اجتمعت قيادة قريش في دار الندوة للتشاور في أمر القضاء على قائد الدعوة وقد تحدث ابن عباس في تفسيره لقول الله تعالى: وَإِذْ يَمْكُرُ بِكَ الَّذِينَ كَفَرُوا لِيُثْبِتُوكَ أَوْ يَقْتُلُوكَ أَوْ يُخْرِجُوكَ وَيَمْكُرُونَ وَيَمْكُرُ اللَّهُ وَاللَّهُ خَيْرُ الْمَاكِرِينَ - سورة الأنفال فقال: فتشاورت قريش بمكة فقال بعضهم: إذا أصبح فأثبتوه بالوثائق يريدون النبي ﷺ ، وقال بعضهم: بل اقتلوه وقال بعضهم: أن اخرجوه فأطلع الله نبيه على ذلك فبات علي على فراش النبي ﷺ تلك الليلة، وخرج النبي ﷺ فلما أصبحوا ثاروا إليه فلما رأوا علياً رد الله مكرهم فقالوا: أين صاحبك هذا؟ قال: لا أدري فاقتفوا أثره فلما بلغوا الجبل اختلط عليهم الأمر فصعدوا الجبل فمروا بالغار فرأوا على بابه نسيج العنكبوت فقالوا: لو دخل ههنا لم يكن ينسج العنكبوت على بابه فمكث فيه ثلاثاً.';
const String p2 =
    'إنها صورة ساخرة وهي في الوقت ذاته صورة مفزعة فأين هؤلاء البشر الضعاف المهازيل من تلك القدرة القادرة قدرة الله الجبار القاهر فوق عباده، الغالب على أمره وهو بكل شيء محيط.';
const String p3 =
    'عن عائشة أم المؤمنين قالت: كان لايخطئ رسول الله ﷺ أن يأتي بيت أبي بكر أحد طرفي النهار إما بكرة وإما عشية، حتى إذا كان اليوم الذي أذن فيه لرسول الله ﷺ في الهجرة، والخروج من مكة من بين ظهري قومه أتانا رسول الله ﷺ بالهاجرة اى - نصف النهار عند زوال الشمس مع الظهر أو الى العصر.';
const String p4 =
    'في ساعة كان لايأتي فيها قالت: فلما رآه أبو بكر قال: ماجاء رسول الله ﷺ هذه الساعة إلا لأمر حدث قالت: فلما دخل، تأخر له أبو بكر عن سريره، فجلس رسول الله ﷺ وليس عند أبي بكر إلا أنا وأختي أسماء بنت أبي بكر فقال رسول الله ﷺ : أخرج عني من عندك فقال: يارسول الله إنما هما ابنتاي وماذاك فداك أبي وأمي فقال: إنه قد أذن لي في الخروج والهجرة، قالت: فقال أبو بكر: الصحبة يارسول الله؟ قال: الصحبة، قالت: فوالله ماشعرت قط قبل ذلك اليوم أحداً يبكي من الفرح حتى رأيت أبا بكر يبكي يومئذ ثم قال: يانبي الله إن هاتين راحلتان قد كنت أعددتهما لهذا فاستأجرا عبدالله بن أرقط رجلاً من بني الديل بن بكر وكانت أمه امرأة من بني سهم بن عمرو وكان مشركاً يدلهما على الطريق، فدفعا إليه راحلتيهما فكانتا عنده يرعاها لميعادهما.';
const String p5 =
    'لم يعلم بخروج رسول الله ﷺ أحد حين خرج إلا علي بن أبي طالب وأبو بكر الصديق وآل أبي بكر.';
const String p6 =
    'أما علي فإن رسول الله ﷺ أمره أن يتخلف حتى يؤدي عن رسول الله ﷺ الودائع التي كانت عنده للناس، وكان رسول الله ﷺ وليس بمكة أحد عنده شيء يخشى إلا وضعه عنده لما يعلم من صدقه وأمانته وكان الميعاد بين الرسول ﷺ وأبي بكر رضي الله عنه، فخرجا من خوخة لأبي بكر في ظهر بيته وذلك للإمعان في الاستخفاء حتى لاتتبعهما قريش وتمنعهما من تلك الرحلة المباركة وقد اتعدا مع الليل على أن يلقاهما عبدالله بن أريقط في غار ثور بعد ثلاث ليال.';
const String p7 = 'وقد دعا النبي ﷺ عند خروجه من مكة إلى المدينة قائلاً:';
const String p8 =
    'الحمد لله الذي خلقني ولم أك شيئاً، اللهم أعني على هول الدنيا وبوائق الدهر ومصائب الليالي والأيام، اللهم أصحبني في سفري وأخلفني في أهلي وبارك لي فيما رزقتني ولك فذللني وعلى خلقي فقومني وإليك رب فحببني وإلى الناس فلا تكلني، رب المستضعفين وأنت ربي، أعوذ بوجهك الكريم الذي أشرقت له السماوات والأرض وكشفت به الظلمات وصلح عليه أمر الأولين والآخرين أن تحل علي غضبك أو تنزل بي سخطك، أعوذ بك من زوال نعمتك وفجأة نقمتك وتحول عافيتك وجميع سخطك لك العتبى عندي خير ما استطعت لاحول ولاقوة إلا بك.';
const String p9 =
    'ووقف الرسول ﷺ عند خروجه بالحزورة في سوق مكة وقال: والله إنك لخير أرض الله وأحب أرض الله إلى الله، ولولا أني أخرجت منك ماخرجت.';
const String p10 =
    'عندما أحاط المشركون بالغار وأصبح منهم رأي العين طمأن الرسول ﷺ الصديق بمعية الله لهما: فعن أبي بكر الصديق رضي الله عنه قال: قلت للنبي ﷺ وأنا في الغار: لو أن أحدهم نظر تحت قدميه لأبصرنا فقال: ما ظنك يا أبا بكر باثنين الله ثالثهما.';
const String p11 =
    'وبالرغم من كل الأسباب التي اتخذها رسول الله ﷺ فإنه لم يرتكن إليها مطلقاً وإنما كان كامل الثقة في الله، عظيم الرجاء في نصره وتأييده دائم الدعاء بالصيغة التي علمه الله إياها قال تعالى: وَقُلْ رَبِّ أَدْخِلْنِي مُدْخَلَ صِدْقٍ وَأَخْرِجْنِي مُخْرَجَ صِدْقٍ وَاجْعَلْ لِي مِنْ لَدُنْكَ سُلْطَانًا نَصِيرًا - سورة الإسراء';
const String p12 =
    'وصاحب الدعوة لايمكن أن يستمد السلطان إلا من الله ولايمكن أن يهاب إلا بسلطان الله لايمكن أن يستظل بحاكم أو ذي جاه فينصره ويمنعه مالم يكن اتجاهه قبل ذلك إلى الله، والدعوة قد تغزو قلوب ذوي السلطان والجاه فيصبحون لها جنداً وخدماً فيفلحون ولكنها هي لاتفلح إن كانت من جند السلطان وخدمه فهي من أمر الله وهي أعلى من ذوي السلطان والجاه.';
const String p13 =
    'وسجل الحق عزوجل ذلك في قوله تعالى: إِلاَّ تَنْصُرُوهُ فَقَدْ نَصَرَهُ اللَّهُ إِذْ أَخْرَجَهُ الَّذِينَ كَفَرُوا ثَانِيَ اثْنَيْنِ إِذْ هُمَا فِي الْغَارِ إِذْ يَقُولُ لِصَاحِبِهِ لاَ تَحْزَنْ إِنَّ اللَّهَ مَعَنَا فَأَنْزَلَ اللَّهُ سَكِينَتَهُ عَلَيْهِ وَأَيَّدَهُ بِجُنُودٍ لَمْ تَرَوْهَا وَجَعَلَ كَلِمَةَ الَّذِينَ كَفَرُوا السُّفْلَى وَكَلِمَةُ اللَّهِ هِيَ الْعُلْيَا وَاللَّهُ عَزِيزٌ حَكِيمٌ - سورة التوبة';
