const int sectionIndex = 78;
const String sectionTitle = 'حجة الوداع';

const List t1 = ['1', 'حجة البلاغ'];
const List t2 = ['2', 'لبيك اللهم لبيك لبيك لاشريك لك'];
const List t3 = ['3', 'عند دخول البيت الحرام'];
const List t4 = ['4', 'عند الصفا والمروه'];
const List t5 = ['5', 'ألعامنا هذا أم للأبد'];
const List t6 = ['6', 'الوقوف بعرفة'];
const List t7 = ['7', 'الخطبة'];
const List t8 = ['8', 'اللهم نشهد أنك بلغت'];
const List t9 = ['9', 'تضرع وابتهال'];
const List t10 = ['10', 'الأفاضة من عرفات'];
const List t11 = ['11', 'يوم النحرِ والخطبة'];
const List t12 = ['12', 'رمى الجمرات'];
const List t13 = ['13', 'خطبة النبى ﷺ في طريق العودة'];
const List t14 = ['14', 'الحكمة من تكرار الخطب'];
const List t15 = ['15', 'التكبير عند وصول المدينة'];
const List t16 = ['16', 'قطع المسلم بعلاقته بالجاهلية'];
const List t17 = ['17', 'التحذير من الذنوب والخطايا'];
const List t18 = ['18', 'إفطار الحاج يوم عرفة'];
const List t19 = ['19', 'كيف يفعل بمن توفي محرماً؟'];
const List t20 = ['20', 'هل يجوز الحج عن الغير؟'];
const List t21 = ['21', 'منهج التيسير لاحرج فيه'];
const List t22 = ['22', 'تسمية أيام الحج'];

const String p1 =
    'يعتبر الحج أحد الأركان الخمسة وقد فرض في العام العاشر وهذا ماذهب إليه ابن القيم واستدل بأدلة قوية وهو اللائق بهديه ﷺ في عدم تأخير ماهو فرض لأن الله تعالى يقول: وَلِلَّهِ عَلَى النَّاسِ حِجُّ الْبَيْتِ مَنِ اسْتَطَاعَ إِلَيْهِ سَبِيلا - سورة آل عمران ، وقد نزلت عام الوفود أواخر سنة تسع.';
const String p2 =
    'لم يحج النبي ﷺ من المدينة غير حجته التي كانت في العام العاشر وعرفت هذه الحجة بحجة البلاغ وحجة الإسلام وحجة الوداع لأنه ﷺ ودع الناس فيها ولم يحج بعدها.';
const String p3 =
    'ولما نزلت الآية: الْيَوْمَ أَكْمَلْتُ لَكُمْ دِينَكُمْ وَأَتْمَمْتُ عَلَيْكُمْ نِعْمَتِي وَرَضِيتُ لَكُمُ الإِسْلامَ دِينًا - سورة المائدة ، بكى بعض الصحابة ومنهم عمر بن الخطاب رضي الله عنه، وكأنهم فهموا منها الإشارة إلى قرب أجل الرسول ﷺ ولما قيل لسيدنا عمر: مايبكيك؟ قال: إنه ليس بعد الكمال إلا النقصان وكان عدد الذي مع رسول الله أكثر من مائة ألف.';
const String p4 =
    'عزم رسول الله ﷺ على الحج وأعلم الناس أنه حاج فتجهزوا، وذلك في شهر ذي القعدة سنة عشر للخروج معه وسمع بذلك من حول المدينة، فقدموا يريدون الحج مع الرسول ﷺ ووافاه في الطريق خلائق لايحصون، فكانوا من بين يديه ومن خلفه وعن يمينه وعن شماله مد البصر، وخرج من المدينة نهاراً بعد الظهر لخمس بقين من ذي القعدة يوم السبت بعد أن صلى الظهر بها أربعاً.';
const String p5 =
    'وخطبهم قبل ذلك خطبة علمهم فيها الاحرام وواجباته وسننه ثم سار وهو يلبي ويقول: لبيك اللهم لبيك لبيك لاشريك لك لبيك إن الحمد والنعمة لك والملك لاشريك لك ، والناس معه يزيدون وينقصون وهو يقرهم ولا ينكر عليهم ولزم تلبيته ثم مضى حتى نزل بـ العرج ثم سار حتى أتى الأبواء، فوادي عسفان في سرف، ثم نهض إلى أن نزل بـ ذي طوى فبات بها ليلة الأحد لأربع خلون من ذي الحجة، وصلى بها الصبح ثم اغتسل من يومه ونهض إلى مكة فدخلها نهاراً من أعلاها.';
const String p6 =
    'ثم سار حتى دخل المسجد وذلك ضحى فاستلم الركن ﷺ فرمل ثلاثاً - إسراع المشي مع تقارب الخطا- ومشى ومشى أربعاً ثم نفذ إلى مقام إبراهيم عليه السلام، فقرأ: وَإِذْ جَعَلْنَا الْبَيْتَ مَثَابَةً لِلنَّاسِ وَأَمْنًا وَاتَّخِذُوا مِنْ مَقَامِ إِبْرَاهِيمَ مُصَلًّى وَعَهِدْنَا إِلَى إِبْرَاهِيمَ وَإِسْمَاعِيلَ أَنْ طَهِّرَا بَيْتِيَ لِلطَّائِفِينَ وَالْعَاكِفِينَ وَالرُّكَّعِ السُّجُودِ - سورة البقرة ، فجعل المقام بينه وبين البيت وكان يقرأ في الركعتين قل هو الله أحد وقل يا أيها الكافرون ، ثم رجع إلى الركن فاستلمه.';
const String p7 =
    'ثم خرج من الباب إلى الصفا فلما دنا من الصفا قرأ: إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللَّهِ فَمَنْ حَجَّ الْبَيْتَ أَوِ اعْتَمَرَ فَلا جُنَاحَ عَلَيْهِ أَنْ يَطَّوَّفَ بِهِمَا وَمَنْ تَطَوَّعَ خَيْرًا فَإِنَّ اللَّهَ شَاكِرٌ عَلِيمٌ - سورة البقرة ، وأبدأ بما بدأ الله به فبدأ بالصفا فرقى عليه حتى إذا رأى البيت فاستقبل القبلة فوحد الله وكبره وقال: لا إله إلا الله وحده لاشريك له له الملك وله الحمد وهو على كل شيء قدير لا إله إلا الله وحده أنجز وعده ونصر عبده وهزم الأحزاب وحده، ثم دعا بين ذلك قال مثل هذه ثلاث مرات ثم نزل إلى المروة حتى إذا انصبت قدماه في بطن الوادي سعى، حتى إذا صعدتا مشى أتى المروة ففعل على المروة كما فعل على الصفا، حتى إذا كان آخر طوافه على المروة فقال: لو أني استقبلت من أمري ما استدبرت لم أسق الهدي وجعلتها عمرة فمن كان منكم ليس معه هدي فليحل وليجعلها عمرة.';
const String p8 =
    'فقال سراقة بن مالك بن جعشم فقال: يارسول الله! ألعامنا هذا أم للأبد؟ فشبك رسول الله ﷺ أصابعه واحدة في الأخرى، وقال: دخلت العمرة في الحج مرتين لا بل لأبد أبد وأقام بمكة أربعة أيام: يوم الأحد والإثنين والثلاثاء والأربعاء، فلما كان يوم الخميس ضحى توجه بمن معه من المسلمين إلى منى ونزل بها وصلى بها الظهر والعصر والمغرب والعشاء والفجر ومكث قليلاً حتى طلعت الشمس.';
const String p9 =
    'وأمر بقبة من شعر تضرب له بنمرة -موضع بجنب عرفات- فسار رسول الله ﷺ ، ولا تشك قريش إلا أنه واقف عند المشعر الحرام -جبل بمزدلفة كانت قريش تقف عليه ولا تقف مع العرب في عرفات ولكن رسول الله وقف عرفات- كما كانت قريش تصنع في الجاهلية، فأجاز رسول الله ﷺ - جاوز المزدلفة ولم يقف بها وإنما توجه الى عرفات- حتى أتى عرفه فوجد القبة قد ضربت له بنمرة.';
const String p10 =
    'فنزل بها حتى إذا زاغت الشمس أمر بالقصواء فرحلت له، فأتى بطن الوادي فخطب الناس وقال: إن دماءكم وأموالكم حرام عليكم كحرمة يومكم هذا في شهركم هذا في بلدكم هذا ألا كل شيء من أمر الجاهلية تحت قدمي موضوع ودماء الجاهلية موضوعة، وإن أول دم أضع من دمائنا دم ابن ربيعة بن الحارث كان مسترضعاً في بني سعد فقتلته هذيل، وربا الجاهلية موضوع وأول ربا أضع ربانا ربا العباس بن عبدالمطلب فإنه موضوع كله، فاتقوا الله في النساء فإنكم أخذتموهن بأمان الله واستحللتم فروجهن بكلمة الله، ولكم عليهن أن لايوطئن في فرشكم أحداً تكرهونه، فإن فعلن ذلك فاضربوهن ضرباً غير مبرح ولهن عليكم رزقهن وكسوتهن بالمعروف، وقد تركت فيكم مالن تضلوا بعده إن اعتصمتم به كتاب الله وأنتم تسألون عني فما أنتم قائلون؟';
const String p11 =
    'قالوا: نشهد أنك بلغت وأديت ونصحت، فقال بإصبعه السبابة يرفعها إلى السماء وينكثها إلى الناس: اللهم اشهد اللهم اشهد ثلاث مرات.';
const String p12 =
    'ثم أذن ثم أقام فصلى الظهر ثم أقام فصلى العصر ولم يصل بينهما شيئاً، ثم ركب رسول الله ﷺ حتى أتى الموقف، فجعل بطن ناقته القصواء إلى الصخرات، وجعل جبل المشاة بين يديه، واستقبل القبلة فلم يزل واقفاً حتى غربت الشمس وذهبت الصفرة قليلاً حتى غاب القرص، وذكر أبو الحسن الندوي: لما فرغ رسول الله ﷺ من صلاته والتضرع والابتهال إلى غروب الشمس وكان في دعائه رافعاً يديه إلى صدره كاستطعام المسكين يقول فيه: اللهم إنك تسمع كلامي وترى مكاني وتعلم سري وعلانيتي لايخفى عليك شيء من أمري، أنا البائس الفقير المستغيث المستجير، والوجل المشفق المقر المعترف بذنوبي، أسألك مسألة المسكين، وأبتهل إليك ابتهال المذنب الذليل، وأدعوك دعاء الخائف الضرير من خضعت لك رقبته وفاضت لك عيناه وذل جسده ورغم أنفه لك، اللهم لاتجعلني بدعائك رب شقيا، وكن بي رؤوفاً رحيماً ياخير المسؤولين وياخير المعطين.';
const String p13 =
    'وهنالك أنزلت عليه: الْيَوْمَ أَكْمَلْتُ لَكُمْ دِينَكُمْ وَأَتْمَمْتُ عَلَيْكُمْ نِعْمَتِي وَرَضِيتُ لَكُمُ الإِسْلامَ دِينًا - سورة المائدة';
const String p14 =
    'فلما غربت الشمس أفاض من عرفة وأردف أسامة بن زيد خلفه وأفاض بالسكينة ضم إليه زمام ناقته حتى أن رأسها ليصيب طرف رحله، وهو يقول: أيها الناس عليكم السكينة، وكان يلبي في مسيره ذلك لايقطع التلبية حتى أتى المزدلفة، وأمر المؤذن بالأذان فأذن ثم أقام فصلى المغرب قبل حط الرحال وتبريك الجمال، فلما حطوا رحالهم أمر فأقيمت الصلاة ثم صلى العشاء، ثم نام حتى أصبح، فلما طلع الفجر صلاها في أول الوقت ثم ركب حتى أتى المشعر الحرام، فاستقبل القبلة وأخذ في الدعاء والتضرع والتكبير والتهليل والذكر، حتى أسفر جداً وذلك قبل طلوع الشمس ثم سار من مزدلفة مردفاً للفضل بن عباس وهو يلبي في مسيره، وأمر ابن عباس أن يلتقط له حصى الجمار سبع حصيات، فلما أتى بطن محسر حرك ناقته وأسرع السير فإن هنالك أصاب أصحاب الفيل العذاب، حتى أتى منى فأتى جمرة العقبة فرماها راكباً بعد طلوع الشمس وقطع التلبية.';
const String p15 =
    'ثم رجع إلى منى فخطب الناس خطبة بليغة أعلمهم فيها بحرمة يوم النحر وتحريمه وفضله عند الله تعالى.';
const String p16 =
    'وقال ﷺ : أتدرون أي يوم هذا؟ قلنا: الله ورسوله أعلم فسكت حتى ظننا أن سيسميه بغير اسمه فقال: أليس ذو الحجة؟ قلنا: بلى قال: أي بلد هذا؟ قلنا: الله ورسوله أعلم، فسكت حتى ظننا أنه سيسميه بغير اسمه قال فقال: أليس ذو الحجة قلنا: بلى قال: أي بلد هذا؟ قلنا: الله ورسوله أعلم فسكت حتى ظننا أنه سيسميه بغير اسمه قال: اليست بالبلدة الحرام؟ قلنا: بلى قال: فإن دماءكم وأموالكم -وفي رواية أعراضكم- عليكم حرام كحرمة يومكم هذا في شهركم هذا في بلدكم هذا إلى يوم تلقون ربكم ألا هل بلغت؟ قالوا: نعم قال: اللهم اشهد فليبلغ الشاهد الغائب فربَّ مبلِّغ أوعى من سامع، فلا ترجعوا بعدي كفاراً يضرب بعضكم رقاب بعض.';
const String p17 =
    'ثم انصرف إلى المنحر بمنى فنحر ثلاثاً وستين بدنه بيده، وكان عدد هذا الذي نحره عدد سنين عمره ثم أمسك، وأمر عليا أن ينحر ما بقي من المائة فلما أكمل ﷺ نحره استدعى بالحلاق فحلق رأسه وقسم شعره بين من يليه، ثم أفاض إلى مكة راكباً وطاف طواف الإفاضة، فصلى بمكة الظهر فأتى بني عبدالمطلب يسقون على زمزم فقال: أنزعوا بني عبدالمطلب: فلولا أن يغلبكم الناس على سقايتكم لنزعت معكم فناولوه دلواً فشرب منه.';
const String p18 =
    'ثم رجع إلى منى من يومه ذلك فبات بها فلما أصبح انتظر زوال الشمس فلما زالت مشى من رحله إلى الجمار فبدأ بالجمرة الأولى ثم الوسطى، ثم الجمرة الثالثة وهي جمرة العقبة.';

const String p19 =
    'هذا وقد تأخر رسول الله ﷺ حتى أكمل رمي أيام التشريق الثلاثة ثم نهض إلى مكة فطاف للوداع ليلاً سحراً، وأمر الناس بالرحيل وتوجه إلى المدينة.';
const String p20 =
    'وفي طريق العودة من حجة الوداع خطب الرسول ﷺ الناس في غدير خُمّ قريباً من الجحفة في اليوم الثامن عشر من ذي الحجة وقد جاء في هذه الخطبة: أما بعد ألا أيها الناس فإنما أنا بشر يوشك أن يأتي رسول ربي فأجيب وأنا تارك فيكم ثقلين أولهما كتاب الله فيه الهدى والنور فخذوا بكتاب الله، واستمسكوا به فحث على كتاب الله ورغب فيه ثم قال: وأهل بيتي أذكركم الله في أهل بيتي أذكركم الله في أهل بيتي أذكركم الله في أهل بيتي.';
const String p21 =
    'وقد خطب رسول الله ﷺ بالناس بمنى خطبتين: خطبة يوم النحر وخطبة ثانية في ثاني يوم النحر وهو يوم النفر الأول وهي تأكيد لبعض ماجاء في خطبتي عرفة ويوم النحر بمنى، والواقع أن تكرار الخطب في حجة الوداع كان أمراً لابد منه لحاجة المسلمين فهي الحجة الوحيدة التي حجّها الرسول ﷺ ، وقد عزّ فيها الإسلام والمسلمون وأصبحت كلمتهم هي النافذة في الجزيرة كلها، كما كانت الوداع الأخير فما أشد حاجة المسلمين في هذا المشهد العظيم إلى التذكير والنصح والتوصية وإلى تكرار القول والتأكيد عليه حتى يعوه ويحفظوه ولاينسوه وإلى تقريرهم بإبلاغ الرسالة وأداء الأمانة.';

const String p22 =
    'ولما أتى رسول الله ﷺ ذا الحليفة بات بها فلما رأى المدينة كبر ثلاث مرات وقال: لا إله إلا الله وحده لاشريك له له الملك وله الحمد وهو على كل شيء قدير آيبون تائبون عابدون ساجدون لربنا حامدون صدق الله وعده نصر عبده وهزم الأحزاب وحده ثم دخلها نهارا.';

const String p23 =
    'وقد أشار ﷺ إلى أهمية قطع المسلم بعلاقته بالجاهلية أوثانها وثاراتها ورباها وغير ذلك، ولم يكن حديثه ﷺ مجرد توصية بل كان قراراً أعلن عنه للملأ كله لأولئك الذين كانوا من حوله والأمم التي ستأتي من بعده وهذه هي صيغة القرار: ألا إن كل شيء من أمر الجاهلية تحت قدمي موضوع دماء الجاهلية موضوعة، وربا الجاهلية موضوع لأن الحياة الجديدة التي يحياها المسلم بعد إسلامه حياة لاصلة لها برجس الماضي وأدرانه.';
const String p24 =
    'وقد حذر ﷺ من الذنوب والخطايا والآثام ماظهر منها ومابطن، لأن الذنوب والخطايا تفعل بالفرد مالا يفعله العدو بعدوه، فهي سبب مصائبه في الدنيا: وَمَا أَصَابَكُمْ مِنْ مُصِيبَةٍ فَبِمَا كَسَبَتْ أَيْدِيكُمْ وَيَعْفُو عَنْ كَثِيرٍ - سورة الشورى ، فترديه في نار جهنم في الآخرة وتفعل في المجتمعات مالا يفعله السيف، وأعلن رسول الله ﷺ أنه لا يقصد بالخطايا العودة إلى عبادة الأصنام لأن العقول التي تفتحت على التوحيد ترفض أن تعود إلى الشرك الظاهر ولكن الشيطان لاييأس من أن يجد طريقه إليها من ثغرات الخطايا والذنوب حتى تردى صاحبها في المهاوي.';
const String p25 =
    'قالت ميمونة بنت الحارث رضي الله عنها زوج النبي ﷺ : إن الناس شكوا في صيام رسول الله ﷺ يوم عرفة، فأرسلت إليه ميمونة بحلاب اللبن وهو واقف في الموقف فشرب منه والناس ينظرون إليه.';
const String p26 =
    'قال ابن عباس رضي الله عنهما: بينما رجل واقف مع رسول الله ﷺ بعرفة إذ وقع عن راحلته فأوقصته أو قال فأقعصته، فذكر ذلك للنبي ﷺ فقال: اغسلوه بماء وسدر وكفنوه في ثوبين، ولا تحنطوه -لا تضعوا عليه من الطيب شيئاً- ولاتخمروا رأسه فإن الله يبعثه يوم القيامة ملبياً.';
const String p27 =
    'قال ابن عباس رضي الله عنهما قال: كان الفضل رديف رسول الله ﷺ ، فجاءت امرأة من خثعم فجعل الفضل ينظر إليها وتنظر إليه، وجعل النبي ﷺ يصرف وجه الفضل إلى الشق الآخر، فقالت: يارسول الله إن فريضة الله على عباده في الحج أدركت أبي شيخاً كبيراً لا يثبت على الراحلة، أفأحج عنه؟ قال: نعم. وذلك في حجة الوداع.';
const String p28 =
    'قال عبدالله بن عمرو بن العاص رضي الله عنهما: وقف رسول الله ﷺ على راحلته، فطفق ناس يسألونه فيقول القائل: يارسول الله! إني لم أكن أشعر أن الرمي قبل النحر فنحرت قبل الرمي، فقال رسول الله ﷺ : فارم ولاحرج قال: وطفق آخر يقول: إني لم أشعر أن النحر قبل الحلق فحلقت قبل أن أنحر، فيقول: انحر ولاحرج قال: فما سمعته يسأل يومئذ عن أمر مما ينسى المرء ويجهل من تقديم بعض الأمور قبل بعض وأشباهها، إلا قال رسول الله ﷺ افعل ولاحرج.';
const String p29 =
    'هذه بعض الأحكام المختصرة ومن أراد المزيد فليراح ماكتبه الألباني عن حجة الوداع، فقد لخص الحجة في اثنتين وسبعين مسألة وكتاب الوصية النبوية للأمة الإسلامية للدكتور فاروق حمادة فقد جمع من المصادر الأدبية والحديثية، وكتب أهل السير ثمانية وثلاثين بنداً ثم قام بتحليلها وتخريجها وتوثيق نصوصها بميزان الجرح والتعديل الذي اعتمده أئمة المسلمين منذ الصدر الأول لأن الأمر دين وشرع كما قال وقد أجاد وأفاد.';
const String p30 =
    'كان يقال لليوم السابع من ذي الحجة يوم الزينة لأنه يُزين فيه البُدن التي تهدى بالجلال وغيرها، واليوم الثامن يقال له: يوم التروية لأنهم كانوا يروون فيه إبلهم من الماء ويحملون منه مايحتاجون إليه حال الوقوف ومابعده لأن هذه الأماكن لم يكن فيها يومئذ آبار ولا عيون، أما الآن ففيها الماء الكثير والحمد لله واليوم التاسع: يوم عرفة للوقوف فيه بها، واليوم العاشر: يوم النحر ويوم الأضحى ويوم الحج الأكبر، واليوم الحادي عشر: يوم القر لأنهم يقرون فيه ويقال له: يوم الرؤوس لأنهم يأكلون فيه رؤوس الأضاحي وهو أول أيام التشريق، وثاني أيام التشريق يقال له: يوم النَّفر الأول لجواز الخروج فيه إلى مكة لمن يريد التعجيل، وثالث أيام التشريق يقال له يوم النَّفر الثاني قال عز شأنه: وَاذْكُرُوا اللَّهَ فِي أَيَّامٍ مَعْدُودَاتٍ فَمَنْ تَعَجَّلَ فِي يَوْمَيْنِ فَلا إِثْمَ عَلَيْهِ وَمَنْ تَأَخَّرَ فَلا إِثْمَ عَلَيْهِ لِمَنِ اتَّقَى وَاتَّقُوا اللَّهَ وَاعْلَمُوا أَنَّكُمْ إِلَيْهِ تُحْشَرُونَ - سورة البقرة';
