const int sectionIndex = 31;
const String sectionTitle = 'غزوة بدر - النصر ومصارع الطغاة';

const List t1 = ['1', 'إنتهاء المعركة'];
const List t2 = ['2', 'مناداة رسول ﷺ لقتلى قريش'];
const List t3 = ['3', 'مصرع أبي جهل'];
const List t4 = ['4', 'موقف عبدالله بن مسعود رضي الله عنه'];
const List t5 = ['5', 'مصرع أمية بن خلف'];
const List t6 = ['6', 'من مشاهد العظمة'];
const List t7 = ['7', 'الخلاف في الأنفال'];
const List t8 = ['8', 'إعفاء عثمان بن عفان لمرض زوجته'];
const List t9 = ['9', 'الأسرى'];
const List t10 = ['10', 'قوة شوكة المسلمين'];
const List t11 = ['11', 'حقيقة النصر من الله تعالى'];
const List t12 = ['12', 'يوم الفرقان'];
const List t13 = ['13', 'الولاء والبراء من فقه الإيمان'];

const String p1 =
    'انتهت معركة بدر بانتصار المسلمين على المشركين وكان قتلى المشركين سبعين رجلاً وأسر منهم سبعون وكان أكثرهم من قادة قريش وزعمائهم، واستشهد من المسلمين أربعة عشر رجلاً منهم ستة من المهاجرين وثمانية من الأنصار ولما تم الفتح وانهزم المشركون أرسل ﷺ عبدالله بن رواحة وزيد بن حارثة ليبشرا المسلمين في المدينة بنصر الله للمسلمين وهزيمة المشركين ومكث ﷺ في ثلاثة أيام في بدر ولعل الحكمة في ذلك:';
const String p2 =
    'القضاء على أية حركة من المقاومة اليائسة التي يحتمل أن يقوم بها فلول المنهزمين الفارّين هرباً إلى الجبال، دفن من استشهد من جند الله مما لاتكاد لاتخلو منه معركة، جمع الغنائم وحفظها وإسناد أمرها إلى من يقوم بهذا الحفظ حتى تؤدي كاملة الى مستحقيها.';
const String p3 =
    'ومواراة جيف قتلى الأعداء و قد أمر رسول الله ﷺ بإلقاء هؤلاء الأخباث في ركيّ - حافة البئر - خبيث مخبث ثم وقف على شفة الركيّ وقد ورد أنه ﷺ وقف على القتلى فقال: بئس عشيرة النبي كنتم لنبيكم كذبتموني وصدقني الناس وخذلتموني ونصرني الناس وأخرجتموني وآواني الناس.';
const String p4 =
    'ثم أمر رسول ﷺ فسُحِبوا إلى قليب من قلب بدر فطرحوا فيه ثم وقف عليهم فقال: ياعتبة بن ربيعة وياشيبة بن ربيعة ويافلان ويافلان هل وجدتم ماوعدكم ربكم حقا فإني وجدت ماوعدني ربي حقا فقال عمر بن الخطاب: يارسول الله! ماتخاطب من أقوام قد جيَّفوا؟ فقال: والذي نفسي بيده ما أنتم بأسمع لما أقول منهم ولكنهم لا يستطيعون الجواب قال قتادة: أحياهم الله حتى أسمعهم قوله توبيخاً وتصغيراً ونقمة وحسرة وندماً.';
const String p5 =
    'إن هذة المناداة لقتلى قريش بينت أمراً عظيماً وهو أنهم بدأوا حياة جديدة هي حياة البرزخ الخاصة وهم فيها يسمعون كلام الأحياء غير أنهم لا يجيبون ولا يتكلمون والإيمان بهذه الحياة من عقائد المسلمين ونعيم القبر وعذابه ثابتان في صحاح الأحاديث حتى إنه ﷺ مرّ بقبر فقال إنهما يعذبان ومايعذبان في كبير وذكر أن سبب تعذيبهما النمُّ بين الناس وعدم الاستنزاه من البول.';
const String p6 =
    'ولابد من التسليم بهذه الحقائق الغيبية بعد أن تحدث عنها الصادق المصدوق وقطع بها القرآن الكريم في تعذيب آل فرعون قال تعالى: النَّارُ يُعْرَضُونَ عَلَيْهَا غُدُوًّا وَعَشِيًّا وَيَوْمَ تَقُومُ السَّاعَةُ أَدْخِلُوا ءَالَ فِرْعَوْنَ أَشَدَّ الْعَذَابِ - سورة غافر';
const String p7 =
    'وأما الشهداء فقد قال الله تعالى فيهم: وَلا تَحْسَبَنَّ الَّذِينَ قُتِلُوا فِي سَبِيلِ اللَّهِ أَمْوَاتًا بَلْ أَحْيَاءٌ عِنْدَ رَبِّهِمْ يُرْزَقُونَ - سورة آل عمران';
const String p8 =
    'قال عبدالرحمن بن عوف رضي الله عنه : بينما أنا واقف في الصف يوم بدر نظرت عن يميني وشمالي فإذا أنا بين غلامين من الأنصار حديثة أسنانهما تمنيت لو كنت بين أضلع منهما، فغمزني أحدهما فقال: ياعم هل تعرف أبا جهل؟ قال:قلت: نعم وما حاجتك إليه يا ابن أخي؟ قال: أخبرت أنه يسب رسول الله ﷺ والذي نفسي بيده لئن رأيته لايفارق سوادي سواده حتى يموت الأعجل منا قال: فتعجبت لذلك فغمزني الآخر فقال مثالها.';
const String p9 =
    'قال: فلم أنشب أن نظرت إلى أبي جهل يزول في الناس فقلت: ألا تريان؟ هذا صاحبكما الذي تسألان عنه قال: فابتدراه بسيفيهما حتى قتلاه، ثم انصرفا إلى رسول الله ﷺ فأخبراه فقال: أيكما قتله؟ فقال كل واحد منهما: أنا قتلته فقال: كلاكما قتله وقضى بسلبه لمعاذ بن عمرو بن الجموح والرجلان معاذ بن عمرو بن الجموح ومعاذ بن عفراء وفي حديث أنس قال رسول الله ﷺ يوم بدر: من ينظر ماصنع أبو جهل؟ فانطلق ابن مسعود فوجده قد ضرباه أبناء عفراء حتى برد.';
const String p10 =
    'وماجرى بين عبدالله بن مسعود رضي الله عنه وأبي جهل وهو في الرمق الأخير من الحوار فيه عبرة بليغة فهذا الطاغية الذي كان شديد الأذى للمسلمين في مكة قد وقع صريعاً بين أيدي من كان يؤذيهم ويشاء الله تعالى أن يكون الذي يقضي على آخر رمق من حياته هو أحد المستضعفين ولقد كان أبو جهل مستكبراً جباراً حتى وهو صريع وفي آخر لحظات حياته فقد جاء في رواية لابن إسحاق أنه قال لعبد الله بن مسعود لما أراد أن يحتزَّ رأسه فقال : لقد ارتقيت مرتقىً صعباً يا رويعي الغنم.';
const String p11 =
    'فالله تعالى لم يعجِّل لهذا الخبيث أبي جهل بضربات الأبطال من أشبال الأنصار، ولكنه أبقاه مصروعاً في حالة من الإدراك والوعي بعد أن أصابته ضربات أشفَتْ به على الهلاك الأبدي ليريه بعين بصره مابلغه من المهانة والذل والخذلان على يد من كان يستضعفه ويؤذيه ويضطهده بمكة من رجال الرعيل الأول السابقين الى مظلَّة الإيمان وطهر العقيدة والتعبد لله بشرائعه التي أنزلها رحمة للعالمين، فهذا عبدالله بن مسعود رضي الله عنه فيعلو على صدره ويدوسه بقدميه ويقبض على لحيته تحقيراً له ويقرِّعه تقريعاً يبلغ من نفسه مجمع غروره واستكباره في الأرض ويستل منه سيفه إمعاناً في البطش به، فيقتله به ويمعن في إغاظته بإخباره أن النصر عقد بناصية جند الله وكتيبة الإسلام وأن شنار الهزيمة النكراء وعارها وخزيها وخذلانها قد رزئت به كتائب الغرور الأجوف في حشود النفير الذي قاده هذا الكفور الخبيث.';
const String p12 =
    'قال عبدالرحمن بن عوف رضي الله عنه: كاتبت أمية بن خلف كتاباً بأن يحفظني في صاغيتي بمكة وأحفظه في صاغيته بالمدينة فلما ذكرت الرحمن قال: لا أعرف الرحمن كاتبني باسمك الذي كان في الجاهلية فكاتبته عبدعمرو، فلما كان في يوم بدر خرجت إلى جبل لأحرزَه - أحميه حين نام الناس فأبصره بلال فخرج حتى وقف على مجلس من الأنصار فقال: أمية بن خلف لانجوت إن نجا أمية فخرج معه فريق من الأنصار في آثارنا فلما خشيت أن يلحقونا خلفت لهم ابنه لأشغلهم فقتلوه ثم أبوا حتى يتبعونا - وكان رجلاً ثقيلاً - فلما أدركونا قلت له: ابرك فبرك فألقيت عليه نفسي لأمنعه فتجللوه -طعنوه- بالسيوف من تحتي حتى قتلوه وأصاب أحدهم رجلي بسيفه وكان عبدالرحمن بن عوف يرينا ذلك الأثر في ظهر قدمه.';
const String p13 =
    'وماجرى من بلال رضي الله عنه حينما رأى عدوه اللدود أمية بن خلف الذي كان يسومه أقسى وأعنف أنواع العذاب في مكة فلما رآه في يد عبدالرحمن بن عوف رضي الله عنه أسيراً صرخ بأعلى صوته لانجوت إن نجا.';
const String p14 =
    'إنه موقف من مواقف التشفي في أعداء الله والتشفي من كبار الكفرة الفجار في الحياة الدنيا نعمة يفرِّج الله بها عن المكروبين من المؤمنين الذين ذاقوا الذل والهوان على أيدي أولئك الفجرة الطغاة قال تعالى: قَاتِلُوهُمْ يُعَذِّبْهُمُ اللَّهُ بِأَيْدِيكُمْ وَيُخْزِهِمْ وَيَنْصُرْكُمْ عَلَيْهِمْ وَيَشْفِ صُدُورَ قَوْمٍ مُؤْمِنِينَ وَيُذْهِبْ غَيْظَ قُلُوبِهِمْ وَيَتُوبُ اللَّهُ عَلَى مَنْ يَشَاءُ وَاللَّهُ عَلِيمٌ حَكِيمٌ - سورة التوبة';
const String p15 =
    'وإن فيما جرى لأمية بن خلف من قتل مفزع درساً بليغاً للطغاة المتجبرين وعبرة للمعتبرين الذين يغترون بقوتهم وينخدعون بجاههم ومكانتهم فيعتدون على الضعفاء ويسلبونهم حقوقهم مآلهم إلى عاقبة سيئة ووخيمة في الآخرة وقد يمكن الله للضعفاء منهم في الدنيا قبل الآخرة كما حدث لأمية بن خلف وأضرابه من طغاة الكفر.';
const String p16 =
    'استشهاد حارثة بن سراقة: عن أنس رضي الله عنه قال: أصيب حارثة يوم بدر وهو غلام فجاءت أمه الى النبي ﷺ فقالت: يارسول الله قد عرفت منزلة حارثة مني فإن يكن في الجنة أصبر وأحتسب وإن تكن الأخرى ترى ما أصنع؟ فقال: يا أم حارثة إنها جنان في الجنة وإن ابنك أصاب الفردوس الأعلى.';
const String p17 =
    'استشهاد عوف بن الحارث: قال ابن اسحاق حدثني عاصم بن عمرو بن قتادة: أن عوف بن مالك وهو ابن عفراء قال: يارسول الله مايضحك الرب من عبده؟ قال: غمْسة يده في العدو حاسراً فنزع درعاً كانت عليه فقذفها ثم أخذ سيفه فقاتل القوم حتى قتل.';
const String p18 =
    'سعد بن خيثمة وأبيه رضي الله عنهم: قال الحافظ بن حجر: قال موسى بن عقبة عن ابن شهاب: استهم يوم بدر سعد بن خيثمة وأبوه فخرج سهم سعد فقال له أبوه: يابني آثرني اليوم فقال سعد: ياأبت لو كان غير الجنة فعلت فخرج سعد إلى بدر فقتل بها وقتل أبوه خيثمة يوم أحد.';
const String p19 =
    'عن عبادة بن الصامت رضي الله عنه قال: خرجنا مع النبي ﷺ فشهدت معه بدراً، فالتقى الناس فهزم الله تبارك وتعالى العدو فانطلقت طائفة في آثارهم يهزمون ويقتلون، فأكبت طائفة على العسكر يحوونه ويجمعونه وأحدقت طائفة برسول الله ﷺ لا يصيب العدو منه غرة حتى اذا كان الليل وفاء الناس بعضهم الى بعض قال الذين جمعوا الغنائم: نحن حوّيناها وجمعناها فليس لأحد فيها نصيب وقال الذين خرجوا في طلب العدو: لستم بأحق بها منا نحن نفينا عنها العدو وهزمناهم، وقال الذين أحدقوا برسول الله ﷺ وخفنا أن يصيب العدو منه غرة واشتغلنا به فنزلت: يَسْأَلُونَكَ عَنِ الأَنْفَالِ قُلِ الأَنْفَالُ لِلَّهِ وَالرَّسُولِ فَاتَّقُوا اللَّهَ وَأَصْلِحُوا ذَاتَ بَيْنِكُمْ وَأَطِيعُوا اللَّهَ وَرَسُولَهُ إِنْ كُنْتُمْ مُؤْمِنِينَ - سورة الانفال، فقسمها رسول الله ﷺ على فواق بين المسلمين.';
const String p20 =
    'لقد خلّد الله سبحانه وتعالى ذكرى غزوة بدر في سورة الأنفال، وجاءت مفصلة عن أحداثها وأسبابها ونتائجها وتعرضت الآيات الكريمة لعلاج النفس البشرية وتربيتها على معاني الإيمان العميق والتكوين الدقيق فبدأت السورة بتبيان حكم أثر من آثار القتال وهو الغنائم، فبينت أن هذه الغنائم لله والرسول فالله هو مالك كل شيء ورسوله هو خليفته ثم أمر الله المؤمنين ثلاثة أوامر: بالتقوى وإصلاح ذات البين والطاعة لله والرسول ﷺ وهي أوامر مهمة جداً في موضوع الجهاد، فالجهاد إذا لم ينشأ عن تقوى فليس جهاداً والجهاد يحتاج الى وحدة صف ومن ثم فلابد من إصلاح ذات البين والانضباط هو الأساس في الجهاد إذ لا جهاد بلا انضباط، ثم بين الله عز وجل أن الطاعة لله والرسول ﷺ علامة الإيمان.';
const String p21 =
    'كان رسول الله ﷺ لايكلف المسلمين فوق طاقتهم سواء كان ذلك في السلم أو الحرب، وفي غزوة بدر أعفى النبي ﷺ بعض الصحابة لأن ظروفهم الأسرية تتطلب منهم القيام عليها ورعايتها، فقد أعفى عثمان بن عفان رضي الله عنه من الخروج يوم بدر لأن زوجته رقية كانت مريضة وبحاجة إلى من يرعى شؤونها روى البخاري في صحيحه أن عبدالله بن عمر رضي الله عنهما أخبر عن سبب تغيب عثمان رضي الله عنه في غزوة بدر فقال رضي الله عنه: ... وما تغيبه عن بدر فإنه كانت تحته بنت رسول الله ﷺ وكانت مريضة فقال له رسول الله ﷺ : إن لك أجر رجل ممن شهد بدراً وسهمه.';
const String p22 =
    'قال ابن عباس رضي الله عنه: .. فلما أسروا الأسارى قال رسول الله ﷺ لأبي بكر وعمر: ماترون في هؤلاء الأسارى؟فقال أبو بكر: يانبي الله هم بنو العم والعشيرة: أرى أن تأخذ منهم فدية فتكون لنا قوة على الكفار فعسى الله أن يهديهم إلى الإسلام، فقال رسول الله ﷺ : ماترى يا ابن الخطاب؟ قال: لاوالله يارسول الله ما أرى الذي يراه أبو بكر ولكن أرى أن تمكننا منهم فنضرب أعناقهم فتمكن علياً من عقيل فيضرب عنقه وتمكنني من فلان نسيباً لعمر فأضرب عنقه فإن هؤلاء أئمة الكفر وصناديدها فهو رسول الله ﷺ ماقال أبو بكر ولم يهو ما قلت: فلما كان من الغد جئت فإذا رسول الله ﷺ وأبو بكر قاعدين يبكيان قلت يارسول الله أخبرني من أي شيء تبكي أنت وصاحبك فإن وجدت بكاء بكيت وإن لم أجد بكاء تباكيت لبكائكما، فقال رسول الله ﷺ : أبكي للذي عرض عليّ أصحابك من أخذهم الفداء ولقد عرض عليّ عذابهم أدنى من هذه الشجرة - شجرة قريبة من نبي الله ﷺ وأنزل الله عزوجل: مَا كَانَ لِنَبِيٍّ أَنْ يَكُونَ لَهُ أَسْرَى حَتَّى يُثْخِنَ فِي الأَرْضِ - إلى قوله: فَكُلُوا مِمَّا غَنِمْتُمْ حَلالا طَيِّبًا، فأحل الله لهم الغنيمة.';
const String p23 =
    'وهذه الآية تضع قاعدة هامة في بناء الدولة حينما تكون في مرحلة التكوين والإعداد وكيف ينبغي ألا تظهر بمظهر اللين حتى ترهب من قبل أعدائها وفي سبيل هذه الكلية يطرح الاهتمام بالجزئيات حتى ولو كانت الحاجة ملحة إليها .';
const String p24 =
    'كانت معاملة النبي ﷺ للأسرى تحفها الرحمة والعدل والحزم والأهداف الدعوية ولذلك تعددت أساليبه وتنوعت طرق تعامله عليه الصلاة والسلام فهناك من قتله وبعضهم قبل فيهم الفداء والبعض الآخر منّ عليهم وآخرون اشترط عليهم تعليم عشرة من أبناء المسلمين مقابل المن عليهم.';
const String p25 =
    'كانت من نتائج غزوة بدر أن قويت شوكة المسلمين وأصبحوا مرهوبين في المدينة وما جاورها، وأصبح من يريد أن يغزو المدينة أو ينال من المسلمين أن يفكر ويفكر قبل أن يقدم عل فعلته وتعززت مكانة الرسول في المدينة وارتفع نجم الاسلام فيها ولم يعد المتشككون بالدعوة الجديدة والمشركون في المدينة يتجرؤون على إظهار كفرهم وعداوتهم للإسلام، لذا ظهر النفاق والمكر والخداع فأعلنوا إسلامهم ظاهراً أمام النبي ﷺ وأصحابه فدخلوا في عداد المسلمين وأبقوا على الكفر باطناً.';
const String p26 =
    'كسب المسلمون مهارة عسكرية وأساليب جديدة في الحرب وشهرة واسعة في داخل الجزيرة العربية وخارجها إذ أصبحوا قوة يحسب لها حسابها في بلاد العرب وانتعش حال المسلمين المادي والاقتصادي بما أفاء الله عليهم من غنائم بعد بؤس وفقر شديدين داما تسعة عشر شهراً.';
const String p27 =
    'أما قريش فكانت خسارتها فادحة فإضافة الى مقتل أبي جهل بن هشام وأمية بن خلف وعتبة بن ربيعة وغيرهم من زعماء الكفر الذين كانوا من أشد القرشين شجاعة وقوة وبأساً، ولم تكن بدر خسارة حربية لقريش فحسب بل خسارة معنوية أيضاً ذلك أن المدينة لم تعد تهدد تجارتها فقط بل أصبحت تهدد أيضاً سيادتها ونفوذها في الحجاز كله فكان خبر الهزيمة على أهل مكة كالصاعقة.';
const String p28 =
    'إن حقيقة النصر في بدر كان من الله تعالى، قال سبحانه: وَسَارِعُوا إِلَى مَغْفِرَةٍ مِنْ رَبِّكُمْ وَجَنَّةٍ عَرْضُهَا السَّمَوَاتُ وَالأَرْضُ أُعِدَّتْ لِلْمُتَّقِينَ - سورة آل عمران، فقد بين سبحانه وتعالى أن النصر لايكون إلا من عند الله تعالى في قوله: وَمَا جَعَلَهُ اللَّهُ إِلا بُشْرَى لَكُمْ وَلِتَطْمَئِنَّ قُلُوبُكُمْ بِهِ وَمَا النَّصْرُ إِلا مِنْ عِنْدِ اللَّهِ الْعَزِيزِ الْحَكِيمِ - سورة آل عمران، وقوله تعالى: وَمَا جَعَلَهُ اللَّهُ إِلا بُشْرَى وَلِتَطْمَئِنَّ بِهِ قُلُوبُكُمْ وَمَا النَّصْرُ إِلا مِنْ عِنْدِ اللَّهِ إِنَّ اللَّهَ عَزِيزٌ حَكِيمٌ - سورة الأنفال';
const String p29 =
    'وأمر سبحانه وتعالى المؤمنين أن يتذكروا دائماً تلك النعمة العظيمة نعمة النصر في بدر ولاينسوا من أذهانهم كيف كانت حالتهم قبل النصر قال تعالى: وَاذْكُرُوا إِذْ أَنْتُمْ قَلِيلٌ مُسْتَضْعَفُونَ فِي الأَرْضِ تَخَافُونَ أَنْ يَتَخَطَّفَكُمُ النَّاسُ فَآوَاكُمْ وَأَيَّدَكُمْ بِنَصْرِهِ وَرَزَقَكُمْ مِنَ الطَّيِّبَاتِ لَعَلَّكُمْ تَشْكُرُونَ - سورة الأنفال';
const String p30 =
    'قال تعالى: وَاعْلَمُوا أَنَّمَا غَنِمْتُمْ مِنْ شَيْءٍ فَأَنَّ لِلَّهِ خُمُسَهُ وَلِلرَّسُولِ وَلِذِي الْقُرْبَى وَالْيَتَامَى وَالْمَسَاكِينِ وَابْنِ السَّبِيلِ إِنْ كُنْتُمْ ءَامَنْتُمْ بِاللَّهِ وَمَا أَنْزَلْنَا عَلَى عَبْدِنَا يَوْمَ الْفُرْقَانِ يَوْمَ الْتَقَى الْجَمْعَانِ وَاللَّهُ عَلَى كُلِّ شَيْءٍ قَدِيرٌ - سورة الأنفال';
const String p31 =
    'كانت فرقاناً بين الحق والباطل فعلاً ولكنه الحق الأصيل الذي قامت عليه السماوات والأرض وقامت عليه فطرة الأحياء والأشياء الحق الذي يتمثل في تفرد الله سبحانه بالألوهية والسلطان والتدبير والتقدير وفي عبودية الكون كله سمائه وأرضه أشيائه وأحيائه لهذه الألوهية المتفردة ولهذا السلطان المتوحد ولهذا التدبير وهذا التقدير بلا معقب ولاشريك والباطل الزائف الطارئ الذي كان يعم وجه الأرض، إذ ذاك ويغشي على ذلك الحق الأصيل ويقيم في الأرض طواغيت تتصرف في حياة عباد الله بما تشاء وأهواء تصرف أمر الحياة والأحياء فهذا الفرقان الكبير الذي تم يوم بدر حيث فرق بين ذلك الحق الكبير وهذا الباطل الطاغي وزيل بينهما فلم يعودا يلتبسان.';
const String p32 =
    'رسمت غزوة بدر لأجيال الأمة صوراً مشرقة في الولاء والبراء وجعلت خطاً فاصلاً بين الحق والباطل، فكانت الفرقان النفسي والمادي والمفاصلة التامة بين الإسلام والكفر، وفيها تجسدت هذه المعاني فعاشها الصحابة واقعاً مادياً وحقيقة نفسية وفيها تهاوت القيم الجاهلية فالتقى الابن بأبيه والأخ بأخيه فكان أبو حذيفة بن عتبة بن ربيعة في صف المسلمين وكان أبوه عتبة وأخوه الوليد وعمه شيبة في صف المشركين وقد قتلوا جميعاً في المبارزة الأولى، وكان أبو بكر الصديق في صف المسلمين وكان ابنه عبدالرحمن في صف المشركين.';
