const int sectionIndex = 58;
const String sectionTitle = 'غزوة خيبر';

const List t1 = ['1', 'وأثابكم فتحا قريباً'];
const List t2 = ['2', 'حقد اليهود'];
const List t3 = ['3', 'مسير الجيش الإسلامي الى خيبر'];
const List t4 = ['4', 'معرفة أخبار العدو'];
const List t5 = ['5', 'دعاء دخول القرية'];
const List t6 = ['6', 'تساقط حصون خيبر'];
const List t7 = ['7', 'حصن ناعم'];
const List t8 = ['8', 'رجل يحبه الله ورسوله'];
const List t9 = ['9', 'فرار اليهود وحصارهم'];
const List t10 = ['10', 'الأعرابي الشهيد'];
const List t11 = ['11', 'الراعي الأسود'];
const List t12 = ['12', 'بطل لكنه الى النار'];
const List t13 = ['13', 'قدوم جعفر ومن معه من الحبشة'];
const List t14 = ['14', 'تقسيم الغنائم'];
const List t15 = ['15', 'زواج رسول الله من صفية بنت حيي بن أخطب'];
const List t16 = ['16', 'قصة الشاة المسمومة '];

const String p1 = 'ذكر ابن اسحاق أنها كانت في المحرم من السنة السابعة للهجرة';
const String p2 =
    'تفرغ المسلمون بعد صلح الحديبية لتصفية خطر يهود خيبر الذي أصبح يهدد أمن المسلمين، ولقد تضمنت سورة الفتح التي نزلت بعد الحديبية وعداً إلهياً بفتح خيبر وحيازة أموالها غنيمة، قال تعالى: لَقَدْ رَضِيَ اللَّهُ عَنِ الْمُؤْمِنِينَ إِذْ يُبَايِعُونَكَ تَحْتَ الشَّجَرَةِ فَعَلِمَ مَا فِي قُلُوبِهِمْ فَأَنْزَلَ السَّكِينَةَ عَلَيْهِمْ وَأَثَابَهُمْ فَتْحًا قَرِيبًا وَمَغَانِمَ كَثِيرَةً يَأْخُذُونَهَا وَكَانَ اللَّهُ عَزِيزًا حَكِيمًا - سورة الفتح';
const String p3 =
    'لم يُظهر يهود خيبر العداء للمسلمين حتى نزل فيهم زعماء بني النضير الذي حز في نفوسهم إجلاؤهم عن ديارهم، ولم يكن الإجلاء كافياً لكسر شوكتهم، فقد غادروا المدينة ومعهم النساء والأبناء والأموال وخلفهم القيان يضربن الدفوف والمزامير بزهاء وفخر مارئي مثله في حي من الناس في زمانهم، وكان من أبرز زعماء بني النضير الذين نزلوا في خيبر هم سلام بن أبي الحقيق وكنانة بن أبي الحقيق وحيي بن أخطب فلما نزلوا دان لهم أهلها.';
const String p4 =
    'وكان تزعم هؤلاء ليهود خيبر كافياً في جرها الى الصراع والتصدي والانتقام من المسلمين، فقد كان يدفعهم حقد دفين ورغبة قوية في العودة الى ديارهم داخل المدينة، وكان أول تحرك قوي ماحدث في غزوة الأحزاب حيث كان لخيبر وعلى رأسها زعماء بني النضير دور كبير في حشد قريش والأعراب ضد المسلمين وتسخير أموالهم في ذلك، ثم سعيهم في إقناع بني قريظة بالغدر والتعاون مع الاحزاب، بل إنهم أنفقوا أموالهم واستغلوا علاقاتهم مع يهود بني قريظة من أجل نصرة الأحزاب وطعن المسلمين في ظهورهم، وهكذا أصبحت خيبر مصدر خطر كبير على المسلمين ودولتهم النامية.';
const String p5 =
    'سار الجيش الى خيبر بروح إيمانية عالية على الرغم من علمهم بمنعة حصون خيبر وشدة بأس رجالها وعتادها الحربي وكانوا يكبرون ويهللون بأصوات مرتفعة، فطلب منهم النبي ﷺ أن يرفقوا بأنفسهم: قائلاً: أيها الناس تدعون سميعاً قريباً وهو معكم.';
const String p6 =
    'وعندما وصل الجيش الاسلامي بالصهباء -أدنى خيبر- صلى العصر، ثم دعا بالأزواد فلم يؤت إلاّ السويق -طعام من شعير- فأمر به فثري، فأكل وأكل معه الصحابة، ثم قام الى المغرب فمضمض ثم صلى بالصحابة ولم يتوضأ.';
const String p7 =
    'كان ﷺ قد بعث عباد بن بشر رضي الله عنه في سرية استطلاعية يتلقط أخبار العدو ويستطلع إن كان هناك كمائن، فلقي في الطريق عيناً لليهود من أشجع فقال: من أنت؟ قال: باغ ابتغي أبعرة ضلت لي وأنا على إثرها، قال عباد: ألك علم بخيبر؟ قال: عهدي بها حديث، فيم تسألني عنه؟ قال: عن اليهود؟ قال: نعم، كان كنانة بن أبي الحقيق وهوذة بن قيس ساروا في حلفائهم من غطفان فاستنفروهم وجعلوا لهم ثمر خيبر سنة، فجاءوا معدين مؤيدين بالكراع والسلاح يقودهم عتبة بن بدر، ودخلوا معهم في حصونهم وفيهم عشرة آلاف مقاتل، وهم أهل الحصون التي لا ترام وسلاح وطعام كثير لو حصرو لسنين لكفارهم وماء وأتى يشربون في حصونهم، ما أرى لأحد بهم طاقة، فرفع عباد بن بشر السوط فضربه ضربات وقال: ما أنت إلا عين لهم، أصدقني وإلا ضربت عنقك! فقال الاعرابي: القوم مرعوبون منكم خائفون، وجلون لما صنعتم بمن كان بيثرب من اليهود وقال لي كنانة: اذهب معترضاً للطريق فإنهم لايستنكرون مكانك واحزرهم لنا، وادن منهم كالسائل لهم ماتقوى به، ثم ألق إليهم كثرة عددنا ومادتنا، فإنهم لن يدعوا سؤلك وعجل الرجعة إلينا بخبرهم.';
const String p8 =
    'وعندما وصل جيش المسلمين الى مشارف خيبر، قال رسول الله ﷺ لأصحابه: قفوا ثم قال: اللهم رب السموات وما أظللن ورب الأرضين وما أقللن، ورب الشياطين وماأظللن، ورب الرياح وما ذرين، فإنا نسألك خير هذه القرية وخير أهلها وخير مافيها، ونعوذ بك من شرها وشر أهلها وشر مافيها، أقدموا باسم الله، وكان يقولها لكل قرية دخلها.';
const String p9 =
    'ولما أدرك رسول الله ﷺ الليل أمر الجيش بالنوم على مشارف خيبر ثم استيقظوا مبكرين، وضربوا خيامهم ومعسكرهم بوادي الرجيع، وهو وادي يقع بين خيبر وغطفان حتى يقطعوا المدد عن يهود خيبر من قبيلة غطفان، ولما أصبح الصبح خرجت اليهود بمساحيهم ومكاتلهم، فلما رأوا جيش المسلمين قالوا: محمد والله محمد والخميس، فقال النبي ﷺ : الله أكبر خربت خيبر، إنا إذا نزلنا بساحة قوم فساء صباح المنذرين.';
const String p10 =
    'هرب اليهود الى حصونهم وحاصرهم المسلمون، وأخذوا في فتح حصونهم واحداً تلو الآخر، وكان أول ماسقط من حصونهم ناعم والصعب بمنطقة النطاة وأبى النزار بمطقة الشق، وكانت هاتان المنطقتان في الشمال الشرقي من خيبر، ثم حصن القموص المنيع في منطقة الكتيبة وهو حصن ابن أبي الحقيق، ثم اسقطوا حصني منطقة الوطيح والسلالم.';
const String p11 =
    'واجه المسلمون مقاومة شديدة وصعوبة كبيرة عند فتح بعض هذه الحصون، منها حصن ناعم الذي استشهد تحته محمود بن مسلمة الأنصاري، حيث ألقى عليه مرحب رحى من أعلى الحصن، والذي استغرق فتحه عشرة أيام، فقد حمل راية المسلمين عند حصاره أبو بكر الصديق ولم يفتح الله عليه.';
const String p12 =
    'عندما جهد الناس فى فتح الحصن قال رسول الله ﷺ إنه سيدفع اللواء غداً الى رجل يحبه الله ورسوله ويحب الله ورسوله لا يرجع حتى يفتح له، فطابت نفوس المسلمين فلما صلى فجر اليوم الثالث دعا علي بن أبي طالب رضي الله عنه ودفع إليه اللواء فحمله فتم فتح الحصن على يديه، وكان علي يشتكي من رمد في عينيه عندما دعاه الرسول ﷺ ، فبصق رسول الله ﷺ في عينيه ودعا له، فبرئ ولقد أوصى الرسول ﷺ علياً بأن يدعو اليهود الى الاسلام قبل أن يداهمهم وقال له: فوالله لأن يهدي الله بك رجلاً واحداً خير لك من أن تكون لك حمر النعم، وعندما سأله علي: يارسول الله على ماذا أقاتل الناس؟ قال: قاتلهم حتى يشهدوا أن لا إله إلا الله وأن محمداً رسول الله، فإذا فعلوا ذلك منعوا منك دماءهم وأموالهم إلا بحقها وحسابهم على الله.';
const String p13 =
    'وعندما حاصر المسلمين لهذا الحصن برز لهم سيده وبطلهم مرحب وكان سبباً في استشهاد عامر بن الأكوع ثم بارزه علي فقتله، مما أثر سلبياً في معنويات اليهود ومن ثم هزيمتهم.';
const String p14 =
    'ووردت مجموعة من روايات تخبر بأن علي رضي الله عنه تترس بباب عظيم كان عند حصن ناعم بعد أن أسقط يهودي ترسه من يده، وكلها روايات ضعيفة، وعدم الاعتماد عليها لا ينفي قوة علي وشجاعته فيكفيه ماثبت في ذلك وهو كثير.';
const String p15 =
    'توجه المسلمون الى حصن الصَّعْب بن مُعاذ بعد فتح حصن ناعم وأبلى حامل رايتهم الحباب بن المنذر بلاء حسناً حتى افتتحوه بعد ثلاثة أيام، ووجدوا فيه الكثير من الطعام والمتاع، يوم كانوا في ضائقة من قلة الطعام ثم توجهوا بعده الى حصن قلعة الزبير الذي اجتمع فيه الفارون من حصن ناعم والصعب وبقية مافتح من حصون يهود فحاصروه وقطعوا عنه مجرى الماء الذي يغذيه فاضطروهم الى النزول للقتال، فهزموهم بعد ثلاثة أيام وبذلك تمت السيطرة على آخر حصون منطقة النَّطاة التي كان فيها أشد اليهود، ثم توجهوا الى حصون منطقة الشِّق وبدأو بحصن أُبَيّ فاقتحموه، وأفلت بعض مقاتلته الى حصن نَزار وتوجه إليهم المسلمون فحاصروهم ثم افتتحوا الحصن، وفر بقية أهل الشق من حصونهم وتجمعوا في حصن القَمُوص المنيع وحصن الوطيح وحصن السُّلاَلم، فحاصرهم المسلمون لمدة أربعة عشر يوماً حتى طلبوا الصلح.';
const String p16 =
    'وبذلك تساقطت سائر الحصون اليهودية أمام قوات المسلمين وقد بلغ قتلى اليهود في معارك خيبر ثلاثة وتسعين رجلاً، وسبيت النساء والذراري ومنهن صفية بنت حيي بن أخطب فاعتقها رسول الله ﷺ وتزوجها.';
const String p17 =
    'جاء رجل من الأعراب الى النبي ﷺ فآمن به واتبعه فقال: أهاجر معك؟ فأوصى به بعض أصحابه، فلما كانت غزوة خيبر غنم رسول الله ﷺ شيئاً فقسمه وقسم للأعرابي فأعطى أصحابه ماقسم له، وكان يرعى ظهرهم فلما جاء دفعوه إليه فقال: ماهذا ؟ قالوا: قسم قسمه لك رسول الله ﷺ ، فأخذه فجاء به للنبي ﷺ فقال: ماهذا يارسول الله؟ قال: قسم قسمته لك، قال: ما على هذا اتبعك، ولكن اتبعتك على أن أرمي هاهنا وأشار الى حلقه، بسهم فأموت فأدخل الجنة، فقال: إن تصدق الله يصدقك ثم نهض الى قتال العدو، فأتي به الى النبي ﷺ ، وهو مقتول فقال: أهو هو؟ قالوا: نعم قال: صدق الله فصدقه، فكفنه النبي ﷺ في جبته، ثم قدمه فصلى عليه، وكان من دعائه له: اللهم هذا عبدك خرج مهاجراً في سبيلك قتل شهيداً وأنا عليه شهيد.';
const String p18 =
    'وجاء عبد أسود حبشي من أهل خيبر كان في غنم لسيده، فلما رأى أهل خيبر قد أخذوا السلاح وسألهم: ماتريدون؟ قالوا: نقاتل هذا الذي يزعم أنه نبي، فوقع في نفسه ذكر النبي، فأقبل بغنمه الى رسول الله ﷺ فقال: ماذا تقول؟ وماتدعو إليه؟ قال: أدعوا الى الاسلام وأن تشهد أن لا إله إلا الله وأني رسول الله وألا نعبد إلا الله، قال العبد: فمالي إن شهدت وآمنت بالله عز وجل قال: لك الجنة ان مت على ذلك، فأسلم ثم قال: يانبي الله: إن هذه الغنم عندي أمانة فقال رسول الله ﷺ : أخرجها من عندك وارمها بـ الحصباء فإن الله سيؤدي عنك أمانتك، ففعل، فرجعت الغنم الى سيدها فعلم اليهودي أن غلامه قد أسلم، فقام رسول الله ﷺ في الناس فوعظهم وحضهم على الجهاد فلما التقى المسلمون واليهود قتل -فيمن قتل- العبد الاسود واحتمله المسلمون الى معسكرهم، فأدخل في الفسطاط فزعموا أن رسول الله ﷺ اطلع في الفسطاط، ثم أقبل على أصحابه وقال: لقد أكرم الله هذا العبد وساقه الى خيبر، ولقد رأيت عند راسه اثنتين من الحور العين، ولم يصل لله سجدة قط.';
const String p19 =
    'كان في جيش المسلمين بخيبر رجل لايدع للمشركين شاذة ولا فاذة إلا أتبعها يضربها بسيفه، فقال رسول الله ﷺ : أما إنه من أهل النار فقالوا: أينا من أهل الجنة إن كان من أهل النار؟ فقال رجل: والله لايموت على هذه الحال أبداً، فاتبعه حتى جرح فاشتدت جراحته واستعجل الموت، فوضع سيفه بالأرض وذبابه بين ثدَييه، ثم تحامل عليه فقتل نفسه، فجاء رجل الى رسول الله فقال: أشهد إنك رسول الله قال: وماذاك فأخبره، فقال النبي ﷺ : إن الرجل ليعمل بعمل أهل الجنة فيما يبدو للناس وإنه من أهل النار، وإنه ليعمل بعمل أهل النار فيما يبدو للناس وإنه لمن أهل الجنة.';
const String p20 =
    'قدم جعفر بن أبي طالب وصحبه من مهاجري الحبشة على رسول الله يوم فتح خيبر، فقبل رسول الله ﷺ بين عينيه والتزمه وقال: ما أدري بأيهما أنا أسر بفتح خيبر أم بقدوم جعفر، وكان ﷺ قد ارسل في طلبهم من النجاشي، عمرو بن أمية الضمري فحملهم في سفينتين ووافق قدومهم عليه يوم فتح خيبر، وقد رافق جعفر في قدومه أبو موسى الاشعري ومن كان بصحبته من الأشعريين، فعن أبي موسى الاشعري رضي الله عنه قال: بلغنا مخرج النبي ﷺ ونحن باليمن، فخرجنا مهاجرين إليه أنا وأخوان لي أنا أصغرهم أحدهم أبو بردة والآخر أبو رهم إما قال: في بضع وإما قال في ثلاثة وخمسين أو اثنين وخمسين رجلاً من قومي، فركبنا السفينة فألقتنا سفينتنا الى النجاشي بالحبشة فوافقنا جعفر بن ابي طالب فأقمنا جميعاً، فوافقنا النبي ﷺ حين افتتح خيبر.';
const String p21 =
    'لقد مكث جعفر وإخوانه في الحبشة بضعة عشر عاماً، نزل خلالها قرآن كثير ودارت معارك شتى مع الكفار وتقلب المسلمون قبل الهجرة العامة وبعدها في أطوار متباينة، حتى ظن البعض أن مهاجري الحبشة - وقد فاتهم هذا كله - أقل قدراً من غيرهم.';
const String p22 =
    'كانت غزوة خيبر من أكثر غزوات الرسول ﷺ غنيمة، من حيث الأراضي والنخيل والثياب والأطعمة وقد غنم المسلمون كثيراً من الأطعمة، فقد وجدوا فيها الشحم والزيت والعسل والسمن وكذلك الثياب والأثاث والابل والبقر والغنم.';
const String p23 =
    'وكان من بين ماغنم المسلمون من يهود خيبر عدة صحف من التوراة فطلب اليهود ردّها، فأمر بتسليمها إليهم ولم يصنع ﷺ ماصنع الرومان حينما فتحوا أورشليم وأحرقوا الكتب المقدسة، وداسوها بأرجلهم ولا ماصنع النصارى في حروب اضطهاد اليهود في الأندلس حين أحرقوا كذلك صحف التوراة.';
const String p24 =
    'وقد أبقى رسول الله ﷺ يهود خيبر فيها على أن يعملوا في زراعتها وينفقوا عليها من أموالهم ولهم نصف ثمارها، على أن للمسلمين حق إخراجهم منها متى أرادوا وكان اليهود قد بادروا بعرض ذلك على النبي ﷺ وقالوا: نحن أعلم بالأرض منكم فوافق على ذلك بعد أن همّ بإخراجهم منها، وقد اشترط عليهم أن يجليهم عنها متى شاء وهنا تظهر براعة سياسية جديدة في عقد الشروط، فإن بقاء اليهود في الأرض يفلحونها يوفر للمسليمن الجنود المجاهدين في سبيل الله، ومن جهة أخرى فإن اليهود هم أصحاب الأرض وهم أدرى بفلاحتها من غيرهم، فبقاؤهم فيها يعطي ثمرة أكثر وأجود وبخاصة وأنهم لن يأخذوا أجراً ولكنهم سيأخذون نصف مايخرج من الأرض قلّ أو كثر.';
const String p25 =
    'وجعل رسول الله ﷺ عبدالله بن رواحة يأتيهم كل عام فيخرصها عليه ثم يضمّنهم الشطر، فشكوا الى رسول الله ﷺ شدة خرصه وأرادوا أن يُرْشُوه فقال: يا أعداء الله تطعموني السُّحت؟ والله لقد جئتكم من عند أحب الناس إلي ولأنتم أبغض الناس إليَّ من عدتكم من القردة والخنازير، ولا يحملني بغضي إياكم وحبي إياه على أن لا أعدل عليكم فقالوا: بهذا قامت السموات والأرض.';
const String p26 =
    'لما فتح المسلمون القموص -حصن بني أبي الحقيق- كانت صفية في السبي فأعطاها دِحية الكلبي، فجاء رجل الى النبي ﷺ فقال يارسول الله: أعطيت دحية صفية بنت حيي سيدة قومها، وهي ماتصلح إلا لك، فاستحسن النبي ﷺ ما أشار به الرجل، وقال لدحية خذ جارية من السبي غيرها ثم أخذها رسول الله ﷺ وأعتقها وجعل عتقها صداقها، ثم تزوجها بعد أن طهرت من حيضتها وبعد أن أسلمت.';
const String p27 =
    'ولم يخرج النبي ﷺ من خيبر حتى طهرت صفية من حيضها فحملها وراءه، فلما صار الى منزل على ستة أميال من خيبر مال يريد أن يعرّس بها فأبت عليه فوجد في نفسه، فلما كان بالصهباء نزل بها هناك فمشطتها أم سليم وعطرتها وزفتها الى النبي ﷺ وبنى بها، فسألها ماحملك على الامتناع من النزول أولاً فقالت: خشيت عليك من قرب اليهود فعظمت في نفسه ومكث رسول الله بالصهباء ثلاثة أيام وأولم عليها ودعا المسلمين وماكان فيها من لحم وإنما التمر والأقط والسمن، فقال المسلمون: إحدى أمهات المؤمنين أو ماملكت يمينه فلما أرتحل وطَّأ له خلفه ومدّ عليها الحجاب فأيقنوا أنها إحدى أمهات المؤمنين.';
const String p28 =
    'وقد كانت أم المؤمنين صفية بنت حيي قد رأت رؤية، فقد روى البيهقي رحمه الله بإسناد صحيح عن ابن عمر رضي الله عنهما في حديث طويل قال: ورأى رسول الله ﷺ بعين صفية خضرة فقال: ياصفية ماهذه الخضرة؟ فقالت: كان راسي في حجر ابن حقيق وأنا نائمة، فرأيت كأن قمراً وقع في حجري فأخبرته بذلك فلطمني وقال تمنين ملك يثرب.';
const String p29 =
    'قال ابو هريرة رضي الله عنه: لما فتحت خيبر أهديت لرسول الله ﷺ شاة فيها سم، فقال رسول الله ﷺ : اجمعوا لي من كان هاهنا من اليهود فجمعوا له، فقال لهم رسول الله ﷺ : إني سائلكم عن شيء فهل أنتم صادقي عنه؟ فقالوا: نعم يا أبا القاسم.';
const String p30 = 'فقال لهم رسول الله ﷺ : من أبوكم؟ قالوا: أبونا فلان';
const String p31 = 'فقال رسول الله ﷺ : كذبتم بل ابوكم فلان فقالوا: صدقت وبررت';
const String p32 =
    'فقال: هل أنتم صادقي عن شيء إن سألتكم عنه؟ فقالوا: نعم يا أبا القاسم، وإن كذبناك عرفت كذبنا كما عرفته في ابينا';
const String p33 =
    'قال لهم رسول الله ﷺ : من أهل النار؟ فقالوا: نكون فيها يسيراً ثم تخلفوننا';
const String p34 =
    'فقال لهم رسول الله ﷺ : أخسؤوا فيها والله لانخلفكم فيها أبداً';
const String p35 =
    'ثم قال لهم: فهل أنتم صادقي عن شيء إن سالتكم عنه؟ قالوا: نعم';
const String p36 = 'فقال: هل جعلتم في هذه الشاة سماً فقالوا: نعم';
const String p37 =
    'فقال: ماحملكم على ذلك؟ فقالوا: اردنا إن كنت كاذباً نستريح منك وإن كنت نبياً لم يضرك';
const String p38 =
    'قال: صاحب بلوغ الأماني عن الشاة المسمومة: اهدتها اليه زينب بنت الحارث اليهودية امرأة سلام بن مشكم، وكانت سألت أي عضو من الشاة أحب إليه؟ فقيل: الذراع، فاكثرت فيها من السم، فلما تناول الذراع لاك منها مضغة ولم يسغها، وأكل منها معه بشر بن البراء فأساغ لقمة ومات منها، وقال ابن القيم: وجيء بالمرأة الى رسول الله، فقالت: اردت قتلك فقال: ماكان الله ليسلطك علي، قالوا: ألا تقتلها؟ قال: لا ولم يتعرض لها ولم يعاقبها، واحتجم على الكاهل وأمر من اكل منها فاحتجم فمات بعضهم.';
const String p39 =
    'وقد اختلف في قتل المرأة والصحيح أنه لما مات بشر، قتلها ولقد كان السم الذي وضعته اليهودية قوياً جداً إذ مات بشر بن البراء فوراً، وبقي رسول الله ﷺ يعاوده ألم السم حتى انتقل الى الرفيق الاعلى بعد أن بلّغ الرسالة، وأدى الأمانة، ونصح الأمة وتركها على المحجة البيضاء ليلها كنهارها، وقد روى الامام البخاري رحمه الله في صحيحه عن عائشة رضي الله عنها قالت: كان النبي ﷺ يقول في مرض موته الذي مات فيه: ياعائشة ما أزال أجد ألم الطعام الذي أكلت بخيبر، فهذا أوان وجدت انقطاع ابهري من ذلك السم.';
