const int sectionIndex = 69;
const String sectionTitle = 'غزوة تبوك - الأستعداد للخروج';

const List t1 = ['1', 'المناقفين وتثبيط الهمم'];
const List t2 = ['2', 'ألا في الفتنة سقطوا'];
const List t3 = ['3', 'استئذان المنافقين للقعود'];
const List t4 = ['4', 'التميز بين المؤمنين والمنافقين'];
const List t5 = ['5', 'مراقبة المسلمين للمنافقين واليهود'];
const List t6 = ['6', 'أعلان النفير'];
const List t7 = ['7', 'أسباب التصريح للخروج علنا'];
const List t8 = ['8', ' استخلاف على بن أبى طالب فى المدينة'];
const List t9 = ['9', 'تقسيم الرايات'];

const String p1 =
    'عندما أعلن الرسول ﷺ النفير ودعا إلى الإنفاق في تجهيز هذه الغزوة أخذ المنافقون في تثبيط همم الناس قائلين لهم: لا تنفروا في الحر، فأنزل الله تعالى فيهم: فَرِحَ الْمُخَلَّفُونَ بِمَقْعَدِهِمْ خِلافَ رَسُولِ اللَّهِ وَكَرِهُوا أَنْ يُجَاهِدُوا بِأَمْوَالِهِمْ وَأَنْفُسِهِمْ فِي سَبِيلِ اللَّهِ وَقَالُوا لا تَنْفِرُوا فِي الْحَرِّ قُلْ نَارُ جَهَنَّمَ أَشَدُّ حَرًّا لَوْ كَانُوا يَفْقَهُونَ فَلْيَضْحَكُوا قَلِيلا وَلْيَبْكُوا كَثِيرًا جَزَاءً بِمَا كَانُوا يَكْسِبُونَ - سورة التوبة';
const String p2 =
    'وقال رسول الله ﷺ وهو في جهازه لتبوك للجد بن قيس: ياجد هل لك العام في جلاد الأصفر؟ فقال: يارسول الله أوتأذن لي ولا تفتني؟ فوالله لقد عرف قومي أنه ما من رجل أشد عجباً بالنساء مني وإني أخشى إن رأيت نساء بني الأصفر أن لا أصبر، فأعرض عنه رسول الله ﷺ وقال: قد أذنت لك، وفيه نزلت الآية: وَمِنْهُمْ مَنْ يَقُولُ ائْذَنْ لِي وَلا تَفْتِنِّي أَلا فِي الْفِتْنَةِ سَقَطُوا وَإِنَّ جَهَنَّمَ لَمُحِيطَةٌ بِالْكَافِرِينَ - سورة التوبة، وذهب بعضهم إلى النبي ﷺ مبدين أعذاراً كاذبة ليأذن لهم بالتخلف فأذن لهم، فعاتبه الله بقوله: عَفَا اللَّهُ عَنْكَ لِمَ أَذِنْتَ لَهُمْ حَتَّى يَتَبَيَّنَ لَكَ الَّذِينَ صَدَقُوا وَتَعْلَمَ الْكَاذِبِينَ - سورة التوبة';
const String p3 =
    'لقد تحدث القرآن الكريم عن موقف المنافقين قبل الغزوة وأثنائها وبعدها، ومما جاء من حديث القرآن الكريم عن موقف المنافقين قبل غزوة تبوك مايتضمن استئذانهم وتخلفهم عن الخروج، وكان ممن تخلف عبدالله بن أبي سلول وقد تحدث القرآن عنهم فقال تعالى: لَوْ كَانَ عَرَضًا قَرِيبًا وَسَفَرًا قَاصِدًا لاتَّبَعُوكَ وَلَكِنْ بَعُدَتْ عَلَيْهِمُ الشُّقَّةُ وَسَيَحْلِفُونَ بِاللَّهِ لَوِ اسْتَطَعْنَا لَخَرَجْنَا مَعَكُمْ يُهْلِكُونَ أَنْفُسَهُمْ وَاللَّهُ يَعْلَمُ إِنَّهُمْ لَكَاذِبُونَ - سورة التوبة ، فقد بين سبحانه وتعالى موقف المنافقين وأنهم تخلفوا بسبب بعد المسافة وشدتها، وأنه لو كان الذي دعوتهم إليه - يامحمد - عرضاً من أعراض الدنيا ونعيمها وكان السفر سهلاً لاتبعوك في الخروج، ولكنهم تخلفوا ولم يخرجوا، فالآية تشرح وتوضح ملابسات موقفهم قبل الخروج إلى الغزوة وأسباب هذا الموقف، ثم حكى سبحانه وتعالى ماسيقوله هؤلاء المنافقون بعد عودة المؤمنين من هذه الغزوة: وَسَيَحْلِفُونَ بِاللَّهِ لَوِ اسْتَطَعْنَا لَخَرَجْنَا مَعَكُمْ يُهْلِكُونَ أَنْفُسَهُمْ وَاللَّهُ يَعْلَمُ إِنَّهُمْ لَكَاذِبُونَ ، كان نزول هذه الآية قبل رجوعه ﷺ من تبوك.';
const String p4 =
    'وقوله سبحانه: يُهْلِكُونَ أَنْفُسَهُمْ وَاللَّهُ يَعْلَمُ إِنَّهُمْ لَكَاذِبُونَ ، قال ابن عاشور: أي يحلفون مهلكين أنفسهم أي موقعينها في الهلك - والهلك الفناء والموت ويطلق على الأضرار الجسمية وهو المناسب هنا - أي يتسببون في ضر أنفسهم بالإيمان الكاذبة، وهو ضر الدنيا وعذاب الآخرة وفي هذه الآية دلالة على أن تعمد اليمين الفاجرة يفضي إلى الهلاك.';
const String p5 =
    'ثم عاتب الله تعالى نبينا محمداً ﷺ بقوله: عَفَا اللَّهُ عَنْكَ لِمَ أَذِنْتَ لَهُمْ حَتَّى يَتَبَيَّنَ لَكَ الَّذِينَ صَدَقُوا وَتَعْلَمَ الْكَاذِبِينَ ، قال مجاهد : نزلت هذه الآية في أناس قالوا: استأذنوا رسول الله ﷺ ، فإن أذن لكم فاقعدوا وإن لم يأذن لكم فاقعدوا وهؤلاء هم فريق من المنافقين، ومنهم عبدالله بن أبي سلول والجد بن قيس ورفاعة بن التابوت وكانوا تسع وثلاثين واعتذروا بأعذار كاذبة.';
const String p6 =
    'وهذه الآيات أول مانزل في التفرقة بين المؤمنين والمنافقين في القتال، فبين سبحانه أنه ليس من شأن المؤمنين بالله واليوم الآخر الاستئذان وترك الجهاد في سبيل الله، وإنما هذا من صفات المنافقين الذين يستأذنون من غير عذر وصفهم سبحانه بقوله: وَارْتَابَتْ قُلُوبُهُمْ ، أي: شكت في صحة ماجئتهم به، وقوله: فَهُمْ فِي رَيْبِهِمْ يَتَرَدَّدُونَ ، أي: يتحيرون يقدمون رجلاً ويؤخرون أخرى وليست لهم قدم ثابتة في شيء.';
const String p7 =
    'لقد كانت غزوة تبوك منذ بداية الإعداد لها مناسبة للتمييز بين المؤمنين والمنافقين، وضحت فيها الحواجز بين الطرفين ولم يعد هناك أي مجال للتستر على المنافقين أو مجاملتهم، بل أصبحت مجابهتهم أمراً ملحاً بعد أن عملوا كل مافي وسعهم لمجابهة الرسول والدعوة وتثبيط المسلمين عن الاستجابة للنفير الذي أعلنه الله تعالى ورسوله ﷺ ، والذي نزل به القرآن الكريم بل وأصبح الكشف عن نفاق المنافقين وإيقافهم عند حدهم واجباً شرعياً.';
const String p8 =
    'بلغ رسول الله ﷺ أن ناساً منهم يجتمعون في بيت سُوَيْلم اليهودي يثبطون الناس عن رسول الله ﷺ فأرسل إليهم من أحرق عليهم بيت سويلم.';
const String p9 =
    'وهذا يدل على مراقبة المسلمين الدقيقة ومعرفتهم بأحوال المنافقين واليهود، فقد كانت عيون المسلمين يقظة تراقب تحركات اليهود والمنافقين واجتماعاتهم وأوكارهم، بل كانوا يطلعون فيها على أدق أسرارهم واجتماعاتهم ومايدور فيها من حبك المؤامرات وابتكار أساليب التثبيط واختلاف الأسباب الكاذبة لإقناع الناس بعدم الخروج للقتال، وقد كان علاج رسول الله لدعاة الفتنة وأوكارها حازماً حاسماً إذ أمر بحرق البيت على من فيه من المنافقين، وأرسل من أصحابه من ينفذه ونفذ بحزم، وهذا منهج نبوي كريم يتعلم منه كل مسؤول في كل زمان ومكان كيف يقف من دعاة الفتنة ومراكز الإشاعات المضللة التي تلحق الضرر بالأفراد والمجتمعات والدول، لأن التردد في مثل هذه الأمور يعرض الأمن والأمان إلى الخطر وينذر بزولها.';
const String p10 =
    'أعلن النفير العام للخروج لغزوة تبوك حتى بلغ عدد من خرج مع النبي ﷺ إلى تبوك ثلاثين ألفاً، وقد عاتب القرآن الكريم الذين تباطأوا بقوله تعالى: يَاأَيُّهَا الَّذِينَ ءَامَنُوا مَا لَكُمْ إِذَا قِيلَ لَكُمُ انْفِرُوا فِي سَبِيلِ اللَّهِ اثَّاقَلْتُمْ إِلَى الأَرْضِ أَرَضِيتُمْ بِالْحَيَاةِ الدُّنْيَا مِنَ الآخِرَةِ فَمَا مَتَاعُ الْحَيَاةِ الدُّنْيَا فِي الآخِرَةِ إِلا قَلِيلٌ ، وقد طالبهم القرآن الكريم بأن ينفروا شباناً وشيوخاً وأغنياء وفقراء، بقوله تعالى: انْفِرُوا خِفَافًا وَثِقَالا وَجَاهِدُوا بِأَمْوَالِكُمْ وَأَنْفُسِكُمْ فِي سَبِيلِ اللَّهِ ذَلِكُمْ خَيْرٌ لَكُمْ إِنْ كُنْتُمْ تَعْلَمُونَ - سورة التوبة';
const String p11 =
    'لقد استطاع رسول الله ﷺ أن يحشد ثلاثين ألف مقاتل من المهاجرين والأنصار وأهل مكة والقبائل العربية الأخرى، ولقد أعلن رسول الله ﷺ على غير عادته في غزواته هدفه ووجهته في القتال، إذ أعلن صراحة أنه يريد قتال بني الأصفر الروم، علماً بأن هديه في معظم غزواته أن يورى فيها ولايصرح بهدفه ووجهته وقصده حفاظاً على سرية الحركة ومباغتة العدو.';
const String p12 =
    'وقد استدل بعض العلماء بهذا الفعل على جواز التصريح لجهة الغزو إذا لم تقتضي المصلحة ستره، وقد صرّح ﷺ في هذه الغزوة -على غير العادة- بالجهة التي يريد غزوها وجلّى هذا الأمر للمسلمين لأسباب منها:';
const String p13 =
    'بعد المسافة: فقد كان رسول الله ﷺ يدرك أن السير إلى بلاد الروم يُعدُ أمراً صعبا،ً لأن التحرك سيتم في منطقة صحراوية ممتدة قليلة الماء والنبات ولابدّ حينئذ من اكمال المؤنة ووسائل النقل للمجاهدين قبل بدء الحركة حتى لايؤدي نقص هذه الأمور إلى الإخفاق في تحقيق الهدف المنشود.';
const String p14 =
    'كثرة عدد الروم: إى أن مواجهتهم تتطلب إعداداً خاصاً فهم عدو يختلف في طبيعته عن الأعداء الذين واجههم النبي ﷺ من قبل فأسلحتهم كثيرة ودرايتهم بالحرب كبيرة وقدرتهم القتالية فائقة.';
const String p15 =
    'شدة الزمان: وذلك لكي يقف كل امرئ على ظروفه ويعدّ النفقة اللازمة له في هذا السفر الطويل لمن يعول وراءه.';
const String p16 =
    'أنه لم يعد مجال للكتمان في هذا الوقت حيث لم يبق في جزيرة العرب قوة معادية لها خطرها، تستدعي هذا الحشد الضخم سوى الرومان ونصارى العرب الموالين لهم في منطقة تبوك ودومة الجندل والعقبة.';
const String p17 =
    'لقد شرع رسول الله ﷺ لنا الأخذ بمبدأ المرونة عند رسم الخطط الحربية ومراعاة المصلحة العامة في حالتي الكتمان والتصريح ويعرف ذلك من مقتضيات الأحوال ، ولما علم المسلمون بجهة الغزوة سارعوا إلى الخروج إليها وحث الرسول ﷺ على النفقة قائلاً: من جهز جيش العسرة فله الجنة.';
const String p18 =
    'استخلف رسول الله ﷺ على المدينة محمد بن مسلمة الأنصاري، وخلّف علي بن أبي طالب على أهله فأرجف به المنافقون وقالوا: ما خلَّفه إلا استثقالاً وتخففا منه، فأخذ علي رضي الله عنه سلاحه ثم خرج حتى أتى رسول الله ﷺ وهو نازل بالجرف، فقال: يانبي الله: زعم المنافقون أنك إنما خلفتني لأنك استثقلتني وتخففت مني، فقال: كذبوا ولكني خلفتك لما تركت ورائي فارجع فاخلفني في أهلي وأهلك، أفلا ترضى أن تكون منِّي بمنزلة هارون من موسى؟ إلا أنه لانبيَّ بعدي فرجع علي إلى المدينة.';
const String p19 =
    'وكان استخلاف علي رضي الله عنه في أهله باعتبار قرابته ومصاهرته فكان استخلافه في أمر خاص وهو القيام بشأن أهله وكان استخلاف محمد بن مسلمة الأنصاري في الغزوة نفسها استخلافاً عاماً فتعلق بعض الناس بأن استخلاف علي يشير إلى خلافته من بعده ولاصحة لهذا القول لأن خلافته كانت في أهله خاصة.';
const String p20 =
    'وعندما تجمع المسلمون عند ثنية الوداع بقيادة رسول الله، اختار الأمراء والقادة وعقد الألوية والرايات لهم فأعطى لواء الأعظم إلى أبي بكر الصديق رضي الله عنه، ورايته العظمى إلى الزبير بن العوام رضي الله عنه، ودفع راية الأوس إلى أسيد بن حضير، وراية الخزرج إلى أبي دجانة، وأمر كل بطن من الأنصار أن يتخذ لواءً، واستعمل رسول الله ﷺ على حراسة تبوك من يوم قدم إلى أن رحل منها عباد بن بشر، فكان رضي الله عنه يطوف في أصحابه على العسكر وكان دليل رسول الله في هذه الغزوة علقمة بن الفغواء الخزاعي، فقد كان من أصحاب الخبرة والكفاءة في معرفة طريق تبوك.';
const String p21 =
    'ويلاحظ الباحث التطور السريع لعدد المقاتلين بشكل عام ولسلاح الفرسان بشكل خاص، إن الذي يدرس تاريخ الدعوة الإسلامية ونشوء الدولة الإسلامية ومؤسساتها العامة وفي مقدمة هذه المؤسسات الجيش الإسلامي القوة الضاربة للدولة، يلاحظ أن هناك تطوراً سريعاً جداً في مجال القوة العسكرية إذ بلغ عدد المقاتلين في غزوة بدر الكبرى ثلاثمائة وثلاثة عشر مقاتلاً، وفي غزوة أحد بلغ سبعمائة مقاتل تقريباً، وفي غزوة الأحزاب ثلاث آلاف مقاتل، وفي غزوة فتح مكة عشرة آلاف، وفي غزوة حنين بلغ العدد اثني عشر الف مقاتل، وأخيراً بلغ عدد المقاتلين في تبوك ثلاثين ألف مقاتل أو يزيد.';
const String p22 =
    'وإن الدارس يلاحظ هذا التطور السريع الملفت للنظر في مجال سلاح الفرسان ففي غزوة بدر كان عدد الفرسان فارسين في بعض الروايات وفي غزوة أحد لم يتجاوز عدد الفرسان ماكان في بدر، ويقفز العدد بعد ست سنوات فقط إلى عشرة آلاف فارس، وهذا يعود إلى انتشار الإسلام في الجزيرة العربية وبخاصة في البادية، وذلك لأن أهلها يهتمون باقتناء الخيول وتربيتها أكثر من أبناء المدن.';
