const int sectionIndex = 14;
const String sectionTitle = 'سُنة الابتلاء';

const List t1 = ['1', 'الابتلاء والتمكين'];
const List t2 = ['2', 'التربية وتصفية الصفوف'];
const List t3 = ['3', 'الكشف عن خبايا النفوس'];
const List t4 = ['4', 'الإعداد الحقيقي لتحمل الأمانة'];
const List t5 = ['5', 'معرفة حقيقة النفس'];
const List t6 = ['6', 'رفع المنزلة عند الله وتكفير السيئات'];

const String p1 =
    'الابتلاء سُنة الله في خلقه وهذا واضح في تقريرات القرآن الكريم قال تعالى: وَهُوَ الَّذِي جَعَلَكُمْ خَلاَئِفَ الأَرْضِ وَرَفَعَ بَعْضَكُمْ فَوْقَ بَعْضٍ دَرَجَاتٍ لِيَبْلُوَكُمْ فِي مَا ءَاتَاكُمْ إِنَّ رَبَّكَ سَرِيعُ الْعِقَابِ وَإِنَّهُ لَغَفُورٌ رَحِيمٌ - سورة الأنعام ، وقال سبحانه: إِنَّا جَعَلْنَا مَا عَلَى الأَرْضِ زِينَةً لَهَا لِنَبْلُوَهُمْ أَيُّهُمْ أَحْسَنُ عَمَلاً - سورة الكهف ، وقال جل شأنه: إِنَّا خَلَقْنَا الإِنْسَانَ مِنْ نُطْفَةٍ أَمْشَاجٍ نَبْتَلِيهِ فَجَعَلْنَاهُ سَمِيعًا بَصِيرًا - سورة الانسان';
const String p2 =
    'الابتلاء مرتبط بالتمكين ارتباطاً وثيقاً فلقد جرت سنّة الله تعالى ألا يُمَكن لأمة إلا بعد أن تمر بمراحل الاختبار المختلفة، وإلا بعد أن ينصهر معدنها في بوتقة الأحداث، فيميز الله الخبيث من الطيب وهي سنّة جارية على الامة الاسلامية لا تتخلف فقد شاء الله تعالى أن يبتلي المؤمنين ويختبرهم ليمحص إيمانهم ثم يكون لهم التمكين في الأرض بعد ذلك، ولذلك جاء هذا المعنى على لسان الإمام الشافعي رضي الله عنه حين سأله رجل: أيهما أفضل للمرء أن يُمكن أو يبتلى؟ فقال الإمام الشافعي: لايُمَكن حتى يبتلى، فإن الله تعالى ابتلى نوحاً وإبراهيم، وموسى وعيسى، ومحمداً صلوات الله وسلامه عليهم أجمعين فلما صبروا مكنهم فلا يظن أحد أن يخلص من الألم البتة.';
const String p3 =
    'وابتلاء المؤمنين قبل التمكين أمر حتمي من أجل التمحيص ليقوم بنيانهم بعد ذلك على تمكن ورسوخ، وهذا الابتلاء للمؤمنين ابتلاء الرحمة لا ابتلاء الغضب وابتلاء الاختيار لا مجرد الاختبار.';
const String p4 =
    'إن طريق الابتلاء سُنة الله في الدعوات كما أنه الطريق الى الجنة وقد حفت الجنة بالمكاره وحفت النار بالشهوات كما أخبر النبي ﷺ ، ثم إنه الطريق الذي لا طريق غيره لإنشاء الجماعة التي تحمل هذه الدعوة وتنهض بتكاليفها طريق التربية للأمة الاسلامية وإخراج مكنوناتها من الخير والقوة والاحتمال، وهو طريق المزاولة العملية للتكاليف والمعرفة لحقيقة الناس وحقيقة الحياة وذلك ليثبت على هذه الدعوة أصلب أصحابها عوداً وأقواهم شكيمة، فهؤلاء هم الذين يصلحون لحملها والصبر عليها فهم عليها مؤتمنون.';
const String p5 =
    'وقد جعل الله الابتلاء وسيلة لتصفية نفوس الناس ومعرفة المحق منهم والمبطل، وذلك لأن المرء قد لايكشف في الرخاء لكنه تكشفه الشدة قال تعالى: أَحَسِبَ النَّاسُ أَنْ يُتْرَكُوا أَنْ يَقُولُوا ءَامَنَّا وَهُمْ لاَ يُفْتَنُونَ';
const String p6 =
    'ثم إنه الطريق الذي لا طريق غيره لإنشاء الجماعة التي تحمل هذه الدعوة وتنهض بتكاليفها، طريق التربية لهذه الجماعة وإخراج مكنوناتها من الخير والقوة والإحتمال وهو طريق المزاولة العملية للتكاليف والمعرفة الواقعية لحقيقة الناس وحقيقة الحياة، ذلك ليثبت على هذه الدعوة أصلب أصحابها عوداً فهؤلاء هم الذين يصلحون لحملها إذن بالصبر عليها فهم عليها مؤتمنون.';
const String p7 =
    'وفي هذا المعنى والله يعلم حقيقة القلوب قبل الابتلاء، ولكن الابتلاء يكشف في عالم الواقع ماهو مكشوف لعلم الله مغيبُ مايعلمه سبحانه من أمرهم وهو فضل من الله من جانب وعدل من جانب وتربية للناس من جانب فلا يأخذوا أحداً إلا بما استعلن من أمره وبما حققه فعله فليسوا بأعلم من الله بحقيقة قلبه.';
const String p8 =
    ' وما بالله -حاشا لله- أن يعذب المؤمنين بالابتلاء وأن يؤذيهم بالفتنة، ولكنه الإعداد الحقيقي لتحمل الأمانة فهي في حاجة الى إعداد خاص لايتم إلا بالمعاناة العملية للمشاق وإلاّ بالثقة الحقيقية في نصر الله وثوابه على الرغم من طول الفتنة وشدة الابتلاء، والنفس تصهرها الشدائد فتنفي عنها الخبث وتستجيش كامن قواها المذخورة فتستيقظ وتتجمع وتطرقها بعنف وشدة فيشتد عودها ويصلب ويُصقل وكذلك تفعل الشدائد بالجماعات فلا يبقى صامداً إلا أصلبها عوداً وأقواها طبيعة وأشدها اتصالاً بالله وثقة فيما عنده من الحسنيين النصر أو الأجر، وهؤلاء هم الذين يسلمون الراية في النهاية مؤتمنين عليها بعد الاستعداد والاختبار.';
const String p9 =
    'وذلك لكي يعرف أصحاب الدعوة حقيقتهم هم أنفسهم وهم يزاولون الحياة والجهاد مزاولة عملية واقعية ويعرفوا حقيقة النفس البشرية وخباياها حقيقة الجماعات والمجتمعات وهم يرون كيف تصطرع مبادئ دعوتهم مع الشهوات في أنفسهم وفي أنفس الناس ويعرفون مداخل الشيطان الى هذه النفوس ومزالق الطريق ومسارب الظلال.';
const String p10 =
    'قال رسول الله ﷺ : مايصيب المؤمن من شوكة فما فوقها إلا رفعها الله بها درجة وحط عنه خطيئة، فقد يكون للعبد درجة عند الله تعالى لايبلغها بعلمه فيبتليه الله تعالى حتى يرفعها إليها كما أن الابتلاء طريق لتكفير سيئات المسلم.';
const String p11 =
    'وقد تعرض النبي ﷺ وأصحابه لأشكال وأنواع وأصناف متعددة من الابتلاء، كمحاولة قريش لإبعاد أبي طالب عن مناصرة رسول الله، وتشويه الدعوة وايذائه ﷺ وايذاء أصحابه وعرض المغريات والمساومات لترك الدعوة، ومطالبته بجعل الصفا ذهباً والاستعانة باليهود في مجادلة رسول الله ﷺ والدعاية الإعلامية في المواسم ضد الدعوة وشخص الرسول ﷺ والحصار الاقتصادي الذي تعرض له رسول الله وبني هاشم وبني المطلب من قبل كفار مكة والايذاء الجسدي وغير ذلك من أنواع الابتلاء، وسنبين في الصحفات القادمة أساليب المشركين في محاربة الاسلام، وكيف تصدى لها رسول الله ﷺ وأصحابه وكيف دفع رسول الله ﷺ قدر سنّة الابتلاء بسنّة الأسباب وكيف تعامل رسول الله ﷺ مع سنّة الأخذ بالأسباب حتى أقام دولة الاسلام في المدينة.';
