const int sectionIndex = 3;
const String sectionTitle = 'أصول العرب';

const List t1 = ['1', 'العرب البائدة'];
const List t2 = ['2', 'العرب العاربة'];
const List t3 = ['3', 'العرب العدنانية'];
const List t4 = ['4', 'فرع مضر'];
const List t5 = ['5', 'الحروب'];
const List t6 = ['6', 'الحالة الأخلاقية'];
const List t7 = ['7', 'الذكاء والفطنة'];
const List t8 = ['8', 'أهل كرم وسخاء'];
const List t9 = ['9', 'عشقهم للحرية'];
const List t10 = ['10', 'العفو عند المقدرة'];

const String p1 =
    'وهي قبائل عاد وثمود والعمالقة وطسم وجديس وأمييم وجرهم وحضرموت ومن يتصل بهم، وهذه درست معالمها واضمحلت من الوجود قبل الاسلام وكان لهم ملوك امتد ملكهم الى الشام ومصر.';
const String p2 =
    'وهم العرب المنحدرة من صلب يعرب بن يشجب بن قحطان وتسمى بالعرب القحطانية، ويعرفون بعرب الجنوب ومنهم ملوك اليمن ومملكة معين وسبأ وحِمْيَر.';
const String p3 =
    'نسبة الى عدنان الذي ينتهى نسبه الى إسماعيل بن إبراهيم عليهما الصلاة والسلام، وهم المعروفون بالعرب المستعربة أي الذين دخل عليهم دم ليس عربياً ثم تمّ اندماج بين هذا الدم وبين العرب وأصبحت اللغة العربية لسان المزيج الجديد.';
const String p4 =
    'وهؤلاء هم إيضا عرب الشمال موطنهم الأصلي مكة وهم إسماعيل عليه السلام وأبناؤه، والجراهمة الذي تعلم منهم اسماعيل عليه السلام العربية وصاهرهم ونشأ أولاده عرباً مثلهم، ومن أهم ذرية إسماعيل عدنان جد النبي ﷺ الأعلى، وجاء بعد عدنان ابنه معدّ ثم نزار ثم جاء بعده ولده مضر وربيعة، أما ربيعة بن نزار فقد نزل من انحدر من صلبه شرقاً فقامت عبدالقيس في البحرين وحنيفة في اليمامة وبنو بكر بن وائل مابين البحرين واليمامة، وعبرت تغلب الفرات فأقامت في أرض الجزيرة بين دجلة والفرات وسكنت تميم في بادية البصرة.';
const String p5 =
    'أما مضر فقد نزلت سليم بالقرب من المدينة، وأقامت ثقيف في الطائف واستوطنت سائر هوازن شرقي مكة، وسكنت أسد شرقي تيماء الى غربي الكوفة، وسكنت ذبيان وعبس من تيماء الى حوران، وتقسيم العرب الى عدنانية وقحطانية هو ماعليه جمهرة علماء الأنساب وغيرهم من العلماء.';
const String p6 =
    'وكانت قريش قد انحدرت من كنانة وهم أولاد فهر بن مالك بن النضر بن كنانة، وانقسمت قريش الى قبائل شتى من أشهرها جمح وسهم وعدي ومخزوم وتيم وزهرة، وبطون قصي بن كلاب وهي عبدالدار بن قصي وأسد بن عبدالعزى بن قصي وعبد مناف بن قصي.';
const String p7 =
    'وكان من عبد مناف أربع فصائل: عبد شمس ونوفل والمطلب وهاشم، وبيت هاشم هو الذي اصطفى الله منه سيدنا محمد بن عبدالله بن عبدالمطلب بن هاشم ﷺ وقال ﷺ : إن الله اصطفى كنانة من ولد إسماعيل واصطفى قريشاً من كنانة واصطفى من قريش بني هاشم واصطفاني من بني هاشم.';
const String p8 =
    'كانت الحروب تقوم بين العرب لأتفه الأسباب، فمن تلك الحروب حرب البسَوُس وقد قامت بين بكر وتغلب بسبب ناقة للجَرْمي، وهو جار للبسوس بنت منقذ خالة جساس بن مرة، وقد كان كليب سيد تغلب قد حمى لإبله مكاناً خاصاً به، فرأى فيه هذه الناقة فرماها فجزع الجرمي وجزعت البسوس، فلما رأى ذلك جساس تحين الفرصة لقتل كليب فقتله، فقامت الحروب الطاحنة بين القبيلتين لمدة أربعين سنة.';
const String p9 =
    'كانت أخلاق العرب قد ساءت وأولعوا بالخمر والقمار وشاعت فيهم الغارات وقطع الطريق على القوافل والعصبية والظلم وسفك الدماء والأخذ بالثأر واغتصاب الأموال وأكل مال اليتامى والتعامل بالربا والسرقة والزنا، ومما ينبغي أن يعلم أن الزنا إنما كان في الإماء وأصحاب الرايات من البغايا ويندر أن يكون في الحرائر، وليس أدل على هذا من أن النبي ﷺ لما أخذ البيعة على النساء بعد الفتح: على أن لايشركن بالله شيئاً ولا يسرقن ولا يزنين قالت السيدة هند بنت عتبة زوجة أبي سفيان: أو تزني الحرة؟!! وليس معنى هذا أنهم كانوا كلهم على هذا لا لقد كان فيهم كثيرون لا يزنون ولا يشربون الخمر ولا يسفكون الدماء ولايظلمون ويتحرجون من أكل أموال اليتامى ويتنزهون عن التعامل بالربا، وكانت فيهم سمات وخصال من الخير كثيرة أهلتهم لحمل راية الاسلام.';
const String p10 =
    'كانت قلوبهم صافية لم تدخلها تلك الفلسفات والأساطير والخرفات التي يصعب إزالتها كما في الشعوب الهندية والرومانية واليونانية والفارسية، كما إن اتساع لغتهم دليل على قوة حفظهم وذاكرتهم فقد كان للعسل ثمانون اسماً وللثعلب مائتان، وللأسد خمسمائة وللجمل ألفاً وكذا السيف وللداهية نحو أربعة آلاف اسم، ولا شك أن استيعاب هذه الأسماء يحتاج الى ذاكرة قوية حاضرة وقادة وقد بلغ بهم الذكاء والفطنة الى الفهم بالإشارة فضلاً عن العبارة والأمثلة على ذلك كثيرة.';
const String p11 =
    'كان هذا الخلق متأصل في العرب وكان الواحد منهم لا يكون عنده إلا فرسه أو ناقته فيأتيه الضيف فيسارع الى ذبحها أو نحرها له، وكان بعضهم لا يكتفي بإطعام الانسان بل كان يطعم الوحش والطير وكرم حاتم الطائي سارت به الركبان وضربت به الأمثال.';
const String p12 =
    'كان العربي بفطرته يعشق الحرية يحيا لها ويموت من أجلها، فقد نشأ طليقاً لا سلطان لأحد عليه ويأبى أن يعيش ذليلاً أو يمس في شرفه وعرضه ولو كلفه ذلك حياته، فقد كانوا يأنفون من الذل ويأبون الضيم والاصتصغار والاحتقار، ومثالٌ على ذلك وكان لدى العرب قدرة عجيبة على تحمل المكاره والصبر في الشدائد، وربما اكتسبوا ذلك من طبيعة بلادهم الصحراوية الجافة قليلة الزرع والماء، فألفوا اقتحام الجبال الوعرة والسير في حرّ الظهيرة ولم يتأثروا بالحر ولا بالبرد ولا وعورة الطريق ولا بعد المسافة ولا الجوع ولا الظمأ، ولما دخلوا الاسلام ضربوا أمثلة رائعة في الصبر والتحمل، وكانوا يرضون باليسير فكان الواحد منهم يسير الأيام مكتفياً بتمرات يقيم بها صلبه وقطرات من ماء يرطب بها كبده.';
const String p13 =
    'وكانوا ينازلون اقرانهم وخصومهم حتى اذا تمكنوا منهم عفوا عنهم وتركوهم، ويأبون أن يجهزوا على الجرحى وكانوا يرعون حقوق الجيرة ولاسيما رعاية النساء والمحافظة على العرض، وكانوا إذا استجار أحد الناس بهم أجاروه وربما ضحوا بالنفس والولد والمال في سبيل ذلك.';
const String p14 =
    'كانت هذه الفضائل والأخلاق الحميدة رصيداً ضخماً في نفوس العرب، فجاء الاسلام فنماها وقواها ووجهها وجهة الخير والحق، فلاعجب إذا كانوا انطلقوا من الصحارى كما تنطلق الملائكة الاطهار فتحوا الأرض وملأوها إيماناً بعد أن ملئت كفراً وعدلاً بعد أن ملئت جوراً وفضائل بعد أن عمتها الرذائل وخيراً بعد أن طفحت شراً.';
const String p15 =
    'لهذا اختيِر رسول الله ﷺ واختيٍر له هذا المجتمع العربي، وهذه البيئة النادرة وهذا الوسط الرفيع مقارنة بالفرس والروم والهنود واليونان فلم يختر من الفرس على سعة علومهم ومعارفهم، ولا من الهنود على عمق فلسفاتهم، ولا من الرومان على تفننهم، ولا من اليونان على عبقرية شاعريتهم وخيالهم، وإنما اختير من هذه البيئة البكر لأن هؤلاء الأقوام وإن كانوا على ماهم عليه وماهم فيه من علوم ومعارف، إلا أنهم لم يصلوا الى ماوصل إليه العرب من سلامة الفطرة وحرية الضمير وسمو الروح.';
