const int sectionIndex = 44;
const String sectionTitle = 'غزوة بنى المصطلق - الغزوة المباركة';

const List t1 = ['1', 'تأيد قريش'];
const List t2 = ['2', 'خروج رسول الله ﷺ لبنى المصطلق'];
const List t3 = ['3', 'زواج رسول الله ﷺ من جويرية بنت الحارث'];
const List t4 = ['4', 'غزوة مباركة'];
const List t5 = ['5', 'سبحان الله وبحمده'];

const String p1 =
    'بنو المصطلق : هم بطن من خزاعة والمصطلق جدهم وهو جذيمة بن سعد بن عمرو بن ربيعة بن حارثة بن عمرو بن عامر ماء السماء.';
const String p2 =
    'تأييد هذه القبيلة لقريش واشتراكها معها في معركة أحد ضد المسلمين، ضمن كتلة الأحابيش التي اشتركت في المعركة تأييداً لقريش. وكذلك سيطرة هذه القبيلة على الخط الرئيسي المؤدي إلى مكة، فكانت حاجزاً منيعاً من نفوذ المسلمين إلى مكة. وأن الرسول ﷺ بلغه أن بني المصطلق يجمعون له، وكان قائدهم الحارث بن أبي ضرار ينظم جموعهم، فلما سمع بهم خرج إليهم حتى لقيهم على ماء من مياههم يقال له المريسيع من ناحية قديد إلى الساحل فهزمهم شر هزيمة.';
const String p3 =
    'فعندما شعر رسول الله ﷺ بحركة بني المصطلق المريبة أرسل بريدة بن الحصيب الأسلمي للتأكد من نيتهم، وأظهر لهم بريدة أنه جاء لعونهم، فتأكد من قصدهم، فأخبر الرسول ﷺ بذلك. وفي يوم الاثنين لليلتين خلتا من شهر شعبان من السنة الخامسة للهجرة خرج الرسول ﷺ من المدينة في سبعمائة مقاتل، وثلاثين فارساً متوجهاً إلى بني المصطلق ولما كان بنو المصطلق ممن بلغتهم دعوة الإسلام، واشتركوا مع الكفار في غزوة أحد، وكانوا يجمعون الجموع لحرب المسلمين، فقد روى البخاري ومسلم، أن رسول الله ﷺ أغار عليهم وهم غارون – أي غافلون، وأنعامهم تسقى على الماء، فقتل مقاتلهم وسبى ذراريهم، وأصاب يومئذ جويرية بنت الحارث بن أبي ضرار.';
const String p4 =
    'قسم رسول الله ﷺ سبايا بني المصطلق وكان من بين الأسرى جويرية بنت الحارث وكانت بركة على قومها ولنسمع قصتها من السيدة عائشة رضي الله عنها حيث قالت: لما قسم رسول الله ﷺ سبايا بني المصطلق وقعت جويرية بنت الحارث في سهم لثابت بن قيس بن شماس، أو لابن عم له، فكاتبته على نفسها وكانت امرأة حلوة ملاحة لايراها أحد إلا أخذت بنفسه، فأتت رسول الله ﷺ لتستعينه في كتابتها.';
const String p5 =
    'قالت: فوالله ماهو أن رأيتها على باب حجرتي فكرهتها وعرفت أنه سيرى منها مارأيت، فدخلت عليه فقالت: يارسول الله أنا جويرية بنت الحارث بن أبي ضرار سيد قومه، وقد أصابني من البلاء مالم يخف عليك، فوقعت في السهم لثابت بن قيس بن شماس أو لابن عم له فكاتبته على نفسي فجئتك استعينك على كتابتي.';
const String p6 =
    'قال: فهل لك في خير من ذلك؟ قالت: وماهو يارسول الله؟ قال: أقض عنك كتابك واتزوجك، قالت: نعم يارسول الله قد فعلت.';
const String p7 =
    'قالت: وخرج الخبر إلى الناس أن رسول الله ﷺ قد تزوج جويرية بنت الحارث ، فقال الناس: أصهار رسول الله ﷺ فأرسلوا مابأيديهم. قالت: فلقد اعتق بتزويجه إياها مائة أهل بيت من بني المصطلق فما أعلم امرأة أعظم بركة على قومها منها ، وجاء الحارث بن أبي ضرار-بعد الوقعة- بفداء ابنته إلى المدينة فدعاه النبي ﷺ إلى الإسلام فأسلم.';
const String p8 =
    'تعتبر غزوة بني بني المريسيع -المصطلق- من الغزوات الفريدة المباركة التي أسلمت عقبها قبيلة بأسرها، وكان الحدث الذي أسلمت القبيلة من أجله هو أن الصحابة حرروا وردوا الأسرى الذين أصابوهم إلى ذويهم بعد أن تملكوهم باليمين في قسم الغنائم، واستكثروا على أنفسهم أن يتملكوا أصهار نبيهم عليه الصلاة والسلام، وحيال هذا العتق الجماعي، وإزاء هذه الأريحية الفذة، دخلت القبيلة كلها في دين الله.';
const String p9 =
    'وكانت أم المؤمنين جويرية بنت الحارث رضي الله عنها من الذاكرين الله كثيراً والذاكرات القانتات الصابرات في مجال مناجاة الله تعالى وتحميده وتقديسه وتسبيحه فهذه أم المؤمنين جويرية تحدثنا عن ذلك فتقول: أن النبي ﷺ خرج من عندها بكرةً حين صلى الصبح وهي في مسجدها ثم رجع بعد أن أضحى وهي جالسة. فقال: مازلت على الحال التي فارقتك عليها؟، قالت: نعم. قال النبي ﷺ : لقد قلت بعدك أربع كلمات، ثلاث مرات لو وزنت بما قلت منذ اليوم لوزنتهن، سبحان الله وبحمده، عدد خلقه ورضا نفسه وزنة عرشه ومداد كلماته. وقد توفيت رضي الله عنها سنة خمسين، وقيل ست وخمسين.';
const String p10 = '';
const String p11 = '';
const String p12 = '';
const String p13 = '';
const String p14 = '';
const String p15 = '';
const String p16 = '';
const String p17 = '';
const String p18 = '';
const String p19 = '';
const String p20 = '';
const String p21 = '';
const String p22 = '';
const String p23 = '';
const String p24 = '';
const String p25 = '';
const String p26 = '';
const String p27 = '';
const String p28 = '';
const String p29 = '';
const String p30 = '';
