const int sectionIndex = 38;
const String sectionTitle = 'محاولات زعزعة الدولة';

const List t1 = ['1', 'آثار أُحد'];
const List t2 = ['2', 'طمع بني أسد في الدولة الإسلامية'];
const List t3 = ['3', 'ظن المشركين بضعف المسلمين'];
const List t4 = ['4', 'تصدي عبدالله بن أنس لخالد بن سفيان '];
const List t5 = ['5', 'العصا'];
const List t6 = ['6', 'دقة الرصد الحربي'];
const List t7 = ['7', 'فراسة النبي ﷺ في اختيار الرجال'];

const String p1 =
    'كانت غزوة أحد مشجعة لأعداء الدولة الإسلامية على مواجهتها، وساد الشعور لدى الأعراب المشركين بإمكان مناوشة المسلمين والتغلب عليهم، واتجهت انظار المشركين من الأعراب إلى غزو المدينة لاستئصال شأفتهم، وكسر شوكتهم فطمعت بنو أسد في الدولة الإسلامية وشرع خالد بن سفيان الهزلي لجمع الحشود لكي يهاجم بها المدينة، وتجرأت عَضَل والقارة على خداع المسلمين وقام عامر بن الطفيل يقتل القرّاء الدعاة الآمنين، وحاولت يهود بني النضير أن تغتال رسول الله ﷺ ، فتصدى لهذه المحاولات الماكرة الحبيب المصطفى بشجاعة فائقة وسياسة ماهرة وتخطيط سليم وتنفيذ دقيق.';
const String p2 =
    'بلغت النبي ﷺ بواسطة عيونه المنبثة في الجزيرة العربية أخبار الاستعدادات التي قام بها بنو أسد بن خزيمة بقيادة طليحة الأسدي من أجل غزو المدينة طمعاً في خيراتها، وانتصاراً لشركهم ومظاهرة لقريش في عدوانها على المسلمين، فسارع النبي ﷺ إلى تشكيل سرية في مئة وخمسين رجلاً من المهاجرين والأنصار وأمرّ عليهم أبا سلمة بن عبدالأسد المخزومي، وعقد له لواء وقال له: سر حتى تنزل أرض بني أسد فأغر عليهم قبل أن تتلاقى عليك جموعهم، فسار إليهم أبو سلمة في المحرم فأغار على أنعامهم ففروا من وجهه فأخذها، ولم يلق عناء في تشتيت أعداء الإسلام.';
const String p3 =
    'وعاد إلى المدينة مظفراً يعد أبو سلمة من السابقين إلى الإيمان ومن خيرة الرعيل الأول، وقد عاد من هذه الغزوة متعباً إذ نغر جرحه الذي أصابه في أحد فلم يلبث حتى مات ونلحظ في هذه السرية عدة أمور منها: الدقة في التخطيط الحربي عند النبي ﷺ حيث فرق أعداءه قبل أن يجتمعوا، فذهلوا لمجئ سرية أبي سلمة وهم يظنون أن المسلمين قد أضعفتهم وقعة أحد وأذهلتهم عن أنفسهم، فأصيب المشركون بالرعب من المسلمين ووهت عزيمتهم وانشغلوا بأنفسهم عن مهاجمة المدينة، وتظهر دقة المسلمين في الرصد الحربي واختيارهم التوقيت الصحيح والطريق المناسب حيث وصلوا إلى الأعداء قبل أن يعلموا عنهم أي شيء رغم بعد المسافة، وكان هذا هو أهم عوامل نجاح المسلمين في هذه السرية وتركت هذه السرية في نفوس الأعداء شعوراً مؤثراً على معنوياتهم ألا وهو قناعتهم بقدرة المسلمين على الاستخفاء والقيام بالحروب الخاطفة المفاجئة تجعلهم يمتلئون رعباً منهم ويتوقعون الإغارة في أي وقت، وهذا الشعور حملهم على الاعتراف بقوة المسلمين ومسالمتهم.';
const String p4 =
    'قام خالد بن سفيان الهذلي يجمّع المقاتلة من هذيل وغيرها في عرفات وكان يتهيأ لغزو المسلمين في المدينة مظاهرة لقريش، وتقرباً إليها، ودفاعاً عن عقائدهم الفاسدة، وطمعاً في خيرات المدينة، فأرسل رسول الله ﷺ الصحابي عبدالله بن أنيس الجهني إليه بعد أن كلّفه مهمته قتله وهذا عبدالله بن أنيس يحدثنا بنفسه قال رضي الله عنه: دعاني رسول الله ﷺ فقال: إنه قد بلغني أن خالد بن سفيان بن نبيح يجمع لي الناس ليغزوني وهو بعرنة فأته فاقتله، قال: قلت: يارسول الله انعته حتى أعرفه، قال: إذا رأيته وجدت له قشعريرة.';
const String p5 =
    'قال: فخرجت متوشحاً بسيفي، حتى وقعت عليه بعرنة مع ظعن يرتاد لهن منزلاً، وحين كان وقت العصر، فلما رأيته وجدت ماوصف لي رسول الله من القشعريرة فأقبلت نحوه، وخشيت أن يكون بيني وبينه محاولة تشغلني عن الصلاة، فصليت وأنا أمشي نحوه أومي برأسي الركوع والسجود فلما انتهيت إليه قال: من الرجل قلت: رجل من العرب سمع بك وبجمعك لهذا الرجل فجاءك لهذا، قال: أجل أنا في ذلك قال: فمشيت معه شيئاً، حتى إذا أمكنني حملت عليه بالسيف حتى قتلته، ثم خرجت وتركت ظعائنه مكبات عليه.';
const String p6 =
    'فلما قدمت على رسول الله ﷺ فرآني فقال: أفلح الوجه قال: قلت: قتلته يارسول الله قال:صدقت قال: ثم قام معي رسول الله فدخل في بيته فأعطاني عصا، فقال: أمسك هذه عندك ياعبدالله بن أنيس.';
const String p7 =
    'قال: فخرجت بها على الناس فقالوا: ماهذه العصا؟ قال: قلت أعطانيها رسول الله ﷺ ، وأمرني أن أمسكها، قالوا: أولا ترجع إلى رسول الله ﷺ فتسأله عن ذلك؟ قال: فرجعت إلى رسول الله ﷺ ، فقلت: يارسول الله لم أعطيتني هذه العصا؟ قال: آية بيني وبينك يوم القيامة، أن أقل الناس المختصرون - يأتون يوم القيامة ومعهم أعمال صالحة يتكئون عليها - يومئذ يوم القيامة، فقرنها عبدالله بسيفه فلم تزل معه، حتى إذا مات أمر بها فضمت معه في كفنه ثم دفنا جميعاً.';
const String p8 =
    'كان رسول الله ﷺ يعطي للجانب الأمني أهميته، ولذلك كان يتابع تحركات الأعداء، ويعد بعد ذلك الحلول المناسبة للمشكلات والأزمات في وقتها الملائم، ولذلك لم يمهل خالد بن سفيان حتى يكثر جمعه ويشتد ساعده بل عمل على القضاء على الفتنة وهي في أيامها الأولى بحزم وبذلك حقق للأمة مكاسب كبيرة وقلل التضحيات المتوقعة من مجئ خالد بن سفيان بجيش لغزو المدينة وهذا العمل يحتاج لقدرة في الرصد الحربي، وسرعة في اتخاذ القرار.';
const String p9 =
    'كان ﷺ يتمتع بفراسة عظيمة في اختيار الرجال ومعرفة كبيرة لذوي الكفاءات من أصحابه، فكان يختار لكل مهمة من يناسبها فيختار للقيادة من يجمع بين سداد الرأي وحسن التصرف والشجاعة، ويختار للدعوة والتعليم من يجمع بين غزارة العلم ودماثة الخلق والمهارة في اجتذاب الناس، ويختار للوفادة على الملوك والأمراء من يجمع بين حسن المظهر وفصاحة اللسان وسرعة البديهة، وفي الأعمال الفدائية يختار من يجمع بين الشجاعة الفائقة وقوة القلب والمقدرة على التحكم في المشاعر.';
