const int sectionIndex = 50;
const String sectionTitle = 'الأحزاب - المعجزات الحسية';

const List t1 = ['1', 'تكثير الطعام'];
const List t2 = ['2', 'الجيش عند بيت جابر'];
const List t3 = ['3', 'دور المرأة المسلمة'];
const List t4 = ['4', 'الصخرة'];
const List t5 = ['5', 'خير القرون قرني'];
const List t6 = ['6', 'سلمان منا أهل البيت'];
const List t7 = ['7', 'شجاعة صفية عمة الرسول ﷺ'];
const List t8 = ['8', 'عدم صحة قصة جُبن حسان رضي الله عنه'];
const List t9 = ['9', 'أول مستشفى إسلامي حربي'];
const List t10 = ['10', 'المسلم يقع في الإثم ولكنه يسارع في التوبة'];
const List t11 = ['11', 'من فضائل سعد بن معاذ رضي الله عنه'];
const List t12 = ['12', 'الجهاد إلى اللحظة الأخيرة'];
const List t13 = ['13', 'انفجار جُرح سعد بن معاذ رضى الله عنه'];
const List t14 = ['14', 'سبعون ألف ملك'];
const List t15 = ['15', 'اهتزاز عرش الرحمن'];
const List t16 = ['16', 'مقتل حيي بن أخطب'];
const List t17 = ['17', 'مقتل كعب بن أسد'];
const List t18 = ['18', 'أدب الخلاف'];
const List t19 = ['19', 'توزيع غنائم بني قريظة'];
const List t20 = ['20', 'وَأوْرثكُم أَرضهُم وَديَارهُم وأَموَالهُم'];

const String p1 =
    'ظهرت خلال مرحلة حفر الخندق معجزات حسّية للنبي ﷺ منها تكثير الطعام الذي أعدّه جابر بن عبدالله، فعن جابر بن عبدالله رضي الله عنه قال: إنا يوم الخندق مُحفر، فعرضت كدية شديدة، فجاؤوا النبي ﷺ ، فقالوا: هذه كدية عرضت في الخندق، فقال: أنا نازل ثم قام وبطنه معصوب بحجر، ولبثنا ثلاثة أيام لانذوق ذواقاً، فأخذ النبي ﷺ المعول، فضرب في الكدية فعاذ كثيباً أهيل أو أهيم.';
const String p2 =
    'قال جابر: فقلت يارسول الله، ائذن لي إلى البيت، فقلت لامرأتي: رأيت بالنبي ﷺ شيئاً ماكان في ذلك صبر فعندك شيء؟ فقالت عندي شعير وعناق ،فذبحت العناق - الأنثى من أولاد المعاز - وطحنت الشعير، حتى جعلنا اللحم بالبرمة، ثم جئت النبي ﷺ والعجين قد انكسر والبرمة بين الأثافي - الحجارة التي تنصب ويجعل القدر عليها - ،قد كادت أن تنضج، فقلت: طُعَيم لي، فقم أنت يارسول الله ورجل أو رجلان، قال: كم هو؟ فذكرت له، فقال كثير طيب قال: قل لها لاتنزع البرمة ولا الخبز من التنور حتى آتي، فقال: قوموا، فقام المهاجرون والأنصار، فلما دخل على امرأته قال: ويحك جاء النبي ﷺ بالمهاجرين والأنصار ومن معهم، قالت: هل سألك؟ قلت نعم، فقال: ادخلوا ولاتضاغطوا - لاتزاحموا - ،فجعل يكسِّر الخبز ويجعل عليه اللحم ويخمر البرمة والتنور إذا أخذ منه ويقرب إلى أصحابه ثم ينزع فلم يزل يكسّر الخبز ويغرف حتى شبعوا وبقي بقية، قال: كلي هذا وأهدي فإن الناس أصابتهم مجاعة.';
const String p3 =
    'وهذه ابنة بشير بن سعد تقول: دعتني أمي عمرة بنت رواحة فأعطتني حفنة من تمر في ثوبي ثم قالت: أيّ بُنيَّة، إذهبي إلى أبيك وخالك عبدالله بن رواحة بغدائهما، قالت: فأخذتها فانطلقت بها فمررت برسول الله ﷺ وأنا ألتمس أبي وخالي فقال: تعالي يابنية ماهذا معك؟ فقلت: يارسول الله، هذا تمر بعثتني به أمي إلى أبي بشير بن سعد، وخالي عبدالله بن رواحة يتغذيانه، قال: هاتيه قالت: فصببته في كفي رسول الله ﷺ فما ملأتهما، ثم أمر بثوب فبسط له ثم دعا بالتمر عليه فتبدد فوق الثوب ثم قال لإنسان عنده: اصرخ في أهل الخندق أن هلمّ إلى الغذاء، فاجتمع أهل الخندق عليه فجعلوا يأكلون منه وجعل يزيد حتى صدر أهل الخندق عنه، وإنه ليسقط من أطراف الثوب.';
const String p4 =
    'ففي هذين الخبرين معجزات حسية ظاهرة للرسول ﷺ ، كما يظهر دور المرأة المسلمة في مشاركة المسلمين في جهادهم، فعندما اشتغل المسلمون بحفر الخندق تركوا أعمالهم، وبعدت عنهم أرزاقهم، وقلّ عنهم القوت وأصاب الناس جوع وحرمان حتى كان رسول الله ﷺ والمسلمون معه يشدون على بطونهم الحجارة من شدة الجوع، فكانت المرأة المسلمة تعين المسلمين بإعداد ماقدرت عليه من الطعام.';
const String p5 =
    'ومن دلائل النبوة أثناء حفر الخندق أخباره ﷺ عمار بن ياسر وهو يحفر معهم الخندق، بأن ستقتله الفئة الباغية فقتل في صفين وكان في جيش علي، وعندما اعترضت صخرة الصحابة وهم يحفرون، ضربها الرسول ﷺ ثلاث ضربات فتفتت قال إثر الضربة الأولى: الله أكبر أعطيت مفاتيح الشام والله إني لأبصر قصورها الحمراء الساعة، ثم ضربها الثانية فقال: الله أكبر أعطيت مفاتيح فارس والله إني لأبصر قصر المدائن أبيض، ثم ضرب الثالثة وقال: الله أكبر أعطيت مفاتيح اليمن والله إني لأبصر أبواب صنعاء من مكاني هذه الساعة، وقد تحققت هذه البشارة التي اخبرت عن اتساع الفتوحات الإسلامية والإخبار عنها في وقت كان المسلمون فيه محصورين في المدينة، يواجهون المشاق والخوف والجوع والبرد القارص.';
const String p6 =
    'قال رجل من أهل الكوفة لحذيفة بن اليمان: يا أبا عبدالله، أرأيتم رسول الله وصحبتموه؟ قال: نعم يا ابن أخي، قال: فكيف كنتم تصنعون؟ قال: والله لقد كنا نجهد، قال: فقال والله لو أدركناه ماتركناه يمشي على الأرض، ولحملناه على أعناقنا، فقال حذيفة يا ابن أخي والله لقد رأيتنا مع رسول الله ﷺ ، بالخندق.. ثم ذكر حديث تكليفه بمهمة الذهاب إلى معسكر المشركين، هذا تابعي يلتقي بالصحابي حذيفة ويتخيل أنه لو وجد مع رسول الله ﷺ لاستطاع أن يفعل مالم يفعله الصحابة الكرام، والخيال شيء والواقع شئ آخر، والصحابة رضي الله عنهم بشر، لهم طاقات البشر، وقدراتهم، وقد قدموا كل مايستطيعون، فلم يبخلوا بالأنفس فضلاً عن المال والجهد، وقد وضع ﷺ الأمور في نصابها بقوله، خير القرون قرني، فبين أن عملهم لايعدله عمل.';
const String p7 =
    'بعد أن كان له السبق فى فكرة الخندق، قال المهاجرون يوم الخندق سلمان منا، وقالت الأنصار: سلمان منا، فقال رسول الله ﷺ : سلمان منا أهل البيت.';
const String p8 =
    'كان ﷺ قد وضع النساء والأطفال في حصن فارع وهو حصن قوي، حماية لهم، لأن المسلمين في شغل عن حمايتهم لمواجهتم جيوش الأحزاب، فعندما نقض يهود بني قريظة عهدهم مع رسول الله ﷺ أرسلت يهودياً ليستطلع وضع الحصن الذي فيه نساء المسلمين وأطفالهم فأبصرته صفية بنت عبدالمطلب عمة رسول الله ﷺ فأخذت عموداً ونزلت من الحصن فضربته بالعمود فقتلته، فكان هذا الفعل من صفية رادعاً لليهود من التحرش بهذا الحصن الذي ليس فيه إلا النساء والأطفال، حيث ظنت يهود بني قريظة أنه محمي من قبل الجيش الإسلامي، أو أن فيه على الأقل من يدافع عنه من الرجال ففي هذا الخبر دليل للمرأة في الدفاع عن نفسها إن لم تجد من يدافع عنها.';
const String p9 =
    'ففي قصة صفية عمة رسول الله ﷺ وقتلها لليهودي جاء في رواية سندها ضعيف أن صفية رضي الله عنها قالت لحسان بن ثابت إن هذا اليهودي يطيف بالحصن كما ترى، ولا آمنه أن يدل على عورتنا من ورائنا من يهود، وقد شغل عنا رسول الله ﷺ وأصحابه فانزل إليه فاقتله. فقال: يغفر الله لك يابنت عبدالمطلب، والله لقد عرفت ما أنا بصاحب هذا، قالت صفية، فلما قال ذلك، احتجزت عموداً ثم نزلت من الحصن إليه، فضربته بالعمود حتى قتلته، ثم رجعت الحصن، فقلت ياحسان أنزل فاستلبه، فإنه لم يمنعني أن استلبه إلا أنه رجل، فقال: مالي بسلبه من حاجة يابنت عبدالمطلب، وهذا الخبر لايصح لأمور منها:من حيث الإسناد فالخبر ليس مسنداً وهو ساقط لايصح ولايجوز أن يروى، فيساء إلى صحابي من صحابة رسول الله ﷺ كان ينافح عن الدعوة وعن رسول الله ﷺ عمره كله.';
const String p10 =
    'أنشأ المسلمون أول مستشفى إسلامي حربي في غزوة الأحزاب فقد ضرب الرسول صلوات الله وسلامه عليه خيمة في مسجده الشريف في المدينة، عندما دارت رحى غزوة الأحزاب، فأمر ﷺ أن تكون رُفَيْدَة الأسلمية الأنصارية رئيسة ذلك المستشفى النبوي الحربي، وبذلك أصبحت أوّل ممرضة عسكرية في الإسلام، وجاء في السيرة النبوية لابن هشام... وكان ﷺ قد جعل سعد بن معاذ في خيمة لأمرأة من أسلم، يقال لها رُفيدة، في مسجده، كانت تداوي الجرحى، وتحتسب بنفسها على خدمة من به ضيعة من المسلمين، وكان ﷺ قد قال لقومه حين أصابه السهم بالخندق: إجعلوه في خيمة رفيدة حتى أعوده من قريب.';
const String p11 =
    'أرسل بنو قريظة إلى أبي لبابة بن عبدالمنذر وكانوا حلفاؤه فاستشاروه في النزول على حكم رسول الله ﷺ فأشار إلى حلقه -يعني الذبح- ثم ندم فتوجه إلى مسجد النبي ﷺ فارتبط به حتى تاب الله عليه، وقد ظل مرتبطاً بالجذع في المسجد ست ليال تأتيه امرأته في وقت كل صلاة فتحله للصلاة ثم يعود فيرتبط في الجذع، وقد قال أبو لبابة: لا أبرح مكاني هذا حتى يتوب الله عليَّ مما صنعتُ: قالت أم سلمة فسمعت رسول الله ﷺ من السحر وهو يضحك فقلت: مم تضحك يارسول الله؟ أضحك الله سنَّك. قال: تِيبَ على أبي لبابة، قالت: قلت: أفلا أبشرّه يارسول الله؟ قال: بلى إن شئت، فقامت على باب حجرتها وذلك قبل أن يضرب عليهنّ الحجاب، فقالت: يا أبا لبابة، أبشر فقد تاب الله عليك قالت: فثار الناس ليطلقوه فقال: لاوالله حتى يكون رسول الله هو الذي يُطلقني بيده. فلما مرّ عليه رسول الله ﷺ خارجاً إلى صلاة الصبح أطلقه عنه وذلك في الاعتراف بالذنب والتوبة النصوح، وإن موطن العبرة في هذا الموقف يكمن في تصرف أبي لبابة بعدما وقعت منه هذه الزلة التي أفشى بها سراً حربياً خطيراً، فأبو لبابة لم يحاول التكتم على مابدر منه والظهور أمام رسول الله ﷺ والمسلمين بمظهر الرجل الذي أدى مهمته بنجاح وأنه لم يحصل منه شيء من المخالفات، وكان بإمكانه أن يخفي هذا الأمر حيث لم يطلّع عليه أحد من المسلمين، وأن يستكتم اليهود أمره، ولكنه تذكر رقابة الله عليه وعلمه بما يُسرُّ ويعلن، وتذكر حق رسول الله ﷺ العظيم عليه وهو الذي ائتمنه على ذلك السر، ففزع لهذه الزلة فزعاً عظيماً، وأقرّ بذنبه واعترف به وقد أنزل الله تعالى في أبي لبابة قوله تعالى: يَاأَيُّهَا الَّذِينَ ءَامَنُوا لا تَخُونُوا اللَّهَ وَالرَّسُولَ وَتَخُونُوا أَمَانَاتِكُمْ وَأَنْتُمْ تَعْلَمُونَ - سورة الأنفال';
const String p12 =
    'استجابة الله تعالى لدعائه عندما قال: اللهم فإن بقي من حرب قريش شيء فأبقني له حتى أجاهدهم فيك وقد استجيب دعاؤه فتحجر جرحه وتماثل للشفاء حتى كانت غزوة بني قريظة، وجعل رسول الله ﷺ الحكم فيهم إليه، فحكم فيهم بالحق ولم تخذه في الله لومة لائم وهذا دليل على تجرد قلبه لله تعالى.';
const String p13 =
    'ومن إكرام رسول الله ﷺ قوله للأنصار عندما جاء سعد للحكم في بني قريظة: قوموا إلى سيدكم.';
const String p14 =
    'وعندما نفذ حكم الله في يهود بني قريظة رفع سعد يده يدعو الله ثانية يقول: اللهم فإني أظن أنك قد وضعت الحرب بيننا وبينهم يعني قريشاً والمشركين فإن كنت قد وضعت الحرب بيننا وبينهم فافجروها واجعل موتي فيها، وقد استجيب دعاؤه فانفجر جرحه تلك الليلة ومات رحمه الله.';
const String p15 =
    'ومن خلال دعاؤه الأول والثاني، نلحظ هذا الدعاء العجيب، دعاء العظماء الذين يعرفون أن رسالتهم في الحياة ليست الاستشهاد فقط، بل متابعة الجهاد إلى اللحظة الأخيرة، فهو المسؤول عن نصرة الإسلام في قومه وأمته. ونرى من سيرته أنه لو أقسم على الله لأبره، فهو وجيه في السماوات والأرض. فقد شاءت إرادة المولى أن يعيد الأمر في بني قريظة كله إليه، وأن يطلب بني قريظة أن يكون الحكم فيهم لسعد بن معاذ.';
const String p16 =
    'وعندما انفجر جرحه نقله قومه فاحتملوه إلى بني عبدالأشهل إلى منازلهم، وجاء رسول الله ﷺ فقيل: انطلقوا فخرج وخرج معه الصحابة، وأسرع حتى تقطعت شسوع نعالهم، وسقطت أرديتهم إليه أصحابه، فقال: إني أخاف أن تسبقنا الملائكة فتغسله كما غسلت حنظلة، فانتهى إلى البيت وهو يُغسل وأمه تبكيه.';
const String p17 =
    'وقال: كل نائحة تكذب إلا أم سعد، ثم خرج به قال: يقوم له القوم: ماحملنا يارسول الله، ميتاً أخف علينا منه، قال: ومايمنعه أن يخف، وقد هبط من الملائكة كذا وكذا لم يهبطوا قط قبل يومهم قد حملوه معكم، وقد جاء في النسائي عن ابن عمر رضي الله عنهما عدد الملائكة الذين شاركوا في تشييع جنازة سعد فقد قال ﷺ : هذا العبد الصالح الذي تحرك له العرش، وفُتحت أبواب السماء، وشهده سبعون ألفاً من الملائكة لم ينزلوا إلى الأرض قبل ذلك، لقد ضُمَّ ضمَّة ثم أفرج عنه يعني سعداً.';
const String p18 =
    'وقال ﷺ : اهتزَّ عرش الرحمن لموت سعد بن معاذ وفي حديث البراء بن عازب رضي الله عنه قال: أهديت لرسول الله ﷺ حلة حرير فجعل أصحابه يلمسونه ويعجبون من لينها، فقال: أتعجبون من لين هذه؟ لمناديل سعد بن معاذ في الجنة خير منها وألين.';
const String p19 =
    'ومع كل هذه المآثر والمحاسن والأعمال الجليلة التي قدمها لخدمة دين الله، فقد تعرض لضمة القبر: لما انتهوا إلى قبر سعد رضي الله عنه نزل فيه أربعة: الحارث بن أوس، وأسيد بن الحضير، وأبو نائلة سلكان، وسلمة بن سلامة بن وقش، ورسول الله ﷺ واقف، فلما وضع في قبره، تغير وجه رسول الله ﷺ ، وسبح ثلاثاً، فسبح المسلمون حتى ارتج البقيع، ثم كبَّر ثلاثاً، وكبَّر المسلمون، فسئل عن ذلك فقال: تضايق على صاحبكم القبر وضم ضمة لو نجا منها أحد لنجا هو، ثم فرّج الله عنه.';
const String p20 =
    'إن هذا الصحابي الجليل قد استشهد وهو في ريعان شبابه، فقد كان في السابعة والثلاثين من عمره، يوم وافته منيته فأي طراز هذا الذي حفل تاريخه بهذه المآثر، واستبشر أهل السموات بقدومه واهتز عرش الرحمن فرحا لوفاته، من دون خلق الله أجمعين كان سعد بن معاذ، رجلاً أبيض، طوالاً، جميلاً، حسن الوجه، أعين، حسن اللحية رحمة الله عليه ورضى عنه وأعل ذكره في المصلحين.';
const String p21 =
    'روى عبدالرزاق في مصنفه بالسند إلى سعيد بن المسيب... فذكر بعض خير الأحزاب وقريظة... إلى أن قال: فلما فض الله جموع الأحزاب انطلق - يعني حيي - حتى إذا كان بالروحاء ذكر العهد والميثاق الذي أعطاهم، فرجع حتى دخل معهم، فلما أقبلت بنو قريظة أتي به مكتوفاً بعد، فقال حيي للنبي ﷺ : أما والله مالمت نفسي في عداوتك، ولكنه من يَخْذِل الله يُخْذَل، فأمر به النبي ﷺ فضربت عنقه. ثم أنه أقبل على الناس قبل تنفيذ حكم الإعدام وقال لهم: أيها الناس، إنه لابأس بأمر الله، كتاب وقدر وملحمة كتبها الله على بني إسرائيل، ثم جلس فضربت عنقه.';
const String p22 =
    'وجئ برئيس بني قريظة كعب بن أسد، وقبل أن يضرب رسول الله ﷺ عنقه جرى بينه وبين كعب حوار : قال رسول الله: كعب بن أسد؟ قال كعب بن أسد: نعم يا أبا القاسم، قال رسول الله ﷺ : ما أنتفعتم بنصح ابن خراش لكم، وكان مصدقاً بي، أما أمركم باتباعي، وإن رأيتموني تقرئوني منه السلام؟ قال كعب: بلى والتوراة يا أبا القاسم، ولولا أن تعيرني يهود بالجزع من السيف لاتبعتك، ولكني على دين يهود. فأمر رسول الله ﷺ بضرب عنقه فضربت.';
const String p23 =
    'في اختلاف الصحابة في فهم كلام رسول الله ﷺ : ألا لا يصلين أحد العصر إلا في بني قريظة فبعضهم فهم منه المراد الاستعجال، فصلى العصر لما دخل وقته وبعضهم أخذ بالظاهر فلم يصلي إلا في بني قريظة ولم يعنف النبي ﷺ أحداً منهم أو عاتبه، ففي ذلك دلالة هامة على أصل من الأصول الشرعية الكبرى وهو تقرير مبدأ الخلاف في مسائل الفروع، واعتبار كل من المتخالفين معذوراً ومثاباً، كما أن فيه تقريراً لمبدأ الاجتهاد في استنباط الأحكام الشرعية، وفيه مايدل على أن استئصال الخلاف في مسائل الفروع التي تنبع من دلالات ظنية أمر لايمكن أن يتصور أو يتم.';
const String p24 =
    'جمع صحابة رسول الله ﷺ الغنائم التي خلفها بنو قريظة، فكانت من السيوف ألفاً وخمسمائة سيف، ومن الرماح ألفي رمح، ومن الدروع ثلاثمائة درع، ومن التروس ألفاً وخمسمائة ترساً وجحفة، كما تركوا عدداً كبيراً من الشياه والإبل وأثاثاً كثيراً وآنية كثيرة، ووجد المسلمون دناناً من الخمر، فوزعت الغنائم وهي الأموال المنقولة كالسلاح والأثاث وغيرها بين المحاربين من أنصار ومهاجرين ممن شهدوا الغزوة، فأعطى أربعة أخماس الغنائم لهم، إذ جعل للفرس سهمين، وللراجل سهماً، فالفارس يأخذ ثلاثة أسهم لهم ولفرسه، وغير الفارس يأخذ سهماً واحداً له، والخمس المتبقي هو سهم الله ورسوله المقرر في كتابه تعالى.';
const String p25 =
    'وأما ماوجده رسول الله ﷺ والمسلمون من الخمر عند بني قريظة فقد أراقوه ولم يأخذوا منه شيئاً، ولم ينتفعوا به كذلك، وقد أسهم رسول الله ﷺ لسويد بن خلاد الذي قتلته المرأة اليهودية بالرحى وأعطى سهمه لورثته ولصحابي آخر مات أثناء حصار بني قريظة، كما رضخ رسول الله ﷺ للنساء اللواتي حضرن ولم يسهم لهن، منهن: صفية بنت عبدالمطلب، وأم عمارة، وأم سليط، وأم العلاء، والسميراء بنت قيس، وأم سعد بن معاذ وأما الأموال غير المنقولة كالأراضي والديار فقد أعطاها رسول الله ﷺ للمهاجرين دون الأنصار، وأمر المهاجرين أن يردوا إلى الأنصار ما أخذوه منهم من نخيل وأرض، وكانت على سبيل العارية، ينتفعون بثمارها، قال تعالى عن تلك الأراضي والديار: وَأَوْرَثَكُمْ أَرْضَهُمْ وَدِيَارَهُمْ وَأَمْوَالَهُمْ وَأَرْضًا لَمْ تَطَئُوهَا وَكَانَ اللَّهُ عَلَى كُلِّ شَيْءٍ قَدِيرًا - سورة الأحزاب';
