const int sectionIndex = 7;
const String sectionTitle = 'عناية اللَّه بالنبى ﷺ';

const List t1 = ['1', 'وفاة أمه وكفالة جده ثم عمه'];
const List t2 = ['2', 'حكمة الله وعناية به ﷺ'];
const List t3 = ['3', 'لقائه ﷺ وهو غلام مع بحيرا الراهب'];
const List t4 = ['4', 'عمله ﷺ في الرعي'];
const List t5 = ['5', 'فى شبابه ﷺ'];
const List t6 = ['6', 'حرب الفجار'];
const List t7 = ['7', 'حلف الفضول'];

const String p1 =
    'توفيت أم النبي ﷺ وهو ابن ست سنين بالأبواء بين مكة والمدينة، وكانت قد قدمت به على أخواله من بني عدي بن النجار تزيره إياهم فماتت وهي راجعة به الى مكة ودفنت بالأبواء، وبعد وفاة أمه كفله جده عبدالمطلب فعاش في كفالته، وكان يؤثره على أبنائه أي أعمام النبي ﷺ فقد كان جده مهيباً لا يجلس على فراشه أحد من أبنائه مهابة له وكان أعمامه يتهيبون الجلوس على فراش أبيهم، وكان ﷺ يجلس على الفراش ويحاول أعمامه أن يبعدوه عن فراش ابيهم فيقف الأب الجد بجانبه ويرضى أن يبقى جالساً على فراشه متوسماً فيه الخير وأنه سيكون له شأن عظيم.';
const String p2 =
    'ثم توفي عبدالمطلب والنبي ﷺ في الثامنة من عمره فأوصى جده به عمه أبا طالب فكفله عمه وحنّ عليه ورعاه.';
const String p3 =
    'وأرادت حكمة الله أن ينشأ رسوله يتيماً تتولاه عناية الله وحدها بعيداً عن الذراع التي تمعن في تدليله والمال الذي يزيد في تنعيمه حتى لا تميل به نفسه الى مجد المال والجاه، وحتى لا يتأثر بما حوله من معنى الصدارة والزعامة، فيلتبس على الناس قداسة النبوة بجاه الدنيا وحتى لايحسبوه يصطنع الأول ابتغاء الوصول الى الثاني، وكانت المصائب التي أصابت النبي ﷺ منذ طفولته كموت أمه ثم جده بعد أن حرم عطف الأب وذاق كأس الحزن مرة بعد مرة، كانت تلك المحن قد جعلته رقيق القلب مرهف الشعور فالأحزان تصهر النفوس وتخلصها من أدران القسوة والكِبْر والغرور وتجعلها أكثر رقة وتواضعاً.';
const String p4 =
    'خرج أبو طالب إلى الشام وخرج معه النبي ﷺ في أشياخ من قريش، فلما أشرفوا على الراهب هبطوا فحلوا رحالهم فخرج إليهم الراهب وكانوا قبل ذلك يسيرون فلا يخرج إليهم ولايلتفت، فبينما هم يحلون رحالهم جعل الراهب يتخللهم حتى جاء فأخذ بيد رسول الله ﷺ قال: هذا سيد العالمين هذا رسول رب العالمين يبعثه الله رحمة للعالمين.';
const String p5 =
    'فقال له أشياخ من قريش: ماعلمك؟ فقال: إنكم حين أشرفتم من العقبة لم يبق شجر ولا حجر إلا خرّ ساجداً ولايسجدان إلا لنبيّ، وإني أعرفه بخاتم النبوة أسفل من غضروف كتفه مثل التفاحة ثم رجع فصنع لهم طعاماً، فلما أتاهم به وكان هو في رعية الإبل قال: أرسلوا إليه فأقبل وعليه غمامة تظله، فلما دنا من القوم وجدهم قد سبقوه إلى فئ الشجرة فلما جلس مال فئ الشجرة عليه فقال: انظروا إلى فئ الشجرة مال عليه قال: فبينما هو قائم عليهم وهو يناشدهم أن لايذهبوا به إلى الروم فإن الروم إذا عرفوه بالصفة فيقتلونه.';
const String p6 =
    'فالتفت فإذا سبعة قد أقبلوا من الروم فاستقبلهم فقال: ماجاء بكم؟ قالوا: جاءنا أن هذا النبي خارج في هذا الشهر فلم يبقى طريق إلا بعث إليه بأناس وإنا قد أخبرنا خبره بعثنا إلى طريقك هذا فقال: هل خلفكم أحد هو خير منكم؟ قالوا: إنما اخترنا خيره لك لطريقك هذا قال: أفرأيتم أمراً أراد الله أن يقضيه هل يستطيع أحد من الناس رده؟ قالوا: لا قال: فبايعوه وأقاموا معه قال: أنشدكم الله أيكم وليه ؟ قالوا: أبو طالب فلم يزل يناشده حتى رده أبو طالب.';

const String p7 =
    'كان ابو طالب مقلاً في الرزق فعمل النبي ﷺ برعي الغنم مساعدة منه لعمه فلقد أخبر ﷺ عن نفسه الكريمة وعن إخوانه من الأنبياء أنهم رعوا الغنم أما هو فقد رعاها لأهل مكة وهو غلام وأخذ حقه عن رعيه ففي الحديث الصحيح قال رسول الله ﷺ : مابعث الله نبياً إلا رَعى الغنم فقال: أصحابه: وأنت يارسول الله؟ وأنا رعيتها لأهل مكة بالقراريط إن رعي الغنم كان يتيح للنبي ﷺ الهدوء الذي تتطلبه نفسه الكريمة ويتيح له المتعة بجمال الصحراء ويتيح له التطلع الى مظاهر جلال الله في عظمة الخلق ويتيح له مناجاة الوجود في هدأة الليل وظلال القمر ونسمات الأشجار يتيح له لوناً من التربية النفسية من الصبر والحلم والأناة والرأفة والرحمة والعناية بالضعيف حتى يقوى وزم قوى القوي حتى يستمسك للضعيف ويسير بسيره وارتياد مشارع الخصب والري وتجنب الهلكة ومواقع الخوف من كل مالا تتيحه حياة أخرى بعيدة عن جو الصحراء وهدوئها وسياسة هذا الحيوان الأليف الضعيف.';

const String p8 =
    'وقد حفظه الله تعالى من نزعات الشباب ودواعيه التي تنزع إليها الشبوبية بطبعها ولكنها لا تلائم وقار الهداة وجلال المرشدين فعن علي بن أبي طالب رضي الله عنه: سمعت رسول الله ﷺ يقول: ماهممت بقبيح مما كان أهل الجاهلية يهموّن به إلا مرتين من الدهر كلتيهما يعصمني الله منهما قلت ليلة لفتى كان معي من قريش بأعلى مكة في أغنام أهله يرعاها: أبصر إلي غنمي حتى أسمر هذه الليلة بمكة كما يسهر الفتيان قال: نعم فخرجت فجئت أدنى دار من دور مكة سمعت غناء وضرب دفوف ومزامير فقلت: ماهذا؟ فقالوا: فلان تزوج فلانة لرجل من قريش تزوج امرأة من قريش فلهوت بذلك الغناء وبذلك الصوت حتى غلبتني عيني فما أيقظني إلا حر الشمس فرجعت فقال: مافعلت؟ فأخبرته.';
const String p9 =
    'ثم قلت له ليلة أخرى مثل ذلك ففعل فخرجت فسمعت مثل ذلك فقيل لي مثل ماقيل لي فلهوت بما سمعت حتى غلبتني عيني، فما أيقظني إلا مسُّ الشمس ثم رجعت إلى صاحبي فقال: فما فعلت؟ قلت: مافعلت شيئاً قال رسول الله ﷺ : فوالله ماهممت بعدها بسوء مما يعمل أهل الجاهلية حتى أكرمني الله بنبوته.';

const String p10 =
    'اندلعت هذه الحرب بين قريش ومن معهم من كنانة وبين هوازن، وسببها أن عروة الرحّال بن عتبة ابن هوازن أجار لطيمة للنعمان ابن المنذر إلى سوق عكاظ فقال البرَّاض بن قيس ابن كنانة اتجيرها على كنانة؟ قال نعم وعلى الخلق، فخرج بها عروة وخرج البراض يطلب غفلته حتى قتله، وعلمت بذلك كنانة فارتحلوا وهوازن لاتشعر بهم ثم بلغهم الخبر فاتبعوهم فأدركوهم قبل أن يدخلوا الحرم فاقتتلوا، حتى جاء الليل ودخلوا الحرم فأمسكت عنهم هوازن ثم التقوا بعد هذا اليوم أياماً وعاونت قريش كنانة وشهد محمد ﷺ بعض أيامهم أخرجه أعمامه معهم.';
const String p11 =
    'وسميت يوم الفجار بسبب ما استحل فيه من حرمات مكة التي كانت مقدسة عند العرب، وقد قال ﷺ عن تلك الحرب كنت أُنبِّل على أعمامي أي أرد عليهم نبل عدوهم إذا رموهم بها، وكان ﷺ حينئذ ابن أربع عشرة أو خمس عشر سنة وقيل ابن عشرين ويرجح الأول، أنه كان يجمع النبال ويناولها لأعمامه مما يدل على حداثة سنه، وبذلك اكتسب الجرأة والشجاعة والإقدام وتمرن على القتال منذ ريعان شبابه، وهكذا انتهت هذه الحرب التي كثيراً ماتشبه حروب العرب تبدؤها حتى ألف الله بين قلوبهم وأزاح عنهم هذه الضلالات بانتشار نور الإسلام بينهم.';
const String p12 =
    'كان حلف الفضول بعد رجوع قريش من حرب الفجار، وسببه أن رجلاً من زبيد قدم مكة ببضاعة فاشتراها منه العاص بن وائل ومنعه حقه، فاستعدى عليه الزبيدي أشراف قريش فلم يعينوه لمكانة العاص فيهم، فوقف عند الكعبة واستغاث بآل فهر وأهل المروءة ونادى بأعلى صوته: يا آل فهر لمظلوم بضاعته ببطن مكة نائي الدار والنفر، فقام الزبير بن عبدالمطلب فقال: مالهذا مترك فاجتمعت بنو هاشم وزهرة وبنو تَيْم بن مرة في دار عبدالله بن جُدْعان فصنع لهم طعاماً وتحالفوا في شهر حرام وهو ذو القعدة، فتعاقدوا وتحالفوا بالله ليكونُنّ يداً واحدة مع المظلوم على الظالم حتى يُرد إليه حقه مابلّ بحرٌ صوفة ومابقي جَبَلاً ثبير وحراء مكانهما، ثم مشوا إلى العاص بن وائل فانتزعوا منه سلعة الزبيدي فدفعوها إليه.';
const String p13 =
    'وسمَّت قريش هذا الحلف حلف الفضول وقالوا: لقد دخل هؤلاء في فضل من الأمر، وقد حضر هذا الحلف النبي ﷺ الذي هدموا به صرح الظلم ورفعوا به منار الحق وهو يعتبر من مفاخر العرب وعرفانهم لحقوق الإنسان، وقد قال ﷺ : شهدت حلف المطيبين مع عمومتي وأنا غلام فما أحب أن لي حمر النعم وأني أنكثه وقال ﷺ : لقد شهدت في دار عبدالله بن جُدعان حلفاً ما أحب أن لي به حمر النّعم, ولو دعيت به في الإسلام لأجبت.';
