const int sectionIndex = 62;
const String sectionTitle = 'سرية ذات السلاسل';

const List t1 = ['1', 'تأديب قضاعة'];
const List t2 = ['2', 'إخلاص عمرو بن العاص'];
const List t3 = ['3', 'أبو عبيدة وعمرو بن العاص رضى الله عنهما'];
const List t4 = ['4', 'حرص عمرو بن العاص على سلامة قواته'];
const List t5 = ['5', 'من فقه عمرو بن العاص - البرد الشديد'];
const List t6 = ['6', 'الاجتهاد الفقهى'];
const List t7 = ['7', 'المكاسب السياسية والعسكرية'];

const String p1 =
    'لم تمض سوى أيام على عودة الجيش من مؤتة الى المدينة حتى جهز النبي ﷺ جيشاً بقيادة عمرو بن العاص الى ذات السلاسل، وذلك لتأديب قضاعة التي غرها ماحدث في مؤتة التي اشتركت فيها الى جانب الروم فتجمعت تريد الدنو من المدينة، فتقدم عمرو بن العاص في ديارها ومعه ثلثمائة من المهاجرين والأنصار، ولما وصل الى مكان تجمع الأعداء بلغه أن لهم جموعاً كثيرة، فأرسل الى رسول الله ﷺ يطلب المدد فجاءه مدداً بقيادة أبي عبيدة بن الجراح ، وقاتل المسلمين الكفار وتوغل عمرو في ديار قضاعة التي هربت وتفرقت وانهزمت ونجح عمرو في إرجاع هيبة الاسلام لأطراف الشام وإرجاع أحلاف المسليمن لصداقتهم الأولى، ودخول قبائل اخرى في حلف المسلمين وإسلام الكثيرين من بني عبس وبني مرة وبني ذبيان وكذلك فزارة وسيدها عيينة بن حصن في حلف مع المسلمين، وتبعها بنو سُلَيم وعلى رأسهم العباس بن مرداس وبنو أشجع وأصبح المسلمون هم الأقوى في شمال بلاد العرب وإن لم يكن في بلاد العرب جميعها.';
const String p2 =
    'قال عمرو بن العاص: بعث إليَّ رسول الله ﷺ فقال: خذ عليك ثيابك وسلاحك ثم ائتني، فأتيته وهو يتوضأ فصعَّد فيَّ النظر ثم طأطأ، فقال: إني أريد أن أبعثك على جيش، فيسلمك الله ويغنمك وأرغب لك في المال رغبة صالحة، قال: قلت: يارسول الله ما أسلمت من أجل المال ولكني أسلمت رغبة في الاسلام، وأن أكون مع رسول الله ﷺ فقال رسول الله ﷺ : ياعمرو نعم المال الصالح للمرء الصالح.';
const String p3 =
    'عندما وصل المدد الذي بعثه رسول الله ﷺ بقيادة أبي عبيدة بن الجراح لجيش عمرو في ذات السلاسل، أراد أبو عبيدة أن يؤم الناس ويتقدم عمرو فقال له عمرو: إنما قدمت علي مدداً لي وليس لك ان تؤمني وأنا الأمير وإنما أرسلك النبي ﷺ إليَّ مدداً، فقال المهاجرون كلا بل أنت أمير أصحابك وهو أمير أصحابه فقال عمرو: لا بل أنتم مدد لنا، فلما رأى أبو عبيدة الاختلاف وكان حسن الخلق لين الطبع قال: لتطمئن ياعمرو وتعلمن أن آخر ماعهد إليَّ رسول الله أن قال: إذا قدمت على صاحبك فتطاوعا ولا تختلفا وأنك والله ان عصيتني لأطيعنك فأطاع أبو عبيدة، فكان عمرو يصلي بالناس.';
const String p4 =
    'لقد أدرك أبو عبيدة رضي الله عنه أن أي اختلاف بين المسلمين في سرية ذات السلاسل يؤدي الى الفشل ومن ثم تغلب العدو عليهم، ولهذا سارع الى قطع النزاع وانضم جنديا تحت إمرة عمرو بن العاص امتثالاً لأمر الرسول ﷺ لاتختلفا.';
const String p5 =
    'كان يسير ليلاً ويختفي نهاراً فكان يدرك بثاقب بصره وبعد نظره أن العدو يمكن أن يسعى الى معرفة أخباره قبل اللقاء بينهما، فيستعد للقاء جيش المسلمين وأن السير ليلاً والاختفاء نهاراً ، هو أفضل أسلوب للمحافظة على قواته و حماية الجند من شدة الحر وحتى يبقى لهم نشاطهم فيصلون الى مكان المواجهة وهم أقوياء ، كما لم يتم السماح للجند بإيقاد النار فعندما طلب الجنود من عمرو أن يسمح لهم بإيقاد النار لحاجتهم الماسة الى التدفئة منعهم من ذلك معتمداً في ذلك على خبرته الحربية وعمق فكره العسكري وخوفاً من وقوع مفسدة أعظم من تلك المصلحة وهي أن يمتد الضوء فيكشف المسلمين وهم قلة لأعدائهم فيهجموا عليهم ويتجلى هذا الفقه في حزمه الشديد مع أصحابه عندما كلمه أبو بكر في ذلك فقال: لا يوقد أحد منهم ناراً إلا قذفته فيها، فلما رجعوا الى المدينة ذكروا ذلك لرسول الله ﷺ ، فساله رسول الله ﷺ فقال: كرهت أن آذن لهم أن يوقدوا ناراً فيرى عدوهم قلتهم، فأقره النبي ﷺ على فعله، وكذلك منع الجند من مطاردة أعدائهم لئلا يترتب على هذه المطاردة مفسدة أعظم منها وهي أن يقع المسلمون في كمين.';
const String p6 =
    'قال عمرو احتلمت في ليلة باردة في غزوة ذات السلاسل، فأشفقت إن اغتسلت أن أهلك فتيممت ثم صليت بأصحابي الصبح، فذكروا ذلك للنبي ﷺ فقال: ياعمرو صليت بأصحابك وأنت جنب؟ فأخبرته بالذي منعني من الاغتسال وقلت: إني سمعت الله يقول: وَلا تَقْتُلُوا أَنْفُسَكُمْ إِنَّ اللَّهَ كَانَ بِكُمْ رَحِيمًا - سورة النساء فضحك رسول الله ﷺ ولم يقل شيئاً ، وقد استُنبط بعض الاحكام من هذه القصة:';
const String p7 =
    'التيمم يقوم مقام الغسل بالنسبة للجنب مع وجود الماء اذا خشي أن يؤدي استخدام الماء الى الضرر، فلقد تيمم عمرو بن العاص لما أصبح جنباً مع وجود الماء عنده وصلى وأقره الرسول ﷺ ولم ينكر عليه.';
const String p8 =
    'يجوز الاجتهاد في عهده ﷺ : فقد اجتهد عمرو بن العاص فتوضأ واغتسل وصلى وقد احتلم في تلك الليلة الباردة اعتماداً على قوله تعالى: وَلا تَقْتُلُوا أَنْفُسَكُمْ إِنَّ اللَّهَ كَانَ بِكُمْ رَحِيمًا - سورة النساء ، فلم ينكر عليه الرسول ﷺ اجتهاده بل أقره على أمرين: الأول: جواز الاجتهاد، والثاني تصحيح اجتهاده.';
const String p9 =
    'من الأسباب المبيحة للتيمم تعذر استخدام الماء وإن وجد كالبرد الشديد.';
const String p10 =
    'تجوز إمامة المتيمم بالمتوضيء: فقد صلى عمرو بن العاص وهو متيمم إماماً بخمسمائة صحابي قد توضأوا وأقره الرسول على ذلك ولم ينكر عليه.';
const String p11 =
    'اجتهاد عمرو بن العاص يدل على فقهه ووفور عقله، ودقة استنباطه الحكم من دليله ولئن وقف الفقهاء عند هذه الحادثة يفرعون عليها الأحكام فإن الذي يستوقفنا في السيرة منها تلك السرعة في أخذ عمرو للقرآن وصلته به حتى بات قادراً على فقه الأمور من خلال ال وهو لم يمض على إسلامه أربعة أشهر، إنه الحرص على الفقه في دين الله، وقد يكون عمرو - وهذا احتمال وارد - على صلة بالقرآن قبل إسلامه يتتبع مايستطيع الوصول إليه، وحينئذ نكون أمام مثال آخر من عظمة هذا القرآن الذي لوى أعناق الكافرين وجعلهم وهم في أشد حالات العداوة لهذا الدين يحاولون استماع هذا القرآن، كما رأينا ذلك في العهد المكي ويؤيد هذا مارأيناه من معرفته بالقرآن حينما طلب من النجاشي أن يسأل مهاجري الحبشة عن رأيهم في عيسى عليه السلام.';
const String p12 =
    'اتجهت حملات المسلمين العسكرية بعد صلح الحديبية نحو الشمال وأصبح غرب الجزيرة وجنوبها الغربي حيث تقبع مكة آمنة في ظلال الصلح وحققت سرايا رسول الله ﷺ اهدافهاً ومقاصدها في شمال الجزيرة، فوصلت الى حدود الروم، فأمنت حدود الدولة الاسلامية، وبسطة هيبتها وأفشلت محاولات الإغارة على المدينة وبذلك حققت سياسة النبي ﷺ في حركة السرايا هدفين عظيمين هما تأمين حماية الدين الاسلامي في الداخل وحمايته في الخارج.';
const String p13 =
    'ومامن شك أن المتتبع لأحداث السيرة النبوية الشريفة والمطَّلع على تفاصيلها ودقائقها بإمعان يجد بحق أن صلح الحديبية هو من أهم المكاسب السياسية والعسكرية والإعلامية، بل هو حصيلة كسب لأعظم معركة دارت بين الاسلام والوثنية في العهد النبوي من حيث النتائج الإيجابية التي رسخت دعائم الاسلام من جهة وصدعت بفعلها قواعد الشرك والوثنية من جهة أخرى وماحدث في خيبر من فتوح وفي مؤتة من نصر وفي ذات السلاسل من توسيع هيبة الدولة الاسلامية إلا نتائج تابعة لصلح الحديبية، وبسبب القدرة الفائقة في تعامل النبي ﷺ مع سنن الله في المجتمعات والشعوب وبناء الدول.';
