const int sectionIndex = 29;
const String sectionTitle = 'غزوة بدر - ماقبل المعركة';

const List t1 = ['1', 'رؤيا عاتكة '];
const List t2 = ['2', 'قافلة أبوسفيان'];
const List t3 = ['3', 'العزم على ملاقاة المسلمين ببدر'];
const List t4 = ['4', 'مشاورة النبي ﷺ لأصحابه'];
const List t5 = ['5', 'كلمة سعد بن معاذ'];
const List t6 = ['6', 'المسير الى لقاء العدو وجمع المعلومات'];
const List t7 = ['7', 'التورية في الحرب'];
const List t8 = ['8', 'ألقت إليكم أفلاذ كبدها'];
const List t9 = ['9', 'مشورة الحباب بن المنذر'];
const List t10 = ['10', 'موقف المشركين ببدر'];
const List t11 = ['11', 'الوصف القرآني'];

const String p1 =
    'رأت عاتكة بنت عبد المطلب عمة رسول الله ﷺ رؤيا خوفتها، فأرسلت إلى أخيها العباس بن عبد المطلب عم رسول الله صلى الله عليه لتحكي له الرؤيا، وقالت له: أنها رأت راكباً أقبل على بعير، ثم صرخ بأعلى صوته: ألا انفروا يا آل غدر لمصارعكم بعد ثلاث أيام.';
const String p2 =
    'ثم أرسل صخرة فأقبلت تهوي  حتى إذا كانت بأسفل الجبل تفتتت فما بقي بيت من بيوت مكة إلا دخلت فيه جزء منها.';
const String p3 =
    'انتشر الأمر في قريش حتى وصل إلى أبي جهل وكان العباس في ذلك اليوم ذاهباً ليطوف بالبيت الحرام، فلقيه أبو جهل ، فقال له: يا بني عبد المطلب! متى حدثت فيكم هذه النبية؟ فأراد العباس أن ينكر فقال له: وما ذاك؟ قال أبو جهل: تلك الرؤيا التي رأت عاتكة ، قال العباس: وما رأت؟ قال أبو جهل: يا بني عبد المطلب أما رضيتم أن يتنبأ رجالكم حتى تتنبأ نساؤكم.';
const String p4 =
    'فإن يك حقاً ما تقول فسيكون، وإن تمض الثلاث ولم يكن من ذلك شيء نكتب عليكم كتاباً أنكم أكذب أهل بيت في العرب، وكانت هذه فرصة لأبي جهل ليشمت في بني عبد المطلب فإن الصراع طويل جداً بين بني مخزوم -قبيلة أبي جهل- وبين بني هاشم قبيلة الرسول ﷺ .';
const String p5 =
    'ومر يومان وفي اليوم الثالث وأبو جهل يستعد للشماتة في بني عبد المطلب جاء ضمضم بن عمرو الغفاري الذي بعثه أبو سفيان وهو يصرخ: يا معشر قريش اللطيمة  اللطيمة أموالكم قد عرض لها محمد في أصحابه، لا أرى أن تدركوها، الغوث الغوث، فنفر كل أهل قريش، وتحققت رؤيا عاتكة.';
const String p6 =
    'بلغ المسلمون تحرك قافلة تجارية كبيرة من الشام تحمل أمولاً عظيمة لقريش يقودها أبوسفيان ويقوم على حراستها بين ثلاثين وأربعين رجلاً، فأرسل الرسول ﷺ بسبس بن عمرو لجمع المعلومات عن القافلة فلما عاد بسبس بالخبر اليقين ندب رسول الله ﷺ أصحابه للخروج وقال لهم: هذه عير قريش فيها أموالهم فاخرجوا إليها لعل الله ينفلكموها، وكان خروجه من المدينة في اليوم الثاني عشر من شهر رمضان المبارك من السنة الثانية للهجرة ومن المؤكد أنه حين خروجه ﷺ من المدينة لم يكن في نيته قتال وإنما كان قصده عير قريش، وكانت الحالة بين المسلمين وكفار مكة حالة حرب وفي حالة الحرب تكون أموال العدو ودمائهم مباحة فكيف إذا علمنا أن جزءاً من هذه الأموال الموجودة في القوافل القرشية كانت للمهاجرين المسلمين من أهل مكة قد استولى عليها المشركون ظلماً وعدواناً.';
const String p7 =
    'أرسل النبي ﷺ اثنين من أصحابه الى بدر طليعة للتعرف عن أخبار القافلة فرجعا إليه بخبرها و كانت قوات المسلمين في بدر لاتمثل القدرة العسكرية القصوى للدولة الاسلامية ذلك أنهم إنما خرجوا لاعتراض قافلة واحتوائها ولم يكونوا يعلمون أنهم سوف يواجهون قوات قريش وأحلافها مجتمعة للحرب والتي بلغ تعدادها ألفاً معهم مائتا فرس يقودونها الى جانب جمالهم.';
const String p8 =
    'بلغ أبا سفيان خبر مسير النبي ﷺ بأصحابه من المدينة بقصد اعتراض قافلته واحتوائها فبادر الى تحويل مسارها الى طريق الساحل، في نفس الوقت أرسل عمرو بن ضمضم الغفاري الى قريش يستنفرها لإنقاذ قافلتها وأموالها فقد كان أبو سفيان يقظاً حذراً يتلقط أخبار المسلمين ويسأل عن تحركاتهم بل يتحسس أخبارهم بنفسه، فقد تقدم الى بدر بنفسه وسأل من كان هناك هل رأيتم من أحد؟ قالوا: لا إلا رجلين قال: اروني مناخ ركابهما فأروه، فأخذ البعر ففته فإذا هو فيه النوى فقال: هذا والله علائف يثرب فقد استطاع أن يعرف تحركات عدوه حتى خبر السرية الاستطلاعية عن طريق غذاء دوابها بفحصه البعر الذي خلفته الابل، إذ عرف أن الرجلين من المدينة أي من المسلمين وبالتالي فقافلته في خطر فأرسل عمرو بن ضمضم الى قريش وغير طريق القافلة واتجه نحو ساحل البحر.';
const String p9 =
    'كان وقع خبر القافلة شديداً على قريش فقد جاءهم عمرو بن ضمضم الغفاري بصورة مثيرة جداً يتأثر بها كل من رآها أو سمع بها إذ جاءهم وقد حول رحله وجدع أنف بعيره وشق قميصه من قبل ومن دبر ودخل مكة وهو ينادي بأعلى صوته: يامعشر قريش اللطيمة اللطيمة أموالكم مع أبي سفيان قد عرض لها محمد في أصحابه لا أرى أن تدركوها الغوث الغوث.';
const String p10 =
    'لما بلغ النبي ﷺ نجاة القافلة وإصرار زعماء مكة على قتال النبي ﷺ ، استشار رسول الله ﷺ أصحابه في الأمر وأبدى بعض الصحابة عدم ارتياحهم لمسألة المواجهة الحربية مع قريش حيث أنهم لم يتوقعوا المواجهة ولم يستعدوا لها وحاولوا اقناع الرسول ﷺ بوجهة نظرهم، وقد صور القرآن الكريم موقفهم وأحوال الفئة المؤمنة عموماً في قوله تعالى: كَمَا أَخْرَجَكَ رَبُّكَ مِنْ بَيْتِكَ بِالْحَقِّ وَإِنَّ فَرِيقًا مِنَ الْمُؤْمِنِينَ لَكَارِهُونَ يُجَادِلُونَكَ فِي الْحَقِّ بَعْدَمَا تَبَيَّنَ كَأَنَّمَا يُسَاقُونَ إِلَى الْمَوْتِ وَهُمْ يَنْظُرُونَ وَإِذْ يَعِدُكُمُ اللَّهُ إِحْدَى الطَّائِفَتَيْنِ أَنَّهَا لَكُمْ وَتَوَدُّونَ أَنَّ غَيْرَ ذَاتِ الشَّوْكَةِ تَكُونُ لَكُمْ وَيُرِيدُ اللَّهُ أَنْ يُحِقَّ الْحَقَّ بِكَلِمَاتِهِ وَيَقْطَعَ دَابِرَ الْكَافِرِينَ لِيُحِقَّ الْحَقَّ وَيُبْطِلَ الْبَاطِلَ وَلَوْ كَرِهَ الْمُجْرِمُونَ - سورة الأنفال';
const String p11 =
    'وقد أجمع قادة المهاجرين على تأييد فكرة التقدم لملاقاة العدو وكان للمقداد بن الأسود موقفاً متميزاً فقد قال عبدالله بن مسعود رضي الله عنه: شهدت من المقداد بن الأسود مشهداً لأن أكون صاحبه أحب إليَّ مما عُدِلَ به أتى النبي ﷺ وهو يدعو على المشركين فقال: لانقول كما قال قوم موسى: قَالُوا يَامُوسَى إِنَّا لَنْ نَدْخُلَهَا أَبَدًا مَا دَامُوا فِيهَا فَاذْهَبْ أَنْتَ وَرَبُّكَ فَقَاتِلا إِنَّاهَاهُنَا قَاعِدُونَ - سورة المائدة ، ولكن نقاتل عن يمينك وعن شمالك وبين يديك وخلفك .';
const String p12 =
    'وبعد ذلك عاد رسول الله ﷺ فقال: أشيروا عليَّ أيها الناس، وكان إنما يقصد الأنصار لأنهم غالبية جنده ولأن بيعة العقبة الثانية لم تكن في ظاهرها ملزمة لهم بحماية الرسول ﷺ خارج المدينة، وقد أدرك الصحابي سعد بن معاذ وهو حامل لواء الانصار مقصد النبي ﷺ من ذلك فنهض قائلاً: والله لكانك تريدنا يارسول الله؟ قال ﷺ أجل قال: لقد آمنا بك وصدقناك وشهدنا أن ماجئت به هو الحق وأعطيناك على ذلك عهودنا ومواثيقنا على السمع والطاعة، فامضي يارسول الله لما أردت فو الذي بعثك بالحق لو استعرضت بنا هذا البحر فخضته لخضناه معك ماتخلف منا رجل واحد ومانكره أن تلقى بنا عدوّنا غداً، وإنا لصبر في الحرب صدق عند اللقاء ولعل الله يريك منا ما تقرّ به عينك فسر على بركة الله.';
const String p13 =
    'وسُرّ النبي ﷺ من مقالة سعد بن معاذ ونشطه ذلك فقال ﷺ : سيروا وأبشروا فإن الله تعالى قد وعدني إحدى الطائفتين والله لكأني أنظر الى مصارع القوم.';
const String p14 =
    'نظم النبي ﷺ جنده بعد أن رأى طاعة الصحابة وشجاعتهم واجتماعهم على القتال وعقد اللواء الأبيض وسلّمة الى مصعب بن عمير وأعطى رايتين سوداوين الى سعد بن معاذ وعلي بن أبي طالب وجعل على الساقة قيس بن أبي صعصعة.';
const String p15 =
    'وقام ﷺ ومعه أبو بكر يستكشف أحوال جيش المشركين وبينما هما يتجولان في تلك المنطقة لقيا شيخاً من العرب، فسأله رسول الله ﷺ عن جيش قريش وعن محمد وأصحابه ومابلغه ﷺ من أخبارهم: فقال الشيخ لا أخبركما حتى تخبراني ممن أنتما، فقال له رسول الله ﷺ : إذا أخبرتنا أخبرناك فقال: أو ذاك بذاك؟ قال: نعم، فقال الشيخ : فإنه بلغني أن محمداً وأصحابه خرجوا يوم كذا وكذا فإن كان صدق الذي أخبرني فهم اليوم بمكان كذا وكذا -للمكان الذي به جيش المسلمين- وبلغني أن قريشاً خرجوا يوم كذا وكذا فإن كان صدق الذي أخبرني فهم اليوم بمكان كذا وكذا -للمكان الذي فيه جيش المشركين فعلاً- ثم قال الشيخ: لقد أ خبرتكما عما أردتما فأخبراني: ممن أنتما؟ فقال رسول الله ﷺ : نحن من ماء ، ثم انصرف النبي ﷺ وأبوبكر عن الشيخ وبقي هذا الشيخ يقول: مامن ماء؟ أمن ماء العراق.';
const String p16 =
    'وفى تورية الرسول ﷺ في إجابته على سؤال الشيخ ممن أنتما؟ بقوله ﷺ : نحن من ماء وهو جواب يقتضيه المقام فقد اراد به الرسول ﷺ كتمان أخبار جيش المسلمين عن قريش وفي انصرافه فور استجوابه كتمان، وهو دليل على مايتمتع به رسول الله ﷺ من الحكمة، فلو أنه أجاب هذا الشيخ ثم وقف عنده لكان هذا سبباً في طلب الشيخ بيان المقصود من قوله ﷺ من ماء وقد استدل الامام النووي بهذا الحديث على استحباب التورية في الحرب وأن لايبين القائد الجهة التي يقصدها لئلا يشيع هذا الخبر فيحذرهم العدو.';
const String p17 =
    'وفي مساء ذلك اليوم الذي خرج فيه رسول الله ﷺ وأبوبكر أرسل عليه الصلاة والسلام عليّ بن أبي طالب والزبير بن العوام وسعد بن أبي وقاص في نفر من أصحابه الى ماء بدر يتسقطون له الأخبار عن جيش قريش، فوجدوا غلامين يستقيان لجيش المشركين فأتوا بهما الى رسول الله ﷺ فقال لهما: أخبراني عن جيش قريش فقالا هم وراء هذا الكثيب الذي ترى بالعدوة القصوى، فقال لهما: كم القوم؟ قالا: كثير قال: ماعدتهم؟ قالا: لاندري قال الرسول ﷺ : كم ينحرون كل يوم؟ قال: يوماً تسعاً ويوماً عشراً فقال رسول الله ﷺ : القوم مابين التسعمائة والألف فقال لهما: فمن فيهم من أشراف قريش؟ فذكرا عتبة بن ربيعة وشيبة وأباجهل وأمية بن خلف في آخرين من صناديد قريش فأقبل رسول الله ﷺ الى أصحابه قائلاً: هذة مكة قد ألقت إليكم أفلاذ كبدها.';
const String p18 =
    'بعد أن جمع ﷺ معلومات دقيقة عن قوات قريش سار مسرعاً ومعه أصحابه الى بدر ليسبقوا المشركين الى ماء بدر وليحولوا بينهم وبين الاستيلاء عليه، فنزل عند أدنى ماء بدر من مياه بدر وهنا قام الحباب بن المنذر وقال: يارسول الله: أرأيت هذا المنزل أمنزلاً أنزلكه الله ليس لنا أن نتقدمه ولا نتأخر عنه؟ أم هو الرأي والحرب والمكيدة؟ قال: بل هو الرأي والحرب والمكيدة، قال: يارسول الله فإن هذا ليس بمنزل فانهض يارسول الله بالناس حتى تأتي أدنى ماء من القوم -أي جيش المشركين- فننزله ونغوِّر ماوراءه من الآبار، ثم نبني عليه حوضاً فنملؤه ماءً ثم نقاتل القوم فنشرب ولا يشربون فأخذ النبي ﷺ برأيه ونهض بالجيش حتى أقرب ماء من العدو فنزل عليه ثم صنعوا الحياض وغوروا ما عداها من الآبار، وهذا يصور مثلاً من حياة الرسول ﷺ مع أصحابه حيث كان أي فرد من أفراد ذلك المجتمع يدلي برأيه حتى في أخطر القضايا ولا يكون في شعوره احتمال غضب القائد الاعلى ثم حصول مايترتب على ذلك الغضب من تدني سمعة ذلك المشير بخلاف رأي القائد وتأخره في الرتبة وتضرره في نفسه أو ماله.';
const String p19 =
    'قد ساهمت رؤيا عاتكة بنت عبدالمطلب أثر على وإضعاف النفسية ومعنويات أهل مكة، ولما وصل جيش مكة الى بدر دبّ فيهم الخلاف وتزعزت صفوفهم الداخلية وكانت القوة المعنوية متزعزعة في النفوس وإن كان مظهره القوة والعزم والثبات إلا أن في مخبره الخوف والجبن والتردد.';
const String p20 =
    'وبين سبحانه وتعالى موقف المشركين لما قدموا الى بدر قال تعالى: إِنْ تَسْتَفْتِحُوا فَقَدْ جَاءَكُمُ الْفَتْحُ وَإِنْ تَنْتَهُوا فَهُوَ خَيْرٌ لَكُمْ وَإِنْ تَعُودُوا نَعُدْ وَلَنْ تُغْنِيَ عَنْكُمْ فِئَتُكُمْ شَيْئًا وَلَوْ كَثُرَتْ وَأَنَّ اللَّهَ مَعَ الْمُؤْمِنِينَ - سورة الأنفال';
const String p21 =
    'وصف القرآن الكريم مواقع المسلمين والمشركين في أرض المعركة ، قال تعالى: إِذْ أَنْتُمْ بِالْعُدْوَةِ الدُّنْيَا وَهُمْ بِالْعُدْوَةِ الْقُصْوَى وَالرَّكْبُ أَسْفَلَ مِنْكُمْ وَلَوْ تَوَاعَدْتُمْ لاخْتَلَفْتُمْ فِي الْمِيعَادِ وَلَكِنْ لِيَقْضِيَ اللَّهُ أَمْرًا كَانَ مَفْعُولا لِيَهْلِكَ مَنْ هَلَكَ عَنْ بَيِّنَةٍ وَيَحْيَا مَنْ حَيَّ عَنْ بَيِّنَةٍ وَإِنَّ اللَّهَ لَسَمِيعٌ عَلِيمٌ - سورة الأنفال';
const String p22 =
    'هذه الآيات الكريمة توضح الأماكن في غزوة بدر وصور لنا سبحانه وتعالى الحالة التي كان عليها الجيشان يوم اللقاء فقد كان المسلمون بجانب الوادي وحافته الأقرب الى المدينة، وكانت أرضه رخوة تغوص فيها الأقدام ولم يكن هناك ماء وكان الكفار بالجانب الآخر من الوادي الأبعد من المدينة وكانت أرضه ثابتة وكان فيها ماء وكان ركب العير الذي يقوده أبوسفيان أَسْفَلَ مِنْكُمْ بالقرب من ساحل البحر.';
const String p23 =
    'وقوله تعالى: وَلَوْ تَوَاعَدْتُمْ لاخْتَلَفْتُمْ فِي الْمِيعَادِ وَلَكِنْ لِيَقْضِيَ اللَّهُ أَمْرًا كَانَ مَفْعُولا ، بيان لتدبير الله الحكيم وإرادته النافذة أي ولو تواعدتم أنتم وهم على التلاقي للقتال هناك لاختلفتم في الميعاد لكراهتكم للحرب على قلتكم وعدم إعدادكم شيئاً من العدة لها وانحصار همكم في أخذ العير، ولأن غرض الأكثرين منهم كان إنقاذ العير دون القتال أيضاً لأنهم كانوا يهابون قتال رسول الله ﷺ ولا يأمنون نصر الله له لأن كفر أكثرهم به كان عناداً أو استكباراً لا اعتقاداً ، وَلَكِنْ لِيَقْضِيَ اللَّهُ أَمْرًا كَانَ مَفْعُولا ، أي ولكن تلاقيتم هنالك على غير موعد ولا رغبة في القتال ليقضي الله أمراً كان ثابتاً في علمه وحكمته أنه واقع لابد منه وهو القتال المفضي الى خزيهم ونصركم عليهم وإظهار دينه وصدق وعده لرسوله كما تقدم.';
