const int sectionIndex = 2;
const String sectionTitle = 'الحضارات قبل البعثة';

const List t1 = ['1', 'الأمبراطورية الرومانية'];
const List t2 = ['2', 'الأمبراطورية الفارسية'];
const List t3 = ['3', 'اليهود'];
const List t4 = ['4', 'حضارة سبأ باليمن'];
const List t5 = ['5', 'حضارة عاد بالأحقاف'];
const List t6 = ['6', 'حضارة ثمود بالحجاز'];

const String p1 =
    'كانت الإمبراطورية الرومانية الشرقية تعرف بالإمبراطورية البيزنطية، فكانت تحكم دول اليونان والبلقان وآسيا وسوريا وفلسطين وحوض البحر المتوسط بأسره، ومصر وكل إفريقيا الشمالية، وكانت عاصمتها القسطنطينية، وكانت دولة ظالمة مارست الظلم والجور والتعسف على الشعوب التي حكمتها، وضاعفت عليها الضرائب، وكثرت الاضطرابات والثورات، وكانت حياتهم العامة قائمة على كل أنواع اللهو واللعب والطرب والترف ،أما مصر فكانت عرضة للاضطهاد الديني والاستبداد السياسي، واتخذها البيزنطيون شاة حلوبا يحسنون حلبها، ويسيئون علفها ، وأما سوريا فقد كثرت فيهم المظالم والرقيق، ولا يعتمدون في قيادة الشعب إلا على القوة والقهر الشديد، وكان الحكم حكم الغرباء، الذي لا يشعر بأي عطف على الشعب المحكوم، وكثيرا ما كان السوريون يبيعون أبناءهم ليوفوا ما كان عليهم من ديون.';
const String p2 =
    'كانت الإمبراطورية الفارسية تعرف بالدولة الفارسية أو الكسروية، وهي أكبر وأعظم من الإمبراطورية الرومانية الشرقية، وقد كثرت فيها الديانات المنحرفة كالزرادشتية والمانية التي أسسها ماني في أوائل القرن الثالث الميلادي، ثم ظهرت المزْدكية في أوائل القرن الخامس الميلادي التي دعت إلى الإباحية في كل شيء، مما أدى إلى انتشار ثورات الفلاحين وتزايد النهابين للقصور فكانوا يقبضون أو يأسرون النساء ويستولون على الأملاك والعقارات فأصبحت الأرض والمزارع والدور كأن لم تسكن من قبل.';
const String p3 =
    'كان المجتمع اليهودي قبل الإنتهاء يتدفق إلى الديانة بنفسه وفساد الذوق الديني ويند طالعت تلمود بابل الذي يبف في رواياته والتلميث بالحقائق والتلاعب بالدين والعقل غير المسيحية، فقد امتحنت بتحريف الغالين وتأويل الجاهلين وتوفى نور التوحيد وإخلاص العبادة واندلعت الحروب بين النصارى في الشام والعراق وبين نصارى مصر حول حقيقة المسيح وطبيعته وتحولت البيوت والمدارس والكنائس الى معسكرات متنافسة ووثيق الوثنية في مظاهر مختلفة وألوان مختلفة السبب.';
const String p4 =
    'وقد أشار القرآن الكريم إليها ففي اليمن استفادوا من مياه الأمطار والسيول التي كانت تضيع في الرمال وتنحدر الى البحار فأقاموا الخزانات والسدود بطرق هندسية متطورة، وأشهر هذه السدود سد مأرب واستفادوا بمياهها في الزروع المتنوعة والحدائق ذات الأشجار الزكية والثمار الشهية، قال عزَّ شأنه: لَقَدْ كَانَ لِسَبَإٍ فِي مَسْكَنِهِمْ آيَةٌ جَنَّتَانِ عَنْ يَمِينٍ وَشِمَالٍ كُلُوا مِنْ رِزْقِ رَبِّكُمْ وَاشْكُرُوا لَهُ بَلْدَةٌ طَيِّبَةٌ وَرَبٌّ غَفُورٌ فَأَعْرَضُوا فَأَرْسَلْنَا عَلَيْهِمْ سَيْلَ الْعَرِمِ وَبَدَّلْنَاهُمْ بِجَنَّتَيْهِمْ جَنَّتَيْنِ ذَوَاتَى أُكُلٍ خَمْطٍ وَأَثْلٍ وَشَيْءٍ مِنْ سِدْرٍ قَلِيلٍ ذَلِكَ جَزَيْنَاهُمْ بِمَا كَفَرُوا وَهَلْ نُجَازِي إِلاَّ الْكَفُورَ - سورة سبأ';
const String p5 =
    'ودل القرآن الكريم على وجود قرى متصلة في الزمن الماضي مابين اليمن الى بلاد الحجاز الى بلاد الشام، وأن قوافل التجارة والمسافرين كانوا يخرجون من اليمن الى بلاد الشام فلا يعدمون ظلاً ولا ماءً ولا طعاماً قال تعالى: وَجَعَلْنَا بَيْنَهُمْ وَبَيْنَ الْقُرَى الَّتِي بَارَكْنَا فِيهَا قُرًى ظَاهِرَةً وَقَدَّرْنَا فِيهَا السَّيْرَ سِيرُوا فِيهَا لَيَالِي وَأَيَّامًا آمِنِينَ فَقَالُوا رَبَّنَا بَاعِدْ بَيْنَ أَسْفَارِنَا وَظَلَمُوا أَنفُسَهُمْ فَجَعَلْنَاهُمْ أَحَادِيثَ وَمَزَّقْنَاهُمْ كُلَّ مُمَزَّقٍ إِنَّ فِي ذَلِكَ لآيَاتٍ لِكُلِّ صَبَّارٍ شَكُورٍ - سورة سبأ';
const String p6 =
    'وكان في شمال حضرموت وهم الذين ارسل الله إليهم نبي الله هود عليه السلام، وكانوا أصحاب بيوت مشيدة ومصانع متعددة وجنات وزروع وعيون قال تعالى: كَذَّبَتْ عَادٌ الْمُرْسَلِين إِذْ قَالَ لَهُمْ أَخُوهُمْ هُودٌ أَلاَ تَتَّقُونَ إِنِّي لَكُمْ رَسُولٌ أَمِينٌ فَاتَّقُوا اللَّهَ وَأَطِيعُونِي وَمَا أَسْأَلُكُمْ عَلَيْهِ مِنْ أَجْرٍ إِنْ أَجْرِي إِلاَّ عَلَى رَبِّ الْعَالَمِينَ أَتَبْنُونَ بِكُلِّ رِيعٍ آيَةً تَعْبَثُونَ وَتَتَّخِذُونَ مَصَانِعَ لَعَلَّكُمْ تَخْلُدُونَ وَإِذَا بَطَشْتُمْ بَطَشْتُمْ جَبَّارِينَ فَاتَّقُوا اللَّهَ وَأَطِيعُونِي وَاتَّقُوا الَّذِي أَمَدَّكُمْ بِمَا تَعْلَمُونَ أَمَدَّكُمْ بِأَنْعَامٍ وَبَنِينَ وَجَنَّاتٍ وَعُيُونٍ - سورة الشعراء';
const String p7 =
    'دل القرآن الكريم على وجود حضارة في بلاد الحِجْر وأشار الى ماكانوا يتمتعون به من القدرة على نحت البيوت في الجبال وعلى ماكان يوجد في بلادهم من عيون وبساتين وزروع قال تعالى: كَذَّبَتْ ثَمُودُ الْمُرْسَلِينَ إِذْ قَالَ لَهُمْ أَخُوهُمْ صَالِحٌ أَلاَ تَتَّقُونَ إِنِّي لَكُمْ رَسُولٌ أَمِينٌ فَاتَّقُوا اللَّهَ وَأَطِيعُونِي وَمَا أَسْأَلُكُمْ عَلَيْهِ مِنْ أَجْرٍ إِنْ أَجْرِي إِلاَّ عَلَى رَبِّ الْعَالَمِين أَتُتْرَكُونَ فِي مَا هَاهُنَا آمِنِينَ فِي جَنَّاتٍ وَعُيُونٍ وَزُرُوعٍ وَنَخْلٍ طَلْعُهَا هَضِيمٌ وَتَنْحِتُونَ مِنْ الْجِبَالِ بُيُوتًا فَارِهِين فَاتَّقُوا اللَّهَ وَأَطِيعُونِي - سورة الشعراء';

const String p8 =
    'لقد زال كل ذلك من زمن طويل ولم يبق إلا آثار ورسوم وأطلال فقد اضمحلت القرى والمدن وتخربت الدور والقصور ونضبت العيون وجفت الأشجار وأصبحت البساتين والزروع أرضاً جروزا .';
