const int sectionIndex = 68;
const String sectionTitle = 'غزوة تبوك - الإنفاق';

const List t1 = ['1', 'العسرة'];
const List t2 = ['2', 'موقع تبوك'];
const List t3 = ['3', 'جمع الروم'];
const List t4 = ['4', 'أنفاق عثمان بن عفان رضى الله عنه'];
const List t5 = ['5', 'أنفاق عمر رضى الله عنه'];
const List t6 = ['6', 'أنفاق الصحابة رضى الله عنهم'];
const List t7 = ['7', 'قول المنافقين'];
const List t8 = ['8', 'الفقراء'];
const List t9 = ['9', 'وأعينهم تفيض من الدمع'];

const String p1 =
    'خرج رسول الله ﷺ لهذه الغزوة في رجب من العام التاسع الهجري بعد العودة من حصار الطائف بنحو ستة أشهر.';
const String p2 =
    'واشتهرت هذه الغزوة باسم غزوة تبوك نسبة إلى مكان هو عين تبوك التي انتهى إليها الجيش الإسلامي، وأصل هذه التسمية جاء في صحيح مسلم فقد روي بسنده إلى معاذ أن رسول الله ﷺ قال: ستأتون غداً إن شاء الله عين تبوك وإنكم لن تأتوها حتى يضحى النهار فمن جاءها منكم فلا يمس من مائها شيئاً حتى آتي.';
const String p3 =
    'وللغزوة اسم آخر وهو غزوة العسرة وقد ورد هذا الاسم في القرآن الكريم حينما تحدث عن هذه الغزوة في سورة التوبة قال تعالى: لَقَدْ تَابَ اللَّهُ عَلَى النَّبِيِّ وَالْمُهَاجِرِينَ وَالأَنْصَارِ الَّذِينَ اتَّبَعُوهُ فِي سَاعَةِ الْعُسْرَةِ مِنْ بَعْدِ مَا كَادَ يَزِيغُ قُلُوبُ فَرِيقٍ مِنْهُمْ ثُمَّ تَابَ عَلَيْهِمْ إِنَّهُ بِهِمْ رَءُوفٌ رَحِيمٌ - سورة التوبة';
const String p4 =
    'لقد سميت بهذا الاسم لشدة مالاقى المسلمون فيها من الضنك، فقد كان الجو شديد الحرارة والمسافة بعيدة والسفر شاقاً لقلة المؤونة وقلة الدواب التي تحمل المجاهدين إلى أرض المعركة وقلة الماء في هذا السفر الطويل والحر الشديد، وكذلك قلة المال الذي يجهز به الجيش وينفق عليه، ففي تفسير عبدالرزاق عن معمر ابن عقيل قال: خرجوا في قلة من الظهر وفي حر شديد حتى كانوا ينحرون البعير فيشربون مافي كرشه من الماء فكان ذلك عسرة من الماء، وهذا الفاروق عمر بن الخطاب يحدثنا عن مدى مابلغ العطش من المسلمين فيقول: خرجنا مع رسول الله ﷺ إلى تبوك في قيظ شديد فنزلنا منزلاً أصابنا فيه عطش شديد حتى ظننا أن رقابنا ستنقطع، حتى إن كان إحدنا يذهب يلتمس الخلاء فلا يرجع حتى يظن أن رقبته تنقطع وحتى إن الرجل لينحر بعيره فيعصر فرشه فيشربه ويضعه على بطنه.';
const String p5 =
    'وللغزوة اسم ثالث هو الفاضحة ذكره الزرقاني رحمه الله في كتابه شرح المواهب اللدنية، وسميت بهذا الإسم لأن هذه الغزوة كشفت عن حقيقة المنافقين وهتكت أستارهم وفضحت أساليبهم العدائية الماكرة وأحقادهم الدفينة ونفوسهم الخبيثة وجرائمهم البشعة بحق رسول الله والمسلمين.';
const String p6 =
    'تقع تبوك شمال الحجاز يبعد عن المدينة 778 ميلاً حسب الطريق المعبدة في الوقت الحاضر، وكانت من ديار قضاعة الخاضعة لسلطان الروم آنذاك.';
const String p7 =
    'ذكر المؤرخون أسباب هذه الغزوة فقالوا: وصلت الأنباء للنبي ﷺ من الأنباط الذين يأتون بالزيت من الشام إلى المدينة، أن الروم جمعت جموعاً وأجلبت معهم لحم وجذام وغيرهم من مستنصرة العرب، وجاءت في مقدمتهم إلى البلقاء فأراد النبي ﷺ أن يغزوهم قبل أن يغزوه.';
const String p8 =
    'ويرى ابن كثير: إلى أن سبب الغزوة هو استجابة طبيعية لفريضة الجهاد ولذلك عزم رسول الله ﷺ على قتال الروم لأنهم أقرب الناس إليه وأولى الناس بالدعوة إلى الحق لقربهم إلى الإسلام وأهله قال تعالى: يَاأَيُّهَا الَّذِينَ ءَامَنُوا قَاتِلُوا الَّذِينَ يَلُونَكُمْ مِنَ الْكُفَّارِ وَلْيَجِدُوا فِيكُمْ غِلْظَةً وَاعْلَمُوا أَنَّ اللَّهَ مَعَ الْمُتَّقِينَ - سورة التوبة';
const String p9 =
    'والذي قاله ابن كثير هو الأقرب للصواب إضافة إلى أن الأمر الذي استقر عليه حكم الجهاد هو قتال المشركين كافة بما فيهم أهل الكتاب الذين وقفوا في طريق الدعوة وظهر تحرشهم بالمسلمين كما روى أهل السير.';
const String p10 =
    'ولا يمنع ماذكره المؤرخون بأن سبب الخروج هو عزم الروم على غزو المسلمين في عقر دارهم، أن يكون هذا حافزاً للخروج إليهم لأن أصل الخروج كان وارداً.';
const String p11 =
    'حث رسول الله ﷺ الصحابة على الإنفاق في هذه الغزوة لبعدها وكثرة المشركين فيها، ووعد المنفقين بالأجر العظيم من الله فأنفق كل حسب مقدرته، وكان عثمان رضي الله عنها صاحب القدح المعلى في الإنفاق في هذه الغزوة، فهذا عبدالرحمن بن حُباب يحدثنا عن نفقة عثمان حيث قال: شهدت النبي ﷺ وهو يحث على جيش العسرة، فقام عثمان بن عفان فقال: يارسول الله عليَّ مائة بعير بأحلاسها وأقتابها في سبيل الله ثم حضّ على الجيش، فقام عثمان بن عفان فقال: يارسول الله عليَّ مائتا بعير بأحلاسها وأقتابها في سبيل الله ثم حض على الجيش، فقام عثمان بن عفان فقال: يارسول الله عليّ ثلثمائة بعير بأحلاسها وأقتابها في سبيل الله، فأنا رأيت رسول الله ينزل عن المنبر وهو يقول: ما على عثمان ماعمل بعد هذه ما على عثمان ماعمل بعد هذه، وعن عبدالرحمن بن سمرة رضي الله عنهما قال: جاء عثمان بن عفان إلى النبي ﷺ بألف دينار في ثوبه، حين جهز النبي ﷺ جيش العسرة قال: فجعل النبي ﷺ يقلبها بيده ويقول: ماضرّ ابن عفان ماعمل بعد اليوم يرددها مراراً.';
const String p12 =
    'وأما عمر فقد تصدق بنصف ماله وظن أنه سيسبق أبا بكر بذلك، وهذا الفاروق يحدثنا بنفسه عن ذلك حيث قال: أمرنا رسول الله ﷺ يوماً أن نتصدق فوافق ذلك مالا عندي فقلت اليوم أسبق أبا بكر إن سبقته يوما فجئت بنصف مالي، فقال رسول الله ﷺ : ما أبقيت لأهلك؟ قلت: مثله قال: وأتى أبو بكر رضي الله عنه بكل ماعنده، فقال له رسول الله ﷺ : ما أبقيت لأهلك؟ قال: أبقيت لهم الله ورسوله قلت: لا أسابقك إلى شيء أبداً.';
const String p13 =
    'وروي أن عبدالرحمن بن عوف أنفق ألفي درهم وهي نصف أمواله لتجهيز جيش العسرة.';
const String p14 =
    'وكانت لبعض الصحابة نفقات عظيمة كالعباس بن عبدالمطلب وطلحة بن عبيدالله ومحمد بن مسلمة وعاصم بن عدي رضي الله عنهم.';
const String p15 =
    'وهكذا يفهم المسلمون أن المال وسيلة واستطاع أغنياء الصحابة أن يبرهنوا أن مالهم في خدمة هذا الدين يدفعونه عن طواعية ورغبة، وإن تاريخ الأغنياء المسلمين تاريخ مشرف لأنه تاريخ المال في يد الرجال لا تاريخ الرجال تحت سيطرة المال وكما كان الجهاد بالنفس فكذلك هو بالمال، وإن الذين ربوا على أن يقدموا أنفسهم تهون عليهم أموالهم في سبيل الله تعالى.';
const String p16 =
    'إن في مسارعة الموسرين من الصحابة إلى البذل والإنفاق دليلاً على مايفعله الإيمان في نفوس المؤمنين من مسارعة إلى فعل الخير ومقاومة لأهواء النفس وغرائزها، مما تحتاج إليه كل أمة لضمان النصر على أعدائها وخير مايفعله المصلحون وزعماء النهضات هو غرس الدين في نفوس الناس غرساً كريماً.';
const String p17 =
    'ولم يسلم المؤمنون من قول المنافقين فقد قالوا ما أعطى بن عوف هذا إلا رياء وكانوا يتهمون الأغنياء بالرياء ويسخرون من صدقة الفقراء الذين قدموا النفقة على استحياء، فقد جاء أبو عُقيل بنصف صاع تمر وجاء آخر بأكثر منه فلمزوها قائلين: إن الله لغني عن صدقة هذا فنزلت الاية : الَّذِينَ يَلْمِزُونَ الْمُطَّوِّعِينَ مِنَ الْمُؤْمِنِينَ فِي الصَّدَقَاتِ وَالَّذِينَ لَا يَجِدُونَ إِلَّا جُهْدَهُمْ فَيَسْخَرُونَ مِنْهُمْ سَخِرَ اللَّهُ مِنْهُمْ وَلَهُمْ عَذَابٌ أَلِيمٌ - سورة التوبة';
const String p18 =
    'لقد حزن الفقراء من المؤمنين لأنهم لايملكون نفقة الخروج إلى الجهاد، فهذا عُلَبَة بن زيد أحد البكائين صلى من الليل وبكى وقال: اللهم إنك قد أمرت بالجهاد ورغبت فيه ولم تجعل عندي ما أتقوى به مع رسولك وإني أتصدق على كل مسلم بكل مظلمة أصابتني بها في جسد أو عرض، فأخبره النبي ﷺ أنه قد غفر له.';
const String p19 =
    'وفي هذه القصة وماجرى فيها آيات من الإخلاص وحب الجهاد لنصرة دين الله وبثّ دعوته في الآفاق، وفيها من لطف الله بضعفاء المؤمنين الذين يعيشون في حياتهم عيشة عملية.';
const String p20 =
    'وهذا واثلة بن الأسقع نتركه يحدثنا عن قصته: ... عندما نادى رسول الله في غزوة تبوك خرجت إلى أهلي فأقبلت -وقد خرج أول صحابة رسول الله- فطفقت في المدينة أنادي: ألا من يحمل رجلاً له سهمه، فإذا شيخ من الأنصار فقال: لنا سهمه على أن نحمله عقبة -أي بالتعاقب- وطعامه معنا؟ فقلت: نعم، قال فسر على بركة الله فخرجت مع خير صاحب، حتى أفاء الله علينا فأصابني قلائص فسقتهن حتى أتيته فخرج فقعد على حقيبة من حقائب إبله ثم قال: سقهن مدبرات ثم قال: سقهن مقبلات، فقال: ماأرى قلائصك إلا كراماً: إنما هي غنيمتك التي شرطت لك قال: خذ قلائصك -أى الإبل- يا ابن أخي فغير سهمك أردنا.';
const String p21 =
    'وهكذا تنازل واثلة في بداية الأمر عن غنيمته ليكسب الغنيمة الأخروية أجراً وثواباً يجده عند الله يوم لقائه، وتنازل الأنصاري عن قسم كبير من راحته ليتعاقب وواثلة على راحلته ويقدم له الطعام مقابل سهم آخر هو الأجر والثواب.';
const String p22 =
    'إنها مفاهيم تنبع من المجتمع الذي تربى على كتاب الله وسنة رسوله لها نفس الخاصية في الإضاءة وتحمل نفس البريق متمم بعضها لبعضها الآخر.';
const String p23 =
    'وجاء الأشعريون يتقدمهم أبو موسى الأشعري يطلبون من النبي ﷺ أن يحملهم على إبل ليتمكنوا من الخروج للجهاد فلم يجد مايحملهم عليه حتى مضى بعض الوقت فحصل لهم على ثلاثة من الإبل.';
const String p24 =
    'وبلغ الأمر بالضعفاء والعجزة ممن أقعدهم المرض أو النفقة عن الخروج إلى حد البكاء شوقاً للجهاد وتحرجاً من القعود، حتى نزل فيهم قرآن: لَيْسَ عَلَى الضُّعَفَاءِ وَلا عَلَى الْمَرْضَى وَلا عَلَى الَّذِينَ لا يَجِدُونَ مَا يُنْفِقُونَ حَرَجٌ إِذَا نَصَحُوا لِلَّهِ وَرَسُولِهِ مَا عَلَى الْمُحْسِنِينَ مِنْ سَبِيلٍ وَاللَّهُ غَفُورٌ رَحِيمٌ وَلا عَلَى الَّذِينَ إِذَا مَا أَتَوْكَ لِتَحْمِلَهُمْ قُلْتَ لا أَجِدُ مَا أَحْمِلُكُمْ عَلَيْهِ تَوَلَّوْا وَأَعْيُنُهُمْ تَفِيضُ مِنَ الدَّمْعِ حَزَنًا أَلا يَجِدُوا مَا يُنْفِقُونَ - سورة التوبة';
const String p25 =
    'إنها صورة مؤثرة للرغبة الصحيحة في الجهاد على عهد رسول الله وما كان يحسه صادقو الإيمان من ألم إذا ماحالت ظروفهم المادية بينهم وبين القيام بواجباته، وكان هؤلاء المعوزون وغيرهم ممن عذر الله لمرض أو كبر سن أو غيره يسيرون بقلوبهم مع المجاهدين وهم الذين عناهم رسول الله ﷺ عندما قال: إن بالمدينة أقواماً ماسرتم مسيراً ولاقطعتم وادياً إلا كانوا معكم، قالوا: يارسول الله وهم بالمدينة؟ قال: وهم بالمدينة حبسهم العذر.';
