const int sectionIndex = 41;
const String sectionTitle = 'غزوة بني النضير';

const List t1 = ['1', 'إجلاء يهود بني النضير'];
const List t2 = ['2', 'تاريخ الغزوة'];
const List t3 = ['3', 'نقض العهد'];
const List t4 = ['4', 'محاولة اغتيال النبي ﷺ'];
const List t5 = ['5', 'إنذار بني النضير'];
const List t6 = ['6', 'ضرب الحصار عليهم'];
const List t7 = ['7', 'إجلائهم'];
const List t8 = ['8', 'سورة بني النضير'];
const List t9 = ['9', 'الرعب جند من جنود الله'];
const List t10 = ['10', 'تخريب ممتلكات الأعداء'];
const List t11 = ['11', 'تطوير السياسة المالية للدولة الإسلامية'];
const List t12 = ['12', 'عدل تقسيم الغنائم'];
const List t13 = ['13', 'فضل المهاجرين والأنصار'];
const List t14 = ['14', 'موقف المنافقين في المدينة'];
const List t15 = ['15', 'لأَنتُم أَشد رَهبَة'];
const List t16 = ['16', 'تحريم الخمر'];
const List t17 = ['17', 'لايحيق المكر السئ إلا بأهله'];

const String p1 =
    'أصاب يهود المدينة الخوف والرعب طيلة الفترة التي تفصل بين مقتل كعب بن الأشرف وبين معركة أحد التي جرت في شوال عام 3هـ، ولكن الهزيمة التي حلت بالمسلمين في تلك المعركة أحيت في نفوس المشركين والمنافقين الأمل من جديد، بتحقيق مطامعهم وأغراضهم وأزالت من قلوب اليهود الهلع على المصير ومما ساهم في تبديد هذا الهلع عندهم مقتل أصحاب الرجيع وبئر معونة وبذلك لم يدم خوف اليهود طويلاً وعادوا إلى أساليب الدس والمكر والخداع، وشرعوا في حشد حصونهم بالسلاح والعتاد للانقضاض على المسلمين ودولتهم ثم صمّموا على قتل النبي ﷺ والغدر به.';
const String p2 =
    'يرى المحققون من المؤرخين أن غزوة بني النضير كانت بعد أحد في ربيع الأول من السنة الرابعة من الهجرة وقد رد ابن القيم على من زعم أن غزوة بني النضير بعد بدر بستة أشهر.';
const String p3 =
    'نقض بنو النضير عهودهم التي تحتم علهيم ألا يؤوا عدواً للمسلمين ولم يكتفوا بهذا النقض بل أرشدوا الأعداء إلى مواطن الضعف في المدينة. وقد حصل ذلك في غزوة السويق حيث نذر أبو سفيان بن حرب حين رجع إلى مكة بعد غزوة بدر نذر ألا يمس رأسه ماء من جنابة حتى يغزو المدينة فلما خرج في مائتي راكب قاصداً المدينة قام سيد بني النضير سلام بن مشكم بالوقوف معه وإضافته وبطن له خبر الناس ولم تكن مخابرات المدينة غافلة عن ذلك.';
const String p4 =
    'خرج النبي ﷺ في نفر من أصحابه عن طريق قباء إلى ديار بني النضير يستعينهم في دية القتيلين العامرييّن اللذين ذهبا ضحية جهل عمرو بن أمية الضمري بجوار رسول الله ﷺ لهما وذلك تنفيذاً للعهد الذي كان بين النبي ﷺ وبين بني النضير حول أداء الدّيات، وإقراراً لما كان يقوم بين بني النضر وبين بني عامر من عقود وأحلاف، واستقبل بنو النضير النبي ﷺ بكثير من البشاشة والكياسة، ثم خلا بعضهم إلى بعض يتشاورون في قتله والغدر به، ويبدو أنهم اتفقوا على إلقاء صخرة عليه ﷺ من فوق جدار كان يجلس بالقرب منه، ولكن الرسول ﷺ الذي كان برعاية الله وحفظه أدرك مقاصد بني النضير، إذ جاءه الخبر من السماء بما عزموا عليه من شر فنهض وانطلق بسرعة إلى المدينة ثم تبعه أصحابه بعد قليل.';
const String p5 =
    'وقد ذكر القرآن الكريم المؤمنين بهذه النعمة الجليلة وكيف نجى الله نبيه ﷺ من مكر يهود بني النضير قال تعالى: يَاأَيُّهَا الَّذِينَ ءَامَنُوا اذْكُرُوا نِعْمَةَ اللَّهِ عَلَيْكُمْ إِذْ هَمَّ قَوْمٌ أَنْ يَبْسُطُوا إِلَيْكُمْ أَيْدِيَهُمْ فَكَفَّ أَيْدِيَهُمْ عَنْكُمْ وَاتَّقُوا اللَّهَ وَعَلَى اللَّهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُونَ - سورة المائدة';
const String p6 =
    'سجلت معظم كتب السيرة النبوية خبر إنذار النبي ﷺ لبني النضير بالجلاء خلال عشرة أيام، وقد أرسل ﷺ محمد بن مسلمة إليهم وقال له: اذهب إلى يهود بني النضير وقل لهم: إن رسول الله ﷺ أرسلني إليكم أن أخرجوا من بلادي لقد نقضتم العهد الذي جعلت لكم مما هممتم به من الغدر، وقد أجلتكم عشراً فمن رئي بعد منكم ضربت عنقه ولم يجدوا جواباً يردون به، سوى أن قالوا لمحمد بن مسلمة: يامحمد ماكنا نظن أن يجيئنا بهذا رجل من الأوس فقال محمد: تغيرت القلوب ومحا الإسلام العهود فقالوا: نتحمل فمكثوا أياماً يعدون العدة للرحيل.';
const String p7 =
    'وفي تلك المدة أرسل إليهم عبدالله بن أبي سلول من يقول لهم: اثبتوا وتمنعوا فإنا لن نسلمكم وإن قوتلتم قاتلنا معكم وإن أخرجتم خرجنا معكم.';
const String p8 =
    'وانقضت الأيام العشرة ولم يخرجوا من ديارهم فتحركت جيوش المسلمين صوبهم وضربت عليهم الحصار لمدة خمس عشرة ليلة.';
const String p9 =
    'وأمر ﷺ بحرق نخيلهم وقضى بذلك على أسباب تعلقهم بأموالهم وزروعهم وضعفت حماستهم للقتال وجزعوا وتصايحوا: يامحمد قد كنت تنهى عن الفساد وتعيبه على من يفعله فما بال قطع النخيل وتخريبها؟ وألقى الله في قلوبهم الرعب، وأدرك بنو النضير أن لامفر من جلائهم ودب اليأس في قلوبهم وخاصة بعد أن أخلف ابن أبي وعده بنصرهم، وعجز إخوانهم أن يسوقوا إليهم خيراً أو يدفعوا عنهم شراً فأرسلوا إلى النبي ﷺ يلتمسون منه أن يؤمنهم حتى يخرجوا من ديارهم.';
const String p10 =
    'فوافقهم النبي ﷺ على ذلك وقال لهم: اخرجوا منها و لكم دماؤكم وماحملت الإبل إلا الحلقة -وهي الدروع والسلاح– فرضوا بذلك ونقض اليهود سقف بيوتهم وعمدها وجدرانها لكي لاينتفع منها المسلمون.';
const String p11 =
    'وحملوا معهم كميات كبيرة من الذهب والفضة حتى أن سلام بن أبي الحقيق وحده حمل جلد ثور مملوء ذهباً وفضة وكان يقول هذا الذي أعددناه لرفع الأرض وخفضها وإن كنا تركنا نخلا ففي خيبر النخل، وحملوا أمتعتهم على ستمائة بعير وخرجوا ومعهم الدفوف والمزامير والقيان يعزفن من خلفهم حتى لايشمت بهم المسلمون، فقصد بعضهم خيبر وسار آخرون إلى أذرعات الشام.';
const String p12 =
    'تحدث القرآن الكريم عن غزوة بني النضير في سورة كاملة وهي سورة الحشر، وقد سمى حبر الأمة عبدالله بن عباس رضي الله عنهما سورة الحشر بسورة بني النضير ففي البخاري عن سعيد بن جبير قال: قلت لابن عباس رضي الله عنهما سورة الحشر قال: سورة بني النضير.';
const String p13 =
    'قال تعالى: هُوَ الَّذِي أَخْرَجَ الَّذِينَ كَفَرُوا مِنْ أَهْلِ الْكِتَابِ مِنْ دِيَارِهِمْ لأَوَّلِ الْحَشْرِ مَا ظَنَنْتُمْ أَنْ يَخْرُجُوا وَظَنُّوا أَنَّهُمْ مَانِعَتُهُمْ حُصُونُهُمْ مِنَ اللَّهِ فَأَتَاهُمُ اللَّهُ مِنْ حَيْثُ لَمْ يَحْتَسِبُوا وَقَذَفَ فِي قُلُوبِهِمُ الرُّعْبَ يُخْرِبُونَ بُيُوتَهُمْ بِأَيْدِيهِمْ وَأَيْدِي الْمُؤْمِنِينَ فَاعْتَبِرُوا يَاأُولِي الأَبْصَار وَلَوْلا أَنْ كَتَبَ اللَّهُ عَلَيْهِمُ الْجَلاءَ لَعَذَّبَهُمْ فِي الدُّنْيَا وَلَهُمْ فِي الآخِرَةِ عَذَابُ النَّار ذَلِكَ بِأَنَّهُمْ شَاقُّوا اللَّهَ وَرَسُولَهُ وَمَنْ يُشَاقِّ اللَّهَ فَإِنَّ اللَّهَ شَدِيدُ الْعِقَابِ - سورة الحشر';
const String p14 =
    'إن المتأمل في هذه الآيات الكريمة يتبين له أن الله هو الذي أخرج يهود بني النضير من ديارهم الى الشام حيث أول الحشرهم في حين أن كل الأسباب المادية معهم حتى اعتقدوا أنه لا أحد يستطيع أن يخرجهم من حصونهم لمتانتها وقوتها، لكن الله خالف الأسباب والمسببات جاءهم من حيث لم يحتسبوا جاءهم من قلوبهم التي لم يتوقعوا أنهم يهزمون بها فقذف فيها الرعب فإذا بهم يهدمون بيوتهم بأيديهم وأيدي المؤمنين.';
const String p15 =
    'لما نزل رسول الله ﷺ بجيشه وحاصر بني النضير تحصنوا منه في الحصون، فأمر رسول الله ﷺ بقطع النخل والتحريق فيها، فنادوه يامحمد قد كنت تنهى عن الفساد وتعيبه على من صنعه فما بال قطع النخل وتحريقها؟ فأنزل الله عزوجل: ما قَطَعْتُمْ مِنْ لِينَةٍ أَوْ تَرَكْتُمُوهَا قَائِمَةً عَلَى أُصُولِهَا فَبِإِذْنِ اللَّهِ وَلِيُخْزِيَ الْفَاسِقِينَ.';
const String p16 =
    'بين سبحانه وتعالى حكم الأموال التي أخذها المسلمون من بني النضير بعد أن تم إجلاؤهم فقال تعالى: وَمَا أَفَاءَ اللَّهُ عَلَى رَسُولِهِ مِنْهُمْ فَمَا أَوْجَفْتُمْ عَلَيْهِ مِنْ خَيْلٍ وَلا رِكَابٍ وَلَكِنَّ اللَّهَ يُسَلِّطُ رُسُلَهُ عَلَى مَنْ يَشَاءُ وَاللَّهُ عَلَى كُلِّ شَيْءٍ قَدِيرٌ - سورة الحشر';
const String p17 =
    'وبين سبحانه وتعالى أن الأموال التي عادت إلى المسلمين من بني النضير قد تفضل بها عليهم بدون قتال شديد، وذلك لأن المسلمين مشوا إلى أعدائهم ولم يركبوا خيلاً ولا إبلاً وافتتحها ﷺ صلحاً وأجلاهم وأخذ أموالهم ووضعها حيث أمره الله، فقد كانت أموال بني النضير للنبي ﷺ خاصة، فكان ينفق على أهله منها نفقة سنة ثم يجعل مابقي في السلاح والكراع عدة في سبيل الله.';
const String p18 =
    'ولما غنم ﷺ أموال بني النضير دعا ثابت بن قيس فقال: ادع لي قومك قال ثابت: الخزرج؟ فقال ﷺ : الأنصار كلها فدعا له الأوس والخزرج: فحمد الله وأثنى عليه بما هو أهله، ثم ذكر الأنصار وما صنعوا بالمهاجرين وإنزالهم إياهم في منازلهم وأموالهم، وأثرتهم على أنفسهم ثم قال: إن أحببتم قسمت بينكم وبين المهاجرين ما أفاء الله عليَّ من بني النضير، وكان المهاجرون على ماهم عليه من السكنى في منازلكم وأموالكم وإن أجبتم أعطيتهم وخرجوا من دوركم.';
const String p19 =
    'فقال سعد بن عبادة وسعد بن معاذ: يارسول الله بل نقسم بين المهاجرين ويكونون في دورنا كما كانوا وقالت الأنصار: رضينا وسلمنا يارسول الله، وقسم ما أفاء الله وأعطى المهاجرين ولم يعط أحداً من الأنصار شيئاً، غير أبي دجانة وسهل بن حنيف لحاجتهما، ومع أنه ﷺ يعلم أن الفئ كان خاص له إلا أنه جمع الأنصار وسألهم عن قسمة الأموال لتطييب نفوسهم وهذا من الهدي النبوي الكريم في سياسة الأمور.';
const String p20 =
    'وكانت الغاية من هذا التوزيع تخفيف العبء عن الأنصار وهكذا انتقل المهاجرون إلى دور بني النضير، وأعيدت دور الأنصار إلى أصحابها واستغنى بعض المهاجرين مما يمكن أن يقال فيه إن الأزمة قد بدأت بالانفراج.';
const String p21 =
    'بينت الآيات الكريمة فضل المهاجرين على غيرهم، فهم لهم الدرجة الأولى، قال تعالى: لِلْفُقَرَاءِ الْمُهَاجِرِينَ الَّذِينَ أُخْرِجُوا مِنْ دِيارِهِمْ وَأَمْوَالِهِمْ يَبْتَغُونَ فَضْلا مِنَ اللَّهِ وَرِضْوَانًا وَيَنْصُرُونَ اللَّهَ وَرَسُولَهُ أُولَئِكَ هُمُ الصَّادِقُونَ - سورة الحشر. وكذلك فضل الأنصار وقد وصفهم الله بهذه الصفات قال تعالى: وَالَّذِينَ تَبَوَّءُوا الدَّارَ وَالإِيمَانَ مِنْ قَبْلِهِمْ يُحِبُّونَ مَنْ هَاجَرَ إِلَيْهِمْ وَلا يَجِدُونَ فِي صُدُورِهِمْ حَاجَةً مِمَّا أُوتُوا وَيُؤْثِرُونَ عَلَى أَنْفُسِهِمْ وَلَوْ كَانَ بِهِمْ خَصَاصَةٌ وَمَنْ يُوقَ شُحَّ نَفْسِهِ فَأُولَئِكَ هُمُ الْمُفْلِحُونَ - سورة الحشر ،والتابعين لهم بإحسان: هم المتتبعون لآثارهم الحسنة وأوصافهم الجميلة الداعون في السر والعلانية لإخوانهم الذين سبقوهم بالإيمان قال تعالى: وَالَّذِينَ جَاءُوا مِنْ بَعْدِهِمْ يَقُولُونَ رَبَّنَا اغْفِرْ لَنَا وَلإِخْوَانِنَا الَّذِينَ سَبَقُونَا بِالإِيمَانِ وَلا تَجْعَلْ فِي قُلُوبِنَا غِلا لِلَّذِينَ ءَامَنُوا رَبَّنَا إِنَّكَ رَءُوفٌ رَحِيمٌ - سورة الحشر';
const String p22 =
    'بينت الآيات الكريمة حالة المنافقين ووضحت موقفهم وتحالفهم مع إخوانهم من اليهود، وكشفت أيضاً موقفهم من المسلمين، وموقف اليهود ونفسياتهم قال تعالى: أَلَمْ تَر إِلَى الَّذِينَ نَافَقُوا يَقُولُونَ لإِخْوَانِهِمُ الَّذِينَ كَفَرُوا مِنْ أَهْلِ الْكِتَابِ لَئِنْ أُخْرِجْتُمْ لَنَخْرُجَنَّ مَعَكُمْ وَلا نُطِيعُ فِيكُمْ أَحَدًا أَبَدًا وَإِنْ قُوتِلْتُمْ لَنَنْصُرَنَّكُمْ وَاللَّهُ يَشْهَدُ إِنَّهُمْ لَكَاذِبُونَ لَئِنْ أُخْرِجُوا لا يَخْرُجُونَ مَعَهُمْ وَلَئِنْ قُوتِلُوا لا يَنْصُرُونَهُمْ وَلَئِنْ نَصَرُوهُمْ لَيُوَلُّنَّ الأَدْبَارَ ثُمَّ لا يُنْصَرُونَ لأَنْتُمْ أَشَدُّ رَهْبَةً فِي صُدُورِهِمْ مِنَ اللَّهِ ذَلِكَ بِأَنَّهُمْ قَوْمٌ لا يَفْقَهُونَ لا يُقَاتِلُونَكُمْ جَمِيعًا إِلا فِي قُرًى مُحَصَّنَةٍ أَوْ مِنْ وَرَاءِ جُدُرٍ بَأْسُهُمْ بَيْنَهُمْ شَدِيدٌ تَحْسَبُهُمْ جَمِيعًا وَقُلُوبُهُمْ شَتَّى ذَلِكَ بِأَنَّهُمْ قَوْمٌ لا يَعْقِلُونَ كَمَثَلِ الَّذِينَ مِنْ قَبْلِهِمْ قَرِيبًا ذَاقُوا وَبَالَ أَمْرِهِمْ وَلَهُمْ عَذَابٌ أَلِيمٌ كَمَثَلِ الشَّيْطَانِ إِذْ قَالَ لِلإِنْسَانِ اكْفُرْ فَلَمَّا كَفَرَ قَالَ إِنِّي بَرِيءٌ مِنْكَ إِنِّي أَخَافُ اللَّهَ رَبَّ الْعَالَمِينَ فَكَانَ عَاقِبَتَهُمَا أَنَّهُمَا فِي النَّارِ خَالِدَيْنِ فِيهَا وَذَلِكَ جَزَاءُ الظَّالِمِينَ - سورة الحشر';
const String p23 =
    'يخبرنا المولى عزوجل عن المنافقين كعبدالله بن أبي بن سلول وأضرابه حين بعثوا إلى يهود بني النضير يعدونهم بمناصرتهم، وقوله لإخوانهم اي الذين بينهم وبينهم أخوة الكفروهم يهود بني النضير، وجعلهم إخواناً له لكون الكفر قد جمعهم وإن اختلف نوع كفرهم فهم إخوان في الكفر، لئن أخرجتم اي والله لئن أخرجتم من دياركم لنخرجن معكم من ديارنا في صحبتكم ولانطيع فيكم اي في شأنكم ومن أجلكم، أحداً ممن يريد أن يمنعنا من الخروج معكم وإن طال الزمان ثم لما وعدوهم بالخروج معهم وعدوهم بالنصرة لهم فقالوا: وإن قوتلتم اي وإن قاتلكم المسلمون لننصرنكم اي على المسلمين الذين يقاتلونكم ثم كذبهم الله تعالى فقال وَاللَّهُ يَشْهَدُ إِنَّهُمْ لَكَاذِبُونَ فيما وعدوهم به من الخروج ولما أجمل سبحانه وتعالى كذب المنافقين فيما وعدوا به بني النضير، فصّل ماكذبوا فيه وزاد في تأكيد الرد عليهم فقال تعالى: لَئِنْ أُخْرِجُوا لا يَخْرُجُونَ مَعَهُمْ اي لئن أخرج المسلمون اليهود فإن المنافقين لن يخرجوا معهم.';
const String p24 =
    'ثم قرر القرآن الكريم حقيقة قائمة في نفوس اليهود والمنافقين قال تعالى: لأَنْتُمْ أَشَدُّ رَهْبَةً فِي صُدُورِهِمْ مِنَ اللَّهِ ذَلِكَ بِأَنَّهُمْ قَوْمٌ لا يَفْقَهُونَ ،أي لأنتم يامعشر المسلمين أشد خوفاً وخشية في صدور اليهود والمنافقين من الله تعالى، فهم يخافونكم أكثر من خوفهم من الله تعالى وهذه الحال منهم بِأَنَّهُمْ قَوْمٌ لا يَفْقَهُونَ اي لايعلمون الله وعظمته حتى يخشوه حق خشيته ثم أكد سبحانه وتعالى هذه الحقيقة بصفات أخرى فيهم، فقال تعالى: لا يُقَاتِلُونَكُمْ جَمِيعًا إِلا فِي قُرًى مُحَصَّنَةٍ أَوْ مِنْ وَرَاءِ جُدُرٍ ،فقد كشف سبحانه وتعالى عن حقائق نفسية اليهود فهم جبناء لايستطيعون أن يواجهوا المسلمين في مواطن مكشوفة بل لا يقاتلون إلا من وراء قراهم المحصنة بالخنادق وجدرانهم وحوائطهم التي يتسترون من خلفها.';
const String p25 =
    'ثم كشف القرآن عن بعض أسباب ضعفهم وخورهم فقال تعالى: بَأْسُهُمْ بَيْنَهُمْ شَدِيدٌ تَحْسَبُهُمْ جَمِيعًا وَقُلُوبُهُمْ شَتَّى ذَلِكَ بِأَنَّهُمْ قَوْمٌ لا يَعْقِلُونَ ، فهؤلاء اليهود في الظاهر تراهم مجتمعين صفاً واحداً ضد المسلمين لكن الآية تبين أنهم عكس ذلك في الحقيقة فهم بأسهم بينهم شديد، أي: عداوتهم بعضهم لبعض شديدة تحسبهم جميعاً أي: تظنهم مجتمعين على أمر ورأي ولكنهم في الحقيقة قلوبهم شتى أي متفرقة.';
const String p26 =
    'حرمت الخمر ليالي حصار بني النضير في ربيع الأول من السنة الرابعة من الهجرة، وقد خضع تحريم الخمر لسنة التدرج وكان ذلك التحريم على مراحل معروفة في تاريخ التشريع الإسلامي حتى نزلت الآيات الحاسمة في النهي عنها من سورة المائدة وفي ختامها فَهَلْ أَنْتُمْ مُنْتَهُونَ - سورة المائدة ، فقال المؤمنون في قوة وتصميم قد انتهينا يارب.';
const String p27 =
    'كان مكر اليهود وتآمرهم على حياة الرسول ﷺ والدولة الإسلامية في غاية الخسة والوضاعة، وكانوا يريدون من مكرهم وغدرهم عزة ورفعة ومجداً وغلبة لكن الله سخر منهم، ونجى رسوله والمسلمين من مكرهم وأذلهم وأخزاهم فزال مجدهم وكسر غلبتهم وخرب بيوتهم ورحّلهم عن ديارهم ولم يكلف ذلك المسلمين اصطداماً مسلحاً ولاقتالاً ضارياً، ولكن الله قذف في قلوبهم الرعب والفزع، فطلبوا النجاة بأرواحهم في ذلة وخزي مخلفين وراءهم ثروة وملكاً حازه المسلمون غنيمة باردة وقد قال تعالى في شأنهم: هُوَ الَّذِي أَخْرَجَ الَّذِينَ كَفَرُوا مِنْ أَهْلِ الْكِتَابِ مِنْ دِيَارِهِمْ لأَوَّلِ الْحَشْرِ مَا ظَنَنْتُمْ أَنْ يَخْرُجُوا وَظَنُّوا أَنَّهُمْ مَانِعَتُهُمْ حُصُونُهُمْ مِنَ اللَّهِ فَأَتَاهُمُ اللَّهُ مِنْ حَيْثُ لَمْ يَحْتَسِبُوا وَقَذَفَ فِي قُلُوبِهِمُ الرُّعْبَ يُخْرِبُونَ بُيُوتَهُمْ بِأَيْدِيهِمْ وَأَيْدِي الْمُؤْمِنِينَ فَاعْتَبِرُوا يَاأُولِي الأَبْصَارِ - سورة الحشر';
const String p28 =
    'أن الذي يقف في وجه الحق ويصد الناس عنه ويطارد دعاة الحق منهزم لامحالة، قال تعالى: قُلْ لِلَّذِينَ كَفَرُوا سَتُغْلَبُونَ وَتُحْشَرُونَ إِلَى جَهَنَّمَ وَبِئْسَ الْمِهَادُ - سورة آل عمران';
const String p29 =
    'والصراع بين الحق والباطل لايتوقف وباق حتى يرث الله الأرض وماعليها، وستكون للباطل جولات وللحق جولات ولكن العاقبة لأهل الحق في نهاية المطاف والاعتبار يكون بتجنب ما ارتكبه اليهود من خيانة وغدر حتى لايحدث نفس المصير الذي حدث لهم من الهزيمة والذل والهوان.';
