const int sectionIndex = 40;
const String sectionTitle = 'فاجعة بئر معونة';

const List t1 = ['1', 'طمع عامر بن الطفيل'];
const List t2 = ['2', 'عند بئر معونة'];
const List t3 = ['3', 'لابد للدعوة من تضحيات'];
const List t4 = ['4', 'القنوت فى صلاة الفجر'];
const List t5 = ['5', 'فزت ورب الكعبة'];
const List t6 = ['6', 'فضل الشهيد'];
const List t7 = ['7', 'عدم معرفة النبي ﷺ للغيب'];
const List t8 = ['8', 'الوفاء بالعهد'];
const List t9 = ['9', 'شعر حسان بن ثابت رضي الله عنه'];
const List t10 = ['10', 'مصير عامر بن الطفيل العامري'];

const String p1 =
    'عامر بن الطفيل زعيم من زعماء بني عامر كان متكبراً متغطرساً، طامعاً في الملك وكان يرأى أن النبي ﷺ سوف تكون له الغلبة على الجزيرة العربية ولذلك جاء هذا المشرك إلى النبي ﷺ وقال له: أخيرك بين ثلاث خصال: أن يكون لك السهل ولي أهل المدر، أو أن أكون خليفتك من بعدك أو أغزوك بغطفان بألف أشقر وألف شقراء، فرفض ﷺ تلك المطالب الجاهلية وجاء إلى المدينة ملاعب الأسنة سيد بني عامر عمّ عامر بن الطفيل وقدّم إلى النبي ﷺ هدية، فعرض عليه النبي ﷺ الإسلام فأبى أن يسلم، فقال النبي ﷺ فإني لا أقبل هدية من مشرك، فقال ملاعب الأسنة: فابعث إلى أهل نجد من شئت فأنا لهم جار، فبعث إليهم بقوم فيهم المنذر بن عمرو، وهو الذي يقال له –المعتق ليموت– أو أعتق الموت -فاستجاش- اى طلب لهم الجيش وجمعه - عليهم عامر بن الطفيل بني عامر فأبوا أن يطيعوه، وأبوا أن يخفروا ملاعب الأسنة، فاستجاش عليهم بني سليم فأطاعوه.';
const String p2 =
    'فاتبعهم بقريب من مائة رجل رام فأدركهم ببئر معونة، فقتلوهم إلا عمرو بن أمية ومن حديث أنس رضي الله عنه قال: جاء ناس إلى النبي ﷺ فقالوا: أن ابعث معنا رجالاً يعلمونا القرآن والسنة، فبعث إليهم سبعين رجلاً من الأنصار يقال لهم القراء فيهم خالي حرام، يقرأون القرآن ويتدارسون بالليل يتعلمون وكانوا بالنهار يجيئون بالماء فيضعونه في المسجد ويحتطبون فيبيعونه ويشترون به الطعام لأهل الصفة وللفقراء، فبعثهم النبي ﷺ إليهم فعرضوا لهم فقتلوهم، قبل أن يبلغوا المكان فقالوا: اللهم بلغ عنا نبينا أنا قد لقيناك فرضينا عنك ورضيت عنا، قال: وأتى رجل حراماً.';
const String p3 =
    'خال أنس من خلفه فطعنه برمح حتى أنفذه فقال حرام بن ملحان: فزت ورب الكعبة فزت ورب الكعبة، فقال رسول الله ﷺ لأصحابه: إن إخوانكم قد قتلوا وإنهم قالوا: اللهم بلغ عنا نبينا أنا قد لقيناك، فرضينا عنك ورضيت عنا.';
const String p4 =
    'رأينا كيف غدر حلفاء هذيل بأصحاب الرجيع من القُرّاء، الذين أرسلهم النبي ﷺ معلمين ومفقهين في غزوة الرجيع، وهاهنا عامر بن الطفيل يغدر بالسبعين القراء الذين استنفروا للدعوة إلى الله والتفقيه في دين الله في مجزرة رهيبة دنيئة وذلك في يوم بئر معونة.';
const String p5 =
    'لكن ذلك لم يفتَّ في عضد المسلمين، ولافتَّر من حميتهم في الدعوة إلى الله ولاكسر من عزمهم في مواصلة الدعوة وخدمة دين الله، لأن مصلحة الدعوة فوق الأنفس والدماء، بل إن الدعوة لايكتب لها النصر إذا لم تبذل في سبيلها الأرواح، ولاشيء يمكِّن للدعوة في الأرض مثل الصلابة في مواجهة الأحداث والأزمات واسترخاص التضحيات من أجلها .';
const String p6 =
    'إن الدعوات بدون قوى أو تضحيات يوشك أن تكون بمثابة فلسفات وأخيلة تلفها الكتب وترويها الأساطير ثم تطوى مع الزمن.';
const String p7 =
    'إن للسعادة ثمناً وإن للراحة ثمناً وإن للمجد والسلطان ثمناً، وثمن هذه الدعوة دم زكيٌّ يهراق في سبيل الله من أجل تحقيق شرع الله ونظامه وتثبيت معالم دينه على وجه البسيطة.';
const String p8 =
    'وقد تركت هذه المصائب في نفس رسول الله ﷺ آثار غائرة بعيدة الأعماق حتى إنه لبث شهر يقنت في صلاة الفجر، داعياً على قبائل سليم التي عصت الله ورسوله فعن ابن عباس رضي الله عنهما قال: قنت رسول الله ﷺ شهراً متتابعاً في الظهر والعصر والمغرب والعشاء صلاة الصبح، في دبر كل صلاة إذ قال: سمع الله لمن حمده من الركعة الأخيرة يدعو على أحياء من بني سليم، على رعل وذكوان وعصية ويؤمِّن من خلفه قال أنس بن مالك رضي الله عنه: وذلك بدء القنوت وما كنّا نقنت.';
const String p9 =
    'إن حادثتي الرجيع وبئر معونة تبصرنا بالمسؤولية الضخمة عن دين الله والدعوة إليه، ووضعت نصب أعيننا نماذج من التضحيات العظيمة التي قدمها الصحابة الكرام من أجل عقيدتهم ودينهم ومرضاة ربهم.';
const String p10 =
    'عندما اخترق الرمح ظهر حرام بن ملحان رضي الله عنه وخرج من صدره وأصبح يتلقى الدم بيديه، ويمسح به وجهه ورأسه ويقول: فزت ورب الكعبة إن هذا المشهد يجعل أقسى القلوب وأعظمها تحجراً يتأثر ويستصغر نفسه أمام هؤلاء العظماء الذين لاتصغرُّ وجوههم فزعاً من الموت، وإنما يعلوها البشر والسرور وتغشاها السكينة والطمأنينة، وهذا المنظر البديع الرائع الذي لايتصوره العقل البشري المجرد عن الإيمان جعل جبار بن سلمى  الذي طعن حرام بن ملحان يتسأل عن قول حرام فزت ورب الكعبة، والتى كانت سبباً فى إسلامه وقد قال فى ذلك: ان مما دعاني إلى الإسلام، أني طعنت رجلاً منهم يومئذ برمح بين كتفيه فنظرت إلى سنان الرمح حين خرج من صدره، فسمعته يقول: فزت ورب الكعبة! فقلت في نفسي: مافاز؟ ألست قد قتلت الرجل؟ حتى سألت بعد ذلك عن قوله فقالوا: للشهادة فقلت: فاز لعَمر الله.';
const String p11 =
    'وهذا الموقف الخارق للعادة يدعونا للتساؤل: هل يتعرض الشهيد لألم الموت؟ وتأتينا الإجابة الشافية من رسول الله ﷺ الذي لاينطق عن الهوى في قوله: مايجد الشهيد من مس القتل إلا كما يجد أحدكم من مس القرصة.';
const String p12 =
    'فللشهيد منزلة خاصة عند الله فجزاء الثمن الباهظ الذي يدفعه وهو روحه رخيصة في سيبل الله عزوجل لم يبخسه أعدل العادلين حقه فكافأه مكافأة بست جوائز كل وحدة منها تعدل الدنيا ومن فيها، فعن المقدام بن معد يكرب رضي الله عنه قال: قال رسول الله ﷺ :للشهيد عند الله ست خصال: يغفر له في أول دفعة من دمه، ويرى مقعده من الجنة، ويجار من عذاب القبر، ويأمن من الفزع الأكبر، ويحلَّى حلَّة الإيمان، ويزوج من الحور العين، ويشفَّع في سبعين إنساناً من أقاربه.';
const String p13 =
    'هذا بالإضافة إلى الوسام المميز المشرف الذي يأتي به يوم القيامة، وجرحه كهيئة يوم جرح: اللون لون الدم، والريح ريح مسك.';
const String p14 =
    'كما أن حياة الشهداء لاتنتهي بمجرد موتهم بل هم أحياء يرزقون ويتنعمون عند ربهم قال تعالى: وَلا تَحْسَبَنَّ الَّذِينَ قُتِلُوا فِي سَبِيلِ اللَّهِ أَمْوَاتًا بَلْ أَحْيَاءٌ عِنْدَ رَبِّهِمْ يُرْزَقُونَ - سورة آل عمران';
const String p15 =
    'إن حادثتي بئر معونة والرجيع وغيرها تدل على أن الرسول ﷺ لايعلم الغيب، كما دلت على ذلك أدلة أخرى منها قوله عزوجل: قُلْ لا أَمْلِكُ لِنَفْسِي نَفْعًا وَلا ضَرًّا إِلا مَا شَاءَ اللَّهُ وَلَوْ كُنْتُ أَعْلَمُ الْغَيْبَ لاسْتَكْثَرْتُ مِنَ الْخَيْرِ وَمَا مَسَّنِيَ السُّوءُ إِنْ أَنَا إِلا نَذِيرٌ وَبَشِيرٌ لِقَوْمٍ يُؤْمِنُونَ - سورة الأعراف ،فالله عزوجل وحده عالم الغيب والرسل والملائكة لايعلمون عن الغيب إلا ماعلمهم ربهم عزوجل: عَالِمُ الْغَيْبِ فَلا يُظْهِرُ عَلَى غَيْبِهِ أَحَدًا - سورة الجن';
const String p16 =
    'وقع عمرو بن أمية الضمري رضي الله عنه أسيراً في بئر معونة ولما علم عامر بن الطفيل أنه من مضر أطلقه، وجز ناصيته وأعتقه عن رقبة زعم أنها كانت على أمه، فلما خرج عمرو قاصداً المدينة نزل في طريقه في ظل والتقى برجلين من بني عامر وكان معهم عقد من رسول الله وجوار لم يعلم به عمرو بن أمية، وقد سألهما حين نزلا: ممن أنتما؟ فقال: من بني عامر فأمهلهما حتى ناما، عدا عليهما فقتلهما وهو يرى أنه قد اصاب بهما ثُؤرة من بني عامر، فيما أصابوا من أصحاب رسول الله ﷺ فلما قدم عمرو بن أمية على رسول الله فأخبره الخبر، قال رسول الله ﷺ : لقد قتلت قتيلين لأدينَّهما وهذا موقف رفيع فقد وَرَى ﷺ ذينك الرجلين العامريين الذين قتلهما عمرو بن أمية الضمري لكونهما يحملان عقداً منه ﷺ ولم يؤاخذهما بما فعل بعض أفراد قومهما، وهذا يمثل منتهى القمة في الوفاء بالعهود.';
const String p17 =
    'قد كان بإمكان النبي ﷺ أن يعتبر عمل عمرو بن أمية جزءاً من الانتقام الذي ينبغي أن يواجه به المجرمون المعتدون، ولكن ماذنب الأبرياء حتى يؤخذوا بجريرة المعتدين من قومهم، إن التوجيهات الإسلامية الرفيعة دفعت بالمسلمين ونبيهم ﷺ إلى الرقي الأخلاقي الذي لانظير له في دنيا الناس .';
const String p18 =
    'كان حسان رضي الله عنه من رجالات المؤسسة الإعلامية، فكان يشنّ الحرب النفسية على الأعداء وكان بجانبه كعب بن مالك وعبدالله بن رواحة رضي الله عنهم فلم يتركوا حدثاً من أحداث السيرة إلا قالوا فيه شعراً، وكل قصيدة للكافرين يردون عليها بقصائد وقد علمنا ما أحدثه شعر حسان في طرد كعب بن الشرف اليهودي، وكان ﷺ يتعهد شعراء الدولة الإسلامية ويشجعهم على خوض هذا الباب من الجهاد، فعلى المسلمين المعاصرين قادة وزعماء وعلماء وفقهاء وجماعات أن يرعوا شعراءهم ويشجعونهم لخوض هذا الجهاد العظيم.';
const String p19 =
    'استجاب الله لدعاء نبيه ﷺ فقد دعا ﷺ على عامر بن الطفيل فقال: اللهم اكفني عامراً فأصيب الطاغية بمرض عضال وصفه ﷺ بقوله: غدة كغدة البعير وسماه ﷺ بـ الطاعون، وهو وصف دقيق للطاعون الدبلي الذي يتميز بارتفاع درجة الحرارة وتضخم العقد الليمفية في منطقة الإرب وتحت الإبط وكذا تضخم الطحال، لقد أصيب عامر بن الطفيل وتلاشت أحلامه بالتملك على أهل المدن في الجزيرة العربية، أو خلافة النبي ﷺ ، و أصبح حبيساً في بيت امرأة من قومه وقد ولّى عنه الناس ونفروا منه خشية العدوى ففقد صوابه، وصرخ بمن بقي حوله فقال: غدة كغدة البكر في بيت امرأة من بني فلان ائتوني بفرسي فركبه فمات على ظهر فرسه، هلك ذلك الجبار العنيد كالمجنون بعد أن تطاير الناس من حوله خوفاً على أنفسهم من العدوة.';
