const int sectionIndex = 21;
const String sectionTitle = 'الهجرة - مغادرة الأرض والأهل';

const List t1 = ['1', 'التمهيد للهجرة'];
const List t2 = ['2', 'الإعداد في يثرب'];
const List t3 = ['3', 'سُنة الابتلاء'];
const List t4 = ['4', 'إظهار التوحيد'];
const List t5 = ['5', 'تصديق وعد اللَّه'];

const String p1 =
    'إن الهجرة إلى المدينة سبقها تمهيد وإعداد وتخطيط من النبي ﷺ ، لم تكن نزهة يروح فيها الإنسان عن نفسه ولكنها مغادرة الأرض والأهل وأسباب الرزق والتخلي عن كل ذلك من أجل العقيدة، ولهذا احتاجت إلى جهد كبير حتى وصل المهاجرون إلى قناعة كاملة بهذه الهجرة ومن تلك الوسائل هى التربية الإيمانية العميقة والاضطهاد الذي أصاب المؤمنين حتى وصلوا إلى قناعة كاملة بعدم إمكانية المعايشة مع الكفر.';
const String p2 =
    'وتحدثت القراّن عن الفتية الذين آمنوا بربهم وعن هجرتهم من بلدهم إلى الكهف، وهكذا استقرت صورة من صور الإيمان في نفوس الصحابة وهي تترك أهلها ووطنها من أجل عقيدتها.';
const String p3 =
    'ثم تلا ذلك آيات صريحة تتحدث عن الهجرة في سورة النحل قال تعالى: وَالَّذِينَ هَاجَرُوا فِي اللَّهِ مِنْ بَعْدِ مَا ظُلِمُوا لَنُبَوِّئَنَّهُمْ فِي الدُّنْيَا حَسَنَةً وَلأَجْرُ الآخِرَةِ أَكْبَرُ لَوْ كَانُوا يَعْلَمُونَ الَّذِينَ صَبَرُوا وَعَلَى رَبِّهِمْ يَتَوَكَّلُونَ - سورة النحل.';
const String p4 =
    'وكانت الهجرة إلى الحبشة تدريباً عملياً على ترك الأهل والوطن.';
const String p5 =
    'نلاحظ أن الرسول ﷺ لم يسارع بالانتقال إلى الأنصار من الأيام الأولى وإنما أخر ذلك لأكثر من عامين، حتى تأكد من وجود القاعدة الواسعة نسبياً كما كان في الوقت نفسه يتم إعدادها في أجواء القرآن الكريم وخاصة بعد انتقال مصعب إلى المدينة.';
const String p6 =
    'وقد تأكد أن الاستعداد لدى الأنصار قد بلغ كماله وذلك بطلبهم هجرة الرسول الكريم إليهم، كما كانت المناقشات التي جرت في بيعة العقبة الثانية تؤكد الحرص الشديد من الأنصار على تأكيد البيعة والاستيثاق للنبي ﷺ بأقوى المواثيق على أنفسهم، وكان في رغبتهم أن يميلوا على أهل منى ممن آذى رسول الله ﷺ بأسيافهم لو أذن الرسول الكريم بذلك ولكنه قال لهم: لم أؤمر بذلك.';
const String p7 =
    'وهكذا تم الإعداد لأهل يثرب ليكونوا قادرين على استقبال المهاجرين ومايترتب على ذلك من تبعات.';
const String p8 =
    'تعتبر سورة العنكبوت من أواخر مانزل في المرحلة المكية وتحدثت السورة عن سنة الله في الدعوات وهي سنة الابتلاء قال تعالى: الم أَحَسِبَ النَّاسُ أَنْ يُتْرَكُوا أَنْ يَقُولُوا ءَامَنَّا وَهُمْ لاَ يُفْتَنُونَ وَلَقَدْ فَتَنَّا الَّذِينَ مِنْ قَبْلِهِمْ فَلَيَعْلَمَنَّ اللَّهُ الَّذِينَ صَدَقُوا وَلَيَعْلَمَنَّ الْكَاذِبِينَ أَمْ حَسِبَ الَّذِينَ يَعْمَلُونَ السَّيِّئَاتِ أَنْ يَسْبِقُونَا سَاءَ مَا يَحْكُمُونَ، وفي سورة العنكبوت ثلاثة أمور تلفت النظر وهي:';
const String p9 =
    'ذكر كلمة المنافقين ومن المعلوم أن النفاق لايكون إلا عندما تكون الغلبة للمسلمين، حيث يغشى بعض الناس على مصالحهم فيظهرون الإسلام ويبطنون الكفر ومن المعلوم أن المجتمع كان جاهلياً في مكة وكانت القوة والغلبة لأهل الشرك فما مناسبة مجئ المنافقين في هذه السورة في قوله تعالى: وَلَيَعْلَمَنَّ اللَّهُ الَّذِينَ ءَامَنُوا وَلَيَعْلَمَنَّ الْمُنَافِقِينَ .';
const String p10 =
    'وهي سورة مكية كما قلنا فهل كانت الآمال قد قويت عند الفئة المؤمنة بحيث تراءى لهم الفرج والنصر قاب قوسين أو أدنى أم أن هذه الآية مدنية وضعت في سورة مكية لأن النفاق لم يحن وقته بعد كما ذهب بعض المفسرين.';
const String p11 =
    'ورد الأمر بمجادلة أهل الكتاب بالتي هي أحسن وكأنه تهيئة للنفوس للمرحلة القادمة التي سيكون بين المسلمين وبين أهل الكتاب احتكاك، فلا يكونوا البادئين بالشدة فيأتي التنبيه على هذا الأمر في قوله تعالى: وَلاَ تُجَادِلُوا أَهْلَ الْكِتَابِ إِلاَّ بِالَّتِي هِيَ أَحْسَنُ إِلاَّ الَّذِينَ ظَلَمُوا مِنْهُمْ وَقُولُوا ءَامَنَّا بِالَّذِي أُنْزِلَ إِلَيْنَا وَأُنْزِلَ إِلَيْكُمْ وَإِلَهُنَا وَإِلَهُكُمْ وَاحِدٌ وَنَحْنُ لَهُ مُسْلِمُونَ وَكَذَلِكَ أَنْزَلْنَا إِلَيْكَ الْكِتَابَ فَالَّذِينَ ءَاتَيْنَاهُمُ الْكِتَابَ يُؤْمِنُونَ بِهِ وَمِنْ هَؤُلاءِ مَنْ يُؤْمِنُ بِهِ وَمَا يَجْحَدُ بِآيَاتِنَا إِلاَّ الْكَافِرُونَ .';
const String p12 =
    'فهذه الآية الكريمة نزلت في تحريض المؤمنين الذين كانوا بمكة على الهجرة، لأن البقاء في بقعة على أذى الكفار ليس بصواب بل الصواب أن يلتمس عبادة الله في أرضه مع صالحي عباده أي إن كنتم في ضيق من إظهار الإيمان بها فهاجروا إلى المدينة فإنها واسعة لإظهار التوحيد، ثم أخبرهم تعالى أن الرزق لايختص ببقعة معينة بل رزقه تعالى عام لخلقه حيث كانوا وأين كانوا بل كانت أرزاق المهاجرين حيث هاجروا أكثر وأوسع وأطيب فإنهم بعد قليل صاروا حكام البلاد في سائر الأقطار والأمصار، ولهذا قال تعالى: وَكَأَيِّنْ مِنْ دَابَّةٍ لاَ تَحْمِلُ رِزْقَهَا اللَّهُ يَرْزُقُهَا وَإِيَّاكُمْ وَهُوَ السَّمِيعُ الْعَلِيمُ .';
const String p13 =
    'كما ذكرهم تعالى أن كل نفس واجدة مرارة الموت، فقال جل شأنه: كُلُّ نَفْسٍ ذَائِقَةُ الْمَوْتِ ثُمَّ إِلَيْنَا تُرْجَعُونَ .';
const String p14 =
    'أي واجدة مرارته وكربه كما يجد الذائق طعم المذوق ومعناه: إنكم ميتون فواصلون إلى الجزاء ومن كانت هذه عاقبته لم يكن له بد من التزود لها والاستعداد بجهده، وهذا تشجيع للنفس على الهجرة، لأن النفس إذا تيقنت بالموت سهل عليها مفارقة وطنها.';
const String p15 =
    'قال ابن كثير في الآية: أي أينما كنتم يدرككم الموت، فكونوا في طاعة الله وحيث أمركم الله فهو خير لكم فإن الموت لابد منه ولا محيد عنه ثم إلى الله المرجع والمآب، فمن كان مطيعاً له جازاه أفضل الجزاء، ووافاه أتم الثواب ولهذا قال تعالى: وَالَّذِينَ ءَامَنُوا وَعَمِلُوا الصَّالِحَاتِ لَنُبَوِّئَنَّهُمْ مِنَ الْجَنَّةِ غُرَفًا تَجْرِي مِنْ تَحْتِهَا الأَنْهَارُ خَالِدِينَ فِيهَا نِعْمَ أَجْرُ الْعَامِلِينَ الَّذِينَ صَبَرُوا وَعَلَى رَبِّهِمْ يَتَوَكَّلُونَ، أي صبروا على دينهم وهاجروا إلى الله، ونابذوا الأعداء وفارقوا الأهل والأقرباء ابتغاء وجه الله ورجاء ما عنده وتصديق موعوده ولم يتوكلوا في جميع ذلك إلا على الله.';
