const int sectionIndex = 16;
const String sectionTitle = 'هجرة الحبشة';

const List t1 = ['1', 'سنّة الأخذ بالأسباب'];
const List t2 = ['2', 'السنن الربانية'];
const List t3 = ['3', 'سنّة التدرج'];
const List t4 = ['4', 'الهجرة الى الحبشة'];
const List t5 = ['5', 'شدة البلاء على أصحاب رسول الله'];
const List t6 = ['6', 'أرض الحبشة'];
const List t7 = ['7', 'سعي قريش في رد المهاجرين'];
const List t8 = ['8', 'حوار جعفر والنجاشي'];
const List t9 = ['9', 'محاولة الرد مرة آخرى'];
const List t10 = ['10', 'إسلام النجاشي'];
const List t11 = ['11', 'ثبات المؤمنين '];

const String p1 =
    'الأسباب جمع سبب وهو كل شيء يتوصل به الى غيره وسنّة الأخذ بالأسباب مقررة في كون الله تعالى بصورة واضحة فلقد خلق الله هذا الكون بقدرته وأودعه من القوانين والسنن مايضمن استقراره واستمراره، وجعل المسببات مرتبطة بالأسباب بعد إرادته تعالى فجعل عرشه سبحانه محمولاً بالملائكة وأرسى الأرض بالجبال وأنبت الزرع بالماء .. وغير ذلك';
const String p2 =
    'ولو شاء الله رب العالمين لجعل كل هذه الأشياء وغيرها بقدرته المطلقة غير محتاجة الى سبب ولكن هكذا اقتضت مشيئة الله تعالى وحكمته الذي يريد أن يوجه خلقه الى ضرورة مراعاة هذه السنّة ليستقيم سير الحياة على النحو الذي يريده سبحانه وإذا كانت سنة الأخذ بالأسباب مبرزة في كون الله تعالى بصورة واضحة فإنها كذلك مقررة في كتاب الله تعالى، ولقد وجه الله عباده المؤمنين الى وجوب مراعاة هذه السنّة في كل شؤونهم الدنيوية والأخروية سواء قال تعالى: وَقُلِ اعْمَلُوا فَسَيَرَى اللَّهُ عَمَلَكُمْ وَرَسُولُهُ وَالْمُؤْمِنُونَ وَسَتُرَدُّونَ إِلَى عَالِمِ الْغَيْبِ وَالشَّهَادَةِ فَيُنَبِّئُكُمْ بِمَا كُنْتُمْ تَعْمَلُونَ - سورة التوبة';
const String p3 =
    'إن هؤلاء الكفار لم يبلغوا مابلغوه لأنهم أقرب من الله أو أرضى له، ولم يبلغوا مابلغوا بسحر أو بمعجزة أو لأنهم خلق آخر متميز ولم يقيموا الصناعات أو يجوبوا البحار أو يخترقوا أجواء الفضاء لأن عقيدتهم حق أو لأن فكرهم سليم، إنهم بلغوا ذلك لأن السبيل الى هذا التقدم درب مفتوح لجميع خلق الله مؤمنهم وكافرهم برهم وفاجرهم قال تعالى: مَنْ كَانَ يُرِيدُ الْحَيَاةَ الدُّنْيَا وَزِينَتَهَا نُوَفِّ إِلَيْهِمْ أَعْمَالَهُمْ فِيهَا وَهُمْ فِيهَا لاَ يُبْخَسُونَ - سورة هود';

const String p4 =
    'إن الله سبحانه وتعالى جعل التمكين في الحياة يمضي بالجهد البشري وبالطاقة البشرية على سنن ربانية ثابتة، وقوانين لا تتبدل ولا تتحول فمن يقدم الجهد الصادق ويخضع لسنن الحياة يصل على قدر جهده وبذله وعلى قدر سعيه وعطائه.';
const String p5 =
    'إنها السنة التي أردها الله في هذه الحياة، إنها مشيئته وسنته وإرادته صحيح أن هذا التقدم كله لايفتح للكافرين أبواب الجنة ولا يغني عنهم شيئاً ولكن التقصير من جانب المسلم إثم يحاسب عليه.';
const String p6 =
    'والتوكل على الله تعالى لا يمنع من الأخذ بالأسباب فالمؤمن يتخذ الأسباب من باب الإيمان بالله وطاعته فيما يأمر به من اتخاذها، ولكنه لايجعل الأسباب هي التي تنشىء النتائج فيتوكل عليها.';
const String p7 =
    'إن الذي ينشئ النتائج -كما ينشئ الأسباب- هو قدر الله ولا علاقة بين السبب والنتيجة في شعور المؤمن .. اتخاذ السبب عبادة بالطاعة وتحقق النتيجة قدر من الله مستقل عن السبب لا يقدر عليه إلا الله وبذلك يتحرر شعور المؤمن من التعبد للأسباب والتعلق بهذا وفي الوقت ذاته هو يستوفيها بقدر طاقته لينال ثواب طاعة الله في استيفائها.';
const String p8 =
    'ولابد للأمة الاسلامية أن تدرك أن الأخذ بالأسباب للوصول الى التمكين أمر لا محيص عنه وذلك بتقرير الله تعالى حسب سنته التي لاتتخلف ومن رحمة الله تعالى أنه لم يطلب من المسلمين فوق مايستطيعونه من الاسباب، ولم يطلب منهم أن يُعدوا العدة التي تكافئ تجهيز الخصم ولكنه سبحانه قال: وَأَعِدُّوا لَهُمْ مَا اسْتَطَعْتُمْ مِنْ قُوَّةٍ وَمِنْ رِبَاطِ الْخَيْلِ تُرْهِبُونَ بِهِ عَدُوَّ اللَّهِ وَعَدُوَّكُمْ وَءَاخَرِينَ مِنْ دُونِهِمْ لاَ تَعْلَمُونَهُمُ اللَّهُ يَعْلَمُهُمْ وَمَا تُنْفِقُوا مِنْ شَيْءٍ فِي سَبِيلِ اللَّهِ يُوَفَّ إِلَيْكُمْ وَأَنْتُمْ لاَ تُظْلَمُونَ - سورة الأنفال';

const String p9 =
    'وعلى الأمة أن تراعي سنن الله المبثوثة في كونه، والظاهرة في قرآنه الكريم وذلك لتسير على طريق النهوض بنور من الله تعالى.';
const String p10 =
    'إن النبي ﷺ أخذ بسنن الله تعالى منذ البعثة حتى وفاته ولم يفرط في أي منها، فتعامل مع سنّة الله في تغيير النفوس وسنّة التدافع مع الباطل وسنّة التدرج في بناء الجماعة ثم الدولة وسنّة الابتلاء، واستفرغ ﷺ جهده في الأخذ بالأسباب التي توصل للتمكين فكانت هجرتي الحبشة وذهابه للطائف وعرضه للدعوة على القبائل ثم هجرته الى المدينة فأقام الدولة وحافظ عليها وسار أصحابه من بعده على نهجه وتعاملوا مع السنن بوعي وبصيرة وصنعوا حضارة لم يعرف التاريخ البشري مثلها حتى يومنا هذا.';

const String p11 =
    'قال تعالى: وَالَّذِينَ هَاجَرُوا فِي اللَّهِ مِنْ بَعْدِ مَا ظُلِمُوا لَنُبَوِّئَنَّهُمْ فِي الدُّنْيَا حَسَنَةً وَلأَجْرُ الآخِرَةِ أَكْبَرُ لَوْ كَانُوا يَعْلَمُونَ - سورة النحل';
const String p12 =
    'نقل القرطبي رحمه الله قول قتادة رحمه الله: المراد أصحاب محمد ﷺ ، ظلمهم المشركون بمكة وأخرجوهم حتى لحق طائفة منهم بالحبشة ثم بوأهم الله تعالى دار الهجرة وجعل لهم انصاراً من المؤمنين.';
const String p13 =
    'وقال تعالى: قُلْ يَاعِبَادِ الَّذِينَ ءَامَنُوا اتَّقُوا رَبَّكُمْ لِلَّذِينَ أَحْسَنُوا فِي هَذِهِ الدُّنْيَا حَسَنَةٌ وَأَرْضُ اللَّهِ وَاسِعَةٌ إِنَّمَا يُوَفَّى الصَّابِرُونَ أَجْرَهُمْ بِغَيْرِ حِسَابٍ - سورة الزمر';
const String p14 =
    'قال ابن كثير رحمه الله: هذا أمر من الله تعالى لعباده المؤمنين بالهجرة من البلد الذي لا يقدرون فيه على إقامة الدين الى أرض الله الواسعة حتى يمكن إقامة الدين ... الى أن قال: ولهذا ضاق على المستضعفين بمكة مقامهم بها، خرجوا مهاجرين الى أرض الحبشة ليأمنوا على دينهم هناك، فوجدوا خير المنزل هناك أصحمة النجاشي ملك الحبشة رحمه الله تعالى.';

const String p15 =
    'اشتد البلاء على أصحاب رسول الله ﷺ وجعل الكفار يحبسونهم ويعذبونهم بالضرب والجوع والعطش ورمضاء مكة والنار ليفتنوهم عن دينهم، فمنهم من يفتتن من شدة البلاء وقلبه مطمئن بالايمان ومنهم من تصلب في دينه ويعصمه الله منهم فلما رأى رسول الله ﷺ مايصيب أصحابه من البلاء، وماهو فيه من العافية لمكانه من الله ومن عمه أبي طالب وأنه لايقدر على أن يمنعهم مماهم فيه من البلاء قال لهم: لو خرجتم الى أرض الحبشة فإن بها ملكاً لا يظلم عنده أحد وهي أرض صدق حتى يجعل لكم فرجاً مما أنتم فيه فخرج عند ذلك المسلمون من أصحاب رسول الله ﷺ الى أرض الحبشة مخافة الفتنة وفراراً الى الله بدينهم فكانت أول هجرة كانت في الاسلام.';

const String p16 =
    'كانت قبائل العرب في تلك الفترة تدين بالولاء والطاعة لقريش وتسمع وتطيع لأمرها في الغالب، إذ لها نفوذ عليها وكانت القبائل في حاجة لقريش في حجها وتجارتها ومواسمها وفوق ذلك كانوا يشاركون قريش في حرب الدعوة وعدم الاستجابة للنبي ﷺ وقد أشار ابن إسحاق إلى نماذج من هؤلاء العرب الذين رفضوا عرضه ودعوته، فإذا كان هذا في داخل الجزيرة فلم يكن في حينها في خارج الجزيرة بلد أكثر أمناً من بلاد الحبشة ومن المعلوم بعد الحبشة عن سطوة قريش من جانب وهي لاتدين لقريش بالاتباع كغيرها من القبائل وفي حديث ابن اسحاق عن أسباب الحبشة مكاناً للهجرة أنها أرض صدق وأن بها ملكاً لايظلم عنده أحد فهي أرض صدق وملكها عادل وتلك من أهم سمات البلد الآمن.';
const String p17 =
    'التزم الأحباش بالنصرانية وهي أقرب إلى الإسلام من الوثنية، ولذلك فرح المؤمنون بانتصار النصارى على فارس المجوس المشركين في الفترة المكية سنة ثمان في البعثة كما في القرآن.';
const String p18 =
    'وكانت معرفة الرسول ﷺ بأخبار الحبشة من خلال حاضنته أم أيمن رضي الله عنها، وأم أيمن هذه ثبت في صحيح مسلم وغيره أنها كانت حبشية ونقل ذلك عن ابن شهاب وفي سننن ابن ماجة أنها كانت تصنع للنبي ﷺ طعاماً فقال: ماهذا؟ فقالت: طعام نصنعه بأرضنا فأحببت أن أصنع لك منه رغيفاً.';
const String p19 =
    'غادر أصحاب رسول الله ﷺ مكة في رجب من السنة الخامسة للبعثة وكانوا عشرة رجال وأربع نسوة وقيل خمس نسوة وحاولت قريش أن تدركهم لتردهم إلى مكة وخرجوا في أثرهم حتى وصلوا البحر ولكن المسلمين كانوا قد أبحروا متوجهين إلى الحبشة.';

const String p20 =
    'فلما رأت قريش أن أصحاب رسول الله ﷺ قد آمنوا، واطمأنوا بأرض الحبشة وأنهم قد أصابوا بها داراً واستقراراً وحسن جوار من النجاشي وعبدوا الله لايؤذيهم أحد، ائتمروا فيما بينهم أن يبعثوا وفداً للنجاشي لإحضار من عنده من المسلمين إلى مكة.';
const String p21 =
    'فعن أم سلمة بنت أبي أمية المغيرة زوج النبي ﷺ قالت: لما نزلنا أرض الحبشة جاورنا بها خير جار -النجاشي- أمنا على ديننا وعبدنا الله تعالى لانؤذي ولانسمع شيئاً نكرهه، فلما بلغ ذلك قريشاً ائتمروا أن يبعثوا إلى النجاشي فينا رجلين جلدين وأن يهدوا للنجاشي هدايا مما يستطرف من متاع مكة، وكان من أعجب مايأتيه منها إليه الأدم -الجلد المدبوغ- فجمعوا له أدماً كثيراً ولم يتركوا من بطارقته -البطريق هو الحاذق بالحرب وأمورها بلغة الروم- بطريقاً إلا أهدوا له هدية، ثم بعثوا بذلك عبدالله بن أبي ربيعة بن المغيرة المخزومي وعمرو بن العاص بن وائل السهمي وأمروهما أمرهم وقالوا لهما: ادفعا إلى كل بطريق هديته قبل أن تكلموا النجاشي فيهم ثم قدموا للنجاشي هداياه ثم سلوه أن يسلمهم إليكم قبل أن يكلمهم قال: فخرجا فقدما على النجاشي ونحن عنده بخير دار وخير جار، فلم يبق من بطارقته بطريق إلا دفعا إليه هديته قبل أن يكلما النجاشي ثم قالا لكل بطريق منهم: إنه صبأ إلى بلد الملك منا غلمان سفهاء فارقوا دين قومهم ولم يدخلوا في دينكم وجاءوا بدين مبتدع لانعرفه نحن ولاأنتم.';
const String p22 =
    'وقد بعثنا إلى الملك فيهم أشرف قومهم لنردهم إليهم فإذا كلمنا الملك فيهم فأشيروا عليه بأن يسلمهم إلينا ولايكلمهم فإن قومهم أعلى بهم عينا، وأعلم بما عابوا عليهم فقالوا لهم: نعم ثم إنهما قربا هداياهم إلى النجاشي فقبلها منهما، ثم كلماه فقالا: أيها الملك إنه قد صبأ إلى بلدك منا غلمان سفهاء فارقوا دين قومهم ولم يدخلوا في دينك وجاءوا بدين مبتدع لانعرفه نحن ولا أنت وقد بعثنا إليك فيهم أشراف قومهم من آباءهم وأعمامهم لتردهم إليهم فهم أعلى بهم عيناً وأعلم بما عابوا عليهم وعاتبوهم فيه.';
const String p23 =
    'ولم يكن شيء أبغض الى عبدالله بن أبي ربيعة وعمرو بن العاص من أن يسمع النجاشي كلامهم فقالت بطارقته حوله: صدقوا أيها الملك قومهم أعلى بهم عيناً وأعلم بما عابوا عليهم فأسلمهم إليهما فليردانهم الى بلادهم وقومهم.';
const String p24 =
    'فغضب النجاشي ثم قال: لا هايم الله إذا لا أسلمهم إليهما ولا أكاد، قوماً جاوروني ونزلوا بلادي واختاروني على من سواي حتى أدعوهم فأسألهم مايقول هذان في أمرهم؟ فإن كانوا كما يقولون أسلمتهم إليهما ورددتهم الى قومهم وإن كانوا على غير ذلك منعتهم منهما وأحسنت جوارهم ماجاوروني.';

const String p25 =
    'ثم أرسل النجاشي الى أصحاب رسول الله ﷺ فدعاهم فلما جاءهم رسوله اجتمعوا ثم قال بعضهم لبعض ماتقولون للرجل إذا جئتموه؟ قالوا: نقول والله ماعلمنا وما أمرنا به نبينا ﷺ كائناً في ذلك ماهو كائن فلما جاءه وقد دعا النجاشي أساقفته، فنشروا مصاحفهم حوله سألهم فقال: ماهذا الدين الذي فارقتم فيه قومكم ولم تدخلوا ديني ولا دين أحد من هذه الأمم؟';
const String p26 =
    'فكان الذي كلمه جعفر بن أبي طالب رضي الله عنه فقال له: أيها الملك كنا قوماً أهل جاهلية نعبد الأصنام ونأكل الميتة ونأتي الفواحش ونقطع الأرحام ونسيء الجوار يأكل القوي منا الضعيف، فكنا على ذلك حتى بعث الله إلينا رسولاً نعرف نسبه وصدقه وأمانته وعفافه فدعانا الى الله لنوحده ونعبده ونخلع ماكنا نعبد وآباؤنا من دونه من الحجارة والأوثان وأمرنا بصدق الحديث وأداء الأمانة وصلة الرحم وحسن الجوار والكف عن المحارم والدماء ونهانا عن الفواحش وقول الزور وأكل مال اليتيم وقدف المحصنة، وأمرنا أن نعبد الله وحده لانشرك به شيئاً وأمرنا بالصلاة والزكاة والصيام.';
const String p27 =
    'فعدد عليه أمور الاسلام - فصدقناه - وآمنا به، واتبعناه على ماجاء به فعبدنا الله وحده فلم نشرك به شيئاً، وحرمنا ماحرم علينا، وأحللنا ما أحل لنا، فعدا علينا قومنا، فعذبونا وفتنونا عن ديننا ليردونا الى عبادة الأوثان من عبادة الله، وأن نستحل ماكنا نستحل من الخبائث فلما قهرونا وظلمونا وشقوا علينا، وحالوا بيننا وبين ديننا، خرجنا الى بلدك واخترناك على من سواك ورغبنا في جوارك ورجونا ألا نظلم عندك أيها الملك.';
const String p28 =
    'فقال له النجاشي: هل معك مما جاء به عن الله شيء؟ قال له جعفر: نعم، فقال له النجاشي: فاقرأه عليّ؟';
const String p29 =
    'فقرأ عليه صدراً من كهيعص فبكى والله النجاشي، حتى أخضل لحيته، وبكت أساقفته، حتى أخضلوا مصاحفهم حين سمعوا ماتلا عليهم.';
const String p30 =
    'ثم قال النجاشي: إن هذا والله والذي جاء به موسى ليخرج من مشكاة واحدة، انطلقا فوالله لا أسلمهم إليكم أبداً ولا أكاد.';
const String p31 =
    'فلما خرج كل من عمرو بن العاص وعبد الله بن أبي ربيعة من عند النجاشي قال عمرو بن العاص: والذي لآنبئهم غداً عيبهم عندهم ثم أستأصل به خضراءهم - أي أقضي به على دهمائهم وسوادهم قالت: فقال له عبدالله بن أبي ربيعة وكان أتقى الرجلين فينا لا تفعل فإن لهم أرحاماً وإن كانوا قد خالفونا.';
const String p32 =
    'قال: والله لأخبرنه أنهم يزعمون أن عيسى بن مريم عبد قالت: ثم غدا عليه الغد فقال له: إيها الملك إنهم يقولون في عيسى بن مريم قولاً عظيماً فأرسل إليهم فاسألهم عما يقولون فيه قالت: فارسل إليهم يسألهم عنه قالت: ولم ينزل بنا مثله فاجتمع القوم فقال بعضهم لبعض ماذا تقولون في عيسى إذا سألكم عنه؟ قالوا: نقول والله فيه ماقال الله وماجاء به نبينا كائناً في ذلك ماهو كائن فلما دخلوا عليه قال لهم: ماتقولون في عيسى بن مريم؟';
const String p33 =
    'فقال له جعفر بن أبي طالب: نقول فيه الذي جاء به نبينا: هو عبدالله ورسوله وروحه وكلمته ألقاها الى مريم العذراء البتول.';
const String p34 =
    'فضرب النجاشي يده الى الأرض فأخذ منها عوداً ثم قال: ماعدا عيسى بن مريم ماقلت هذا العود، فتناخرت بطارقته - أي تكملت وكأنه كلام مع غضب، حوله حين قال ماقال فقال: وإن نخرتم والله، اذهبوا فأنتم شيوم بأرضي (والشيوم الآمنون) من يسبكم غَرِمَ ثم من سبكم غرم فما أحب أن لي دبراً ذهباً وإني آذيت رجلاً منكم والدبر بلسان الحبشة الجعل، ردوا عليهما هداياهما فلا حاجة لنا بها فوالله ما أخذ الله مني الرشوة حين رد عليّ ملكي فآخذ الرشوة فيه وما أطاع الناس في أطيعهم فيه، قالت: فخرجا من عنده مقبوحين مردوداً عليهما ماجاءا به، وأقمنا عنده بخير دار مع خير جار.';
const String p35 =
    'أسلم النجاشي وصدق بنبوة النبي ﷺ وإن كان قد أخفى إيمانه عن قومه، لما علمه فيهم من الثبات على الباطل وحرصهم على الضلال، وجمودهم على العقائد المنحرفة وإن صادمت العقل والنقل، فعن أبي هريرة رضي الله عنه : أن رسول الله ﷺ نعى النجاشي في اليوم الذي مات فيه، وخرج بهم الى المصلى، فصف بهم وكبر عليه أربع تكبيرات، وعن جابر رضي الله عنه قال: قال النبي ﷺ حين مات النجاشي: مات اليوم رجل صالح فقوموا فصلوا على أخيكم أصحمة';
const String p36 =
    'رضي الله عنه وأرضاه وكانت وفاته رحمه الله سنة تسع عند الأكثر وقيل سنة ثمان قبل فتح مكة.';
const String p37 =
    'إن ثبات المؤمنين على عقيدتهم بعد أن ينزل بهم الأشرار والضالون أنواع العذاب والاضطهاد، دليل على صدق إيمانهم وإخلاصهم في معتقداتهم وسمو نفوسهم وأرواحهم بحيث يرون ماهم عليه من راحة الضمير واطمئنان النفس والعقل وما يأملونه من رضا الله جل شأنه أعظم بكثير مما ينال أجسادهم من تعذيب وحرمان واضطهاد، لأن السيطرة في المؤمنين الصادقين والدعاة المخلصين تكون دائماً وأبداً لأرواحهم لا لأجسادهم وهم يسرعون الى تلبية مطالب أرواحهم من حيث لايبالون بما تتطلبه أجسامهم من راحة وشبع ولذة، وبهذا تنتصر الدعوات وبهذا تتحرّر الجماهير من الظلمات والجهالات.';
