const int sectionIndex = 65;
const String sectionTitle = 'فتح مكة - إذا جَاء نَصرُ اللَّهِ والفتحُ';

const List t1 = ['1', 'سبحان الله وبحمده استغفر الله وأتوب إليه'];
const List t2 = ['2', 'إسلام سهيل بن عمرو'];
const List t3 = ['3', 'إسلام عكرمة بن أبي جهل'];
const List t4 = ['4', 'سلوك النبي ﷺ في تعامله مع عكرمة'];
const List t5 = ['5', 'من عفو النبي ﷺ وحلمه'];
const List t6 = ['6', 'أتكلمني في حد من حدود الله؟'];
const List t7 = ['7', 'أجرنا من أجرتي يا أم هاني'];
const List t8 = ['8', 'إنه لاينبغي لنبي أن يكون له خائنة أعين'];
const List t9 = ['9', 'المحيا محياكم والممات مماتكم'];
const List t10 = ['10', 'من الأحكام الشرعية فى فتح مكة'];
const List t11 = ['11', 'مكان نزول الرسول ﷺ بمكة'];

const String p1 =
    'قالت عائشة رضي الله عنها: كان رسول الله ﷺ يكثر من قوله: سبحان الله وبحمده استغفر الله وأتوب إليه، قالت: فقلت: يارسول الله أراك تكثر من قول سبحان الله وبحمده أستغفر الله وأتوب إليه، فقال: خبرني ربي أني سأرى علامة في أمتي فإذا رأيتها أكثرت من قول: سبحان الله وبحمده أستغفر الله وأتوب إليه، فقد رأيتها إِذَا جَاءَ نَصْرُ اللَّهِ وَالْفَتْحُ وَرَأَيْتَ النَّاسَ يَدْخُلُونَ فِي دِينِ اللَّهِ أَفْوَاجًا فَسَبِّحْ بِحَمْدِ رَبِّكَ وَاسْتَغْفِرْهُ إِنَّهُ كَانَ تَوَّابًا - سورة النصر';
const String p2 =
    'وفي مطلع السورة إيحاء معين لإنشاء تصور خاص عن حقيقة مايجري في هذا الكون من أحداث ومايقع في هذه الحياة من حوادث، وعن دور الرسول ﷺ ودور المؤمنين في هذه الدعوة وحدّهم الذين ينتهون إليه في هذ الأمر... هذا الإيحاء يتمثل في قوله: إِذَا جَاءَ نَصْرُ اللَّهِ وَالْفَتْحُ، فهو نصر يجيء به الله: في الوقت المناسب الذي يقدره في الصورة التي يريدها للغاية التي يرسمها وليس للنبي ولا لأصحابه من أمره شيء وليس لهم في هذا النصر يد، وليس لأصحابه فيه كسب، وليس لذواتهم منه نصيب، وليس لنفوسهم منه حظ، إنما هو أمر الله يحققه بهم أو بدونهم وحسبهم منه أن يجريه الله على أيديهم وأن يقيمهم عليه حراساً ويجعلهم عليه أمناء.... وهذا هو كل حظهم من النصر والفتح ومن دخول الناس في دين الله أفواجاً.';
const String p3 =
    'قال سهيل بن عمرو: لما دخل رسول الله ﷺ مكة وظهر انقحمت بيتي وأغلقت عليّ بابي، وأرسلت الى ابني عبدالله بن سهيل أن اطلب لي جواراً من محمد وإني لا آمن من أن أقتل، وجعلت أتذكر أثري عند محمد وأصحابه فليس أحد أسوأ أثراً مني وإني لقيت رسول الله ﷺ يوم الحديبية بما لم يلحقه أحد، وكنت الذي كاتبته مع حضوري بدراً وأحداً وكلما تحركت قريش كنت فيها، فذهب عبدالله بن سهيل الى رسول الله فقال: يارسول الله تؤمنه؟ فقال: نعم هو آمن بأمان الله، فليظهر ثم قال رسول الله ﷺ لمن حوله: من لقي سهيلاً بن عمرو فلا يشد النظر إليه، فليخرج فلعمري إن سهيلاً له عقل وشرف ومامثل سهيل جهل الاسلام، ولقد رأى ماكان يُوضع فيه أنه لم يكن له بنافع! فخرج عبدالله الى أبيه فقال سُهيل: كان والله بَراً صغيراً وكبيراً ! فكان سهيل يقبل ويدبر وخرج الى حنين مع النبي ﷺ وهو على شركه حتى أسلم بالجعرّانة، لقد كانت لهذه الكلمات التربوية الأثر الكبير على سهيل بن عمرو حيث أثنى على رسول الله ﷺ بالبر طوال عمره، ثم دخل في الاسلام بعد ذلك وقد حسن إسلامه وكان مكثراً من الأعمال الصالحة، يقول الزبير بن بكار: كان سهيل بعد كثير الصلاة والصوم والصدقة وخرج بجماعته الى الشام مجاهداً ويقال: إنه صام وتهجد حتى شحب لونه وتغير وكان كثير البكاء إذا سمع القرآن، وكان أميراً على كردوس - فرقة كبيرة - يوم اليرموك.';
const String p4 =
    'قال عبدالله بن الزبير رضي الله عنه: قالت أم حكيم امرأة عكرمة بن أبي جهل: يارسول الله قد هرب عكرمة منك الى اليمن، وخاف أن تقتله فأمَّنه فقال رسول الله ﷺ هو آمن فخرجت أم حكيم في طلبه ومعها غلام لها روميّ فراودها عن نفسها، فجعلت تمنيه حتى قدمت على حَيِّ من عَكّ فاستغثتهم عليه فأوثقوه رباطاً، وأدركت عكرمة وقد انتهى الى ساحل من سواحل تهامة فركب البحر، فجعل نُوتيُّ السفينة يقول له: أخلص فقال: أي شيء أقول: قال: قل لا إله إلا الله، قال عكرمة: ماهربت إلا من هذا، فجاءت أم حكيم على هذا الكلام فجعلت تلح عليه وتقول: يا ابن عم جئتك من عند أوصل الناس وأبر الناس وخير الناس لا تُهلك نفسك، فوقف لها حتى أدركته فقالت: إني قد أستأمنت لك محمداً رسول الله ﷺ ، قال: أنت فعلت؟ قالت: نعم أنا كلمته فأمنَّك فرجع معها وقال: ما لقيت من غلامك الرومي؟ فخبرته خبره فقتله عكرمة وهو يؤمئذ لم يُسلم، فلما دنا من مكة قال رسول الله ﷺ لأصحابه: يأتيكم عكرمة بن ابي جهل مؤمناً مهاجراً فلا تَسُبّوا أباه فإن سبّ الميت يؤذي الحي ولايبلغ الميت.';
const String p5 =
    'قال: وجعل عكرمة يطلب امرأته يُجامعها، فتأبى عليه وتقول: إنك كافر وأنا مسلمة فيقول: إن أمراً منعك مني لأمر كبير، فلما رأى النبي ﷺ عكرمة وثب إليه - وما على النبي ﷺ رداء - فرحاً بعكرمة ثم جلس رسول الله ﷺ فوقف بين يديه وزوجته مُتنقبة فقال: يامحمد إن هذه أخبرتني أنك أمَّنتني، فقال رسول الله ﷺ : صدقت فأنت آمن فقال عكرمة: فإلى ما تدعو يامحمد؟ قال: أدعوك الى أن تشهد أن لا إله إلا الله وأني رسول الله وأن تقيم الصلاة وتؤتي الزكاة وتفعل وتفعل، حتى عدّ خصال الاسلام، فقال عكرمة: والله مادعوت إلا الى الحق وأمر حسن جميل، قد كنت والله فينا قبل أن تدعو الى مادعوت إليه وأنت أصدقنا حديثاً وأبرُّنا برّا، ثم قال عكرمة: فإني أشهد أن لا إله إلا الله وأشهد أن محمداً عبده ورسوله، فسُرّ بذلك رسول الله ﷺ ثم قال: يارسول الله علمني خيرَ شيء أقوله فقال: تقول أشهد أن لا إله إلا الله وأن محمد عبده ورسوله فقال عكرمة: ثم ماذا؟ قال رسول الله ﷺ : تقول أشهد الله وأشهد من حضر أني مسلم مهاجر ومجاهد فقال عكرمة ذلك.';
const String p6 =
    'فقال رسول الله: لا تسألني اليوم شيئاً أعطيه أحداً إلا أعطيتكه فقال عكرمة: فإني أسألك أن تستغفر لي كل عداوة عاديتكها أو مسير وضعت فيه أو مقام لقيتك فيه أو كلام قلته في وجهك أو وأنت غائب عنه، فقال رسول الله ﷺ : اللهم أغفر له كل عداوة عادانيها وكل مسير سار فيه إلى موضع يريد بذلك المسير إطفاء نورك فاغفر له ما نال منِّي من عرض في جهي أو أنا غائب عنه، فقال عكرمة: رضيت يارسول الله لا أدع نفقة كنت أنفقها في صدّ عن سبيل الله إلا أنفقت ضعفها في سبيل الله، ولا قتالاً كنت أقاتل في صدِّ عن سبيل الله إلا أبليت ضعفه في سبيل لله ثم اجتهد في القتال حتى قتل شهيداً يوم اليرموك، وبعد أن أسلم رد رسول الله ﷺ امرأته له بذلك النكاح الأول.';
const String p7 =
    'كان سلوك النبي ﷺ في تعامله مع عكرمة لطيفاً حانياً يكفي وحده لاجتذابه الى الاسلام، فقد أعجل نفسه عن لبس ردائه وابتسم له ورحب به وفي رواية قال له: مرحباً بالراكب المهاجر، فتأثر عكرمة من ذلك الموقف فاهتزت مشاعره وتحركت أحاسيسه فأسلم، كما كان لموقف أم حكيم بنت الحارث بن هشام أثر في إسلام زوجها، فقد أخذت له الأمان من رسول الله ﷺ وغامرت بنفسها تبحث عنه لعل الله يهديه الى الاسلام كما هداها إليه، وعندما أرادها زوجها امتنعت عنه وعللت ذلك بأنه كافر وهي مسلمة، فعظم الاسلام في عينه وأدرك أنه أمام دين عظيم وهكذا خطت أم حكيم في فكر عكرمة بداية التفكير في الاسلام ثم تُوّج بإسلامه بين يدي رسول الله ﷺ ، وكان صادقاً في إسلامه فلم يطلب من رسول الله ﷺ دنياً وإنما سأله أن يغفر الله تعالى له من كل ماوقع فيه من ذنوب ماضيه، ثم أقسم أمام النبي ﷺ بأن يحمل نفسه على الإنفاق في سبيل الله تعالى بضعف ماكان ينفق في الجاهلية، وأن يُبليَ في الجهاد في سبيل الله بضعف ماكان يبذله في الجاهلية ولقد بر بوعده فكان من أشجع المجاهدين والقادة في سبيل الله تعالى في حروب الردة ثم في فتوح الشام حتى وقع شهيداً في معركة اليرموك بعد أن بذل نفسه وماله في سبيل الله.';
const String p8 =
    'أراد فضالة بن عمير بن الملوح الليثي قتل النبي ﷺ وهو يطوف بالبيت عام الفتح، فلما دنا منه قال رسول الله ﷺ : أفضالة؟ قال: نعم يارسول الله قال: ماذا كنت تحدث به نفسك؟ قال: لاشيء كنت أذكر الله، قال: فضحك النبي ﷺ ، ثم قال: استغفر الله ثم وضع يده على صدره فسكن قلبه، فكان فضالة يقول: والله مارفع يده عن صدري حتى مامنْ خلق الله شيء أحبُّ إلى منه.';
const String p9 =
    'قال عروة بن الزبير: أن امرأة سرقت في عهد رسول الله ﷺ في غزوة الفتح، ففزع قومها الى أسامة بن زيد يستشفعونه، قال عروة: فلما كلمه أسامة فيها تلون وجه رسول الله، فلما كان العشيُّ قام رسول الله خطيباً فأثنى على الله بما هو أهله ثم قال: أما بعد فإنما أهلك الناس قبلكم أنهم كانوا إذا سرق فيهم الشريف تركوه وإذا سرق فيهم الضعيف أقاموا عليه الحد والذي نفس محمد بيده لو أن فاطمة بنت محمد سرقت لقطعت يدها، ثم أمر رسول ﷺ بتلك المرأة فقطعت يدها، فحسنت توبتها بعد ذلك وتزوجت، قالت عائشة: فكانت تأتيني بعد ذلك فأرفع حاجتها الى رسول الله ﷺ .';
const String p10 =
    'قالت أم هاني بنت أبي طالب: لما نزل رسول الله ﷺ بأعلى مكة فر إليَّ رجلان من أحمائي من بني مخروم، وكانت عند هُبيرة بن أبي وهب المخزومي قالت: فدخل عليَّ عليُّ بن أبي طالب أخي فقال: والله لأقتلنهما، فأغلقت عليهما باب بيتي ثم جئت رسول الله ﷺ وهو بأعلى مكة، فوجدته يغتسل من جَفنةٍ إن فيها لأثر العجين وفاطمة ابنته تستره بثوبه فلما إغتسل أخذ ثوبه، فتوشح به، ثم صلى ثماني ركعات من الضحى ثم انصرف إليَّ فقال: مرحباً وأهلاً يا أم هانيء ماجاء بك؟ فأخبرته خبر الرجلين وخبر عليّ فقال: قد أجرنا من أجرتِ وأمنا من أمنت فلا يقتلهما.';
const String p11 =
    'كان عبدالله بن سعد بن أبي السرح قد أسلم وكتب الوحي ثم ارتد، فلما دخل رسول الله ﷺ مكة وقد أهدر دمه فر الى عثمان وكان أخاه من الرضاعة، فلما جاء به ليستأمن له صمت عنه رسول الله ﷺ طويلاً ثم قال: نعم فلما انصرف مع عثمان قال رسول الله ﷺ لمن حوله أما كان فيكم رجل رشيد يقوم الى هذا حين رآني قد صمت فيقتله، فقالوا يارسول الله هلا أو مأت إلينا؟ فقال: إن النبي لا يقتل باشارة وفي رواية إنه لاينبغي لنبي أن يكون له خائنة أعين.';
const String p12 =
    'وقال ابن هشام: أنه قد حسن إسلامه بعد ذلك وولاه عمر بعض أعماله ثم ولاه عثمان، وقال ابن كثير: ومات وهو ساجد في صلاة الصبح أو بعد انقضاء صلاتها في بيته.';
const String p13 =
    'قال ابو هريرة:.... أتى رسول الله ﷺ الصفا فعلاه حيث ينظر الى البيت فرفع يديه، فجعل يذكر الله بما شاء أن يذكره ويدعوه قال: والأنصار تحته، قال يقول بعضهم لبعض أما الرجل فأدركته رغبة في قريته ورأفة بعشيرته قال ابو هريرة: وجاء الوحي وكان إذا جاء لم يخف علينا فليس أحد من الناس يرفع طرفه الى رسول الله ﷺ حتى يقضي قال: فلما قضي الوحي رفع رأسه ثم قال: يامعشر الأنصار قلتم أما الرجل فأدركته رغبة في قريته ورأفة بعشيرته؟ قالوا: قلنا ذلك يارسول الله قال: فما اسمي اذاً؟ كلا إني عبدالله ورسوله هاجرت الى الله وإليكم، فالمحيا محياكم والممات مماتكم، قال: فأقبلوا إليه يبكون ويقولون: والله ما قلنا الذي قلنا إلا الظن بالله ورسوله قال: فقال رسول الله ﷺ : فإن الله ورسوله ليصدقانكم ويعذرانكم.';
const String p14 =
    'جواز الصوم والفطر في شهر رمضان للمسافر في غير معصية حيث صام الرسول في مسيرة الجيش من المدينة حتى بلغ كديدا فأفطر.';
const String p15 =
    'صلى النبي ﷺ صلاة الضحى ثمان ركعات خفيفة واستدل قوم بهذا على أنها سنّة مؤكدة.';
const String p16 =
    'قصر الصلاة الرباعية للمسافر، فقد اقام النبي بمكة تسعة عشر يوماً يقصر الصلاة.';
const String p17 = 'تحريم نكاح المتعة الى الأبد.';
const String p18 =
    'عدم جواز الوصية بأكثر من ثلث المال، كما في قصة سعد بن أبي وقاص حين مرضه بمكة واستشارة الرسول ﷺ في أن يوصي بأكثر من الثلث.';
const String p19 =
    'نزل رسول الله ﷺ بالحجون في المكان الذي تعاقدت فيه قريش على مقاطعة بني هاشم والمسلمين وقال عندما سأله أسامة بن زيد إن كان سينزل في بيته: وهل ترك لنا عقيل من رباع أو دور؟ مبيناً أنه لايرث المسلم الكافر، وكان عقيل قد ورث أبا طالب هو وطالب أخوه وباع الدور كلها، وأما علي وجعفر فلم يرثاه لأنهما مسلمان وأبوطالب مات كافراً.';
const String p20 =
    'لقد تحقق وعد الله بالتمكين للمؤمنين الصادقين بعد ماضحوا بالغالي والنفيس وحققوا شروط التمكين وأخذوا بأسبابه وقطعوا مرحلة وتعاملوا مع سننه كسنّة الابتلاء والتدافع والتدرج وتغيير النفوس والأخذ بالأسباب ولا ننسى تلك الصورة الرائعة وهي وقوف بلال فوق الكعبة مؤذناً للصلاة بعد أن عذب في بطحاء مكة وهو يردد أحد أحد في أغلاله وحديده هاهو اليوم قد صعد فوق الكعبة ويرفع صوته الجميل بالآذان وهو في نشوة الإيمان.';
