const int sectionIndex = 4;
const String sectionTitle = 'حفر زمزم';

const List t1 = ['1', 'بئر زمزم'];
const List t2 = ['2', 'عبد المطلب بأشراف الشام'];

const String p1 =
    'ذكر الشيخ ابراهيم العلي في كتابه القيم صحيح السيرة النبوية رواية صحيحة في قصة حفر عبد المطلب لزمزم من حديث علي بن أبي طالب رضي الله عنه.';
const String p2 =
    'حيث قال: قال عبدالمطلب: إني لنائم في الحجر إذ أتاني آت فقال لي: احفر طيبة قلت: وما طيبة؟ قال: ثم ذهب عني قال: فلما كان الغد رجعت الى مضجعي فنمت فيه فجاءني فقال: احفر برّة قال: قلت وما برّة؟ قال: ثم ذهب عني، فلما كان الغد رجعت الى مضجعي فنمت فيه فجاءني فقال: احفر المضنونة قال: قلت: وما المضنونة؟ قال: ثم ذهب فلما كان الغد رجعت الى مضجعي فنمت فيه فجائني فقال: احفر زمزم قال: قلت: وما زمزم؟ قال لاتنرف أبداً ولا تذم تسقي الحجيج الأعظم، وهي بين الفرث والدم عند نقرة الغراب الأعصم عند قرية النمل.';
const String p3 =
    'قال: فلما بين شأنها ودلّ على موضعها وعرف أنه قد صدقت غدا بمعوله ومعه ابنه الحارث بن عبدالمطلب، وليس معه يومئذ ولد غيره فحفر فيها فلما بدا لعبد المطلب الطيّ كبَّر فعرفت قريش أنه قد أدرك حاجته فقاموا إليه فقالوا: ياعبدالمطلب إنها بئر أبينا إسماعيل وإن لنا فيها حقاً فأشركنا معك فيها، قال: ما أنا بفاعل إن هذا الأمر قد خصصت به دونكم وأعطيته من بينكم، قالوا له: فأنصفنا فإنا غير تاركيك حتى نخاصمك فيها قال: فاجعلوا بيني وبينكم من شئتم أحاكمكم إليه قالوا: كاهنة بني سعد بن هذيم قال: نعم وكانت بأشراف الشام.';
const String p4 =
    'فركب عبدالمطلب ومعه نفر من بني أمية وركب من كل قبيلة من قريش نفر فخرجوا والأرض إذا ذاك مفاوز حتى إذا كانوا ببعضها نفد ماء عبدالمطلب وأصحابه فعطشوا، حتى استيقنوا بالهلكة فاستسقوا من كانوا معهم فابوا عليهم وقالوا: إنا بمفازة وإنا نخشى على أنفسنا مثل ما أصابكم، فقال عبدالمطلب: إني أرى أن يحفر كلّ رجل منكم حفرته لنفسه بمالكم الآن من القوة، فكلما مات رجل دفعه أصحابه في حفرته ثم واره حتى يكون آخرهم رجلاً واحداً فضيعة رجل واحد أيسر من ضيعة ركب جميعه فقالوا: نِعمَ ما أمرت به.';
const String p5 =
    'فحفر كل رجل لنفسه حفرة ثم قعدوا ينتظرون الموت عطشاً، ثم إن عبدالمطلب قال لأصحابه: والله إن إلقاءنا بأيدينا هكذا للموت لا ضرب في الأرض ولا نبتغي لأنفسنا لعجز فعسى الله أن يرزقنا ماء ببعض البلاد ارتحلوا فارتحلوا، حتى إذا بعث عبدالمطلب راحلته انفجرت من تحت خفها عين ماء عذب، فكبّر عبدالمطلب وكبر أصحابه ثم نزل فشرب وشرب أصحابه واستسقوا حتى ملأوا أسقيتهم، ثم دعا قبائل قريش -وهم ينظرون إليهم في جميع هذه الأحوال- فقال: هَلُّموا الى الماء فقد سقانا الله فجاءوا فشربوا واستقوا كلهم ثم قالوا: قد والله قضى لك علينا والله مانخاصمك في زمزم أبداً إن الذي سقاك هذا الماء بهذه الفلاة هو الذي سقاك زمزم، فارجع الى سقايتك راشد فرجع ورجعوا معه ولم يصلوا الى الكاهنة وخلوَّ بينه وبين زمزم.';
