const int sectionIndex = 19;
const String sectionTitle = 'الطواف على القبائل';

const List t1 = ['1', 'الطواف على القبائل طلباً للنصرة'];
const List t2 = ['2', 'من أساليب النبي ﷺ في رد المكائد'];
const List t3 = ['3', 'المفاوضات مع بني عامر'];
const List t4 = ['4', 'المفاوضات مع بني شيبان'];
const List t5 = ['5', 'الحكمة قى الطواف على القبائل'];
const List t6 = ['6', 'الإخلاص لله وليس المناصب'];

const String p1 =
    'بعد رجوعه ﷺ من الطائف بدأ يعرض نفسه على القبائل في المواسم يشرح لهم الإسلام، ويطلب منهم الإيواء والنصرة حتى يبلغ كلام الله عزوجل وكان رسول الله ﷺ يتحرك في المواسم التجارية ومواسم الحج التي تجتمع فيها القبائل وفق خطة سياسية دعوية واضحة المعالم ومحددة الأهداف، وكان يصاحبه أبو بكر الصديق الرجل الذي تخصص في معرفة أنساب العرب وتاريخها، وكانا يقصدان غرر الناس ووجوه القبائل، وكان أبو بكر رضي الله عنه، يسأل وجوه القبائل ويقول لهم كيف العدد فيكم؟ وكيف المنعة فيكم؟ وكيف الحرب فيكم؟ وذلك قبل أن يتحدث رسول الله ﷺ ويعرض دعوته.';
const String p2 =
    'مقابلة القبائل في الليل: فكان ﷺ من حكمته العالية يخرج لمقابلة القبائل في ظلام الليل، حتى لايحول بينه وبينهم أحد من المشركين وقد نجح هذا العمل في إبطال مفعول الدعاية المضادة، التي كانت تتبعها قريش، كلما اتصل الرسول ﷺ بقبيلة من القبائل، والدليل على نجاح هذا الأسلوب المضاد، اتصال الرسول ﷺ بالأوس والخزرج ليلاً، ومن ثم كانت العقبة الأولى والثانية ليلاً.';
const String p3 =
    'ذهاب الرسول ﷺ إلى القبائل في منازلهم: فقد أتى كلباً وبني حنيفة، وبني عامر في منازلهم وبذلك يحاول أن يبتعد عن مطاردة قريش، فيستطيع أن يتفاوض مع القبائل بالطريقة المناسبة دونما تشويش أو تشويه من قريش.';
const String p4 =
    'أصطحاب الأعوان: كان أبو بكر وعلي رضي الله عنهما يرافقان الرسول ﷺ في بعض مفاوضاته مع بعض القبائل، وربما كانت هذه الرفقة لأجل ألا يظن المدعوون أنه وحيد، ولا أعوان له من أشراف قومه وأقاربه، هذا إلى جانب معرفة أبي بكر رضي الله عنه بأنساب العرب، الأمر الذي يساعد الرسول ﷺ في التعرف على معادن القبائل، فيقع الاختيار على أفضلها، لتحمل تبعات الدعوة.';
const String p5 =
    'اختار الرسول ﷺ أن يجري مفاوضات مع بني عامر قامت تلك المفاوضات على دراسة وتخطيط، فالرسول وصاحبه أبو بكر كانا يعلمان أن بني عامر قبيلة مقاتلة كبيرة العدد وعزيزة الجناب، بل هي من القبائل الخمس التي لم يمسها سباء ولم تتبع لملك ولم تؤد أتاوة، مثلها مثل قريش وخزاعة كما أن الرسول ﷺ كان يعلم أن هنالك تضاداً قديماً بين بني عامر وثقيف، فإذا كانت ثقيف امتنعت عليه من الداخل فلماذا لايحاول أيضاً تطويقها من الخارج، والاستفادة في ذلك من بني عامر بن صعصعة، فإذا استطاع النبي ﷺ أن يبرم حلفاً مع بني عامر فإن موقف ثقيف سيكون على حافة الخطر، يذكر أصحاب السيرة أن الرسول ﷺ لما أتى بني عامر بن صعصعة فدعا إلى الله وعرض عليهم نفسه، قال له رجل منهم يقال له بحيرة بن فراس: والله لو أني أخذت هذا الفتى لأكلت به العرب ثم قال له: أرأيت إن نحن تابعناك على أمرك ثم أظهرك الله على من خالفك أيكون لنا الأمر من بعدك؟ قال الأمر لله يضعه حيث يشاء فقال له: أفنهدف نحورنا للعرب دونك، فإذا أظهرك الله كان الأمر لغيرنا؟ لاحاجة لنا بأمرك.';
const String p6 =
    'ففي رواية علي بن أبي طالب رضي الله عنه قال: لما أمر الله عزوجل نبيه ﷺ أن يعرض نفسه على قبائل العرب خرج وأنا معه إلى أن قال ثم دفعنا إلى مجلس آخر عليه السكينة والوقار فتقدم أبو بكر فسلم فقال من القوم؟ قالوا شيبان ابن ثعلبة فالتفت أبو بكر إلى رسول الله ﷺ وقال بأبي وأمي هؤلاء غرر الناس وفيهم مفروق قد غلبهم لساناً وجمالاً وكانت له غديرتان تسقطان على تريبته وكان أدنى القوم مجلساً من أبي بكر فقال أبو بكر كيف العدد فيكم فقال مفروق إنا لانزيد على الألف ولن تغلب ألف من قلة فقال أبو بكر وكيف المنعة فيكم فقال مفروق إنا لأشد مانكون غضباً حين نلقى وأشد مانكون لقاء حين نغضب وإنا لنؤثر الجياد على الأولاد والسلاح على اللقاح والنصر من عند الله يديلنا مرة ويديل علينا أخرى لعلك أخا قريش فقال أبو بكر: إن كان بلغكم أنه رسول الله ﷺ فها هو ذا فقال: مفروق إلام تدعونا يا أخا قريش، فقال رسول الله ﷺ أدعوكم إلى شهادة أن لا إله إلا الله وحده لاشريك له وأني عبدالله ورسوله وإلى أن تؤووني وتنصروني فإن قريشاً قد تظاهرت على الله وكذبت رسوله واستغنت بالباطل عن الحق والله هو الغني الحميد، فقال مفروق وإلام تدعو أيضاً يا أخا قريش فوالله ماسمعت كلاماً أحسن من هذا فتلا رسول الله ﷺ : قُلْ تَعَالَوْا أَتْلُ مَا حَرَّمَ رَبُّكُمْ عَلَيْكُمْ أَلاَّ تُشْرِكُوا بِهِ شَيْئًا وَبِالْوَالِدَيْنِ إِحْسَانًا وَلاَ تَقْتُلُوا أَوْلاَدَكُمْ مِنْ إِمْلاَقٍ نَحْنُ نَرْزُقُكُمْ وَإِيَّاهُمْ وَلاَ تَقْرَبُوا الْفَوَاحِشَ مَا ظَهَرَ مِنْهَا وَمَا بَطَنَ وَلاَ تَقْتُلُوا النَّفْسَ الَّتِي حَرَّمَ اللَّهُ إِلاَّ بِالْحَقِّ ذَلِكُمْ وَصَّاكُمْ بِهِ لَعَلَّكُمْ تَعْقِلُونَ - سورة الأنعام';
const String p7 =
    'كان طلب الرسول ﷺ للنصرة من خارج مكة إنما بدأ ينشط بشكل ملحوظ بعد أن اشتد الأذى عليه عَقِبَ وفاة عمه أبي طالب الذي كان يحميه من قريش، وذلك لأن من يحمل الدعوة لن يستطيع أن يتحرك التحرك الفعَّال في النشاط في حمل الدعوة وتوفير الاستجابة لها، في جوّ من العنف والضغط والإرهاب.';
const String p8 =
    'كان عرض الرسول ﷺ نفسه على القبائل يطلب منهم النصرة إنما هو بأمر من الله عزوجل له في ذلك، وليس مجرد اجتهاد من قبل نفسه اقتضته الظروف التي وصلت إليها الدعوة.';
const String p9 =
    'حصر رسول الله ﷺ طلب النصرة بزعماء القبائل وذوي الشرف والمكانة ممن لهم أتباع يسمعون لهم، ويطيعون لأن هؤلاء القادرون على توفير الحماية للدعوة وصاحبها وكان يطلب النصرة من أجل حماية تبليغ الدعوة، ومن أجل أن يتسلم النبي ﷺ مقاليد الحكم على أساس تلك الدعوة وهذا ترتيب طبيعي للأمور حتى تسير بين الناس محمية الجانب بعيدة عن الإساءة إليها وإلى أتباعها.';
const String p10 =
    'رفض النبي ﷺ أن يعطي القوى المستعدة لتقديم أية ضمانات بأن يكون لأشخاصهم شيء من الحكم والسلطان على سبيل الثمن أو المكافأة لما يقدمونه من نصرة وتأييد للدعوة الإسلامية، وذلك لأن الدعوة الإسلامية بما هي دعوة إلى الله، فالشرط الأساسي فيمن يؤمن بها ويستعد لنصرتها أن يكون الإخلاص لله ونشدان رضاه هما الغاية التي يسعى إليها من النصرة والتضحية وليس طمعاً في نفوذ أو رغبة في سلطان وذلك لأن الغاية التي يضعها الإنسان للشيء هي التي تكيف نشاط الإنسان في السعي إليه، فلابد إذن من أن تتجرد الغاية المستهدفة من وراء نصرة الدعوة عن أي مصلحة مادية لضمان دوام التأييد لها، وضمان المحافظة عليها من أي انحراف وضمان أقصى ما يمكن من بذل الدعم لها وتقديم التضحيات في سبيلها، فيجب على كل من يريد أن يلتزم بالجماعة التي تدعو إلى الله ألا يشترط عليها منصباً أو عرضاً من أعراض الدنيا لأن هذه الدعوة لله والأمر لله يضعه حيث يشاء، والداخل في أمر الدعوة إنما يريد ابتداءً وجه الله والعمل من أجل رفع رايته، أما إذا كان المنصب هو همه الشاغل فهذه علامة خطيرة تنبئ عن دخن في نية صاحبه لذا قال يحيى بن معاذ الرازي: لايفلح من شممت منه رائحة الرياسة.';
const String p11 =
    'إن الحماية المشروطة أو الجزئية لاتحقق الهدف المقصود فلن يخوض بنو شيبان حرباً ضد كسرى لو أراد القبض على رسول الله ﷺ وتسليمه، ولن يخوضوا حرباً ضد كسرى لو أراد مهاجمة محمد رسول الله ﷺ وأتباعه، وبذلك فشلت المباحثات';
const String p12 =
    'إن دين الله لن ينصره إلا من حاطه من جميع جوانبه، كان هذا الرد من النبي ﷺ على المثنى بن حارثة حين عرض على النبي ﷺ حمايته على مياه العرب دون مياه الفرس فمن يسبر أغوار السياسة البعيدة يرى بعد النظر الإسلامي النبوي الذي لايسامى.';
