const int sectionIndex = 5;
const String sectionTitle = 'حادثة الفيل';

const List t1 = ['1', 'ماخلأت القصواء'];
const List t2 = ['2', 'أبرهة الحبشى'];
const List t3 = ['3', 'الوصول إلى الطائف'];
const List t4 = ['4', 'قدومه إلى مكة'];
const List t5 = ['5', 'عبد المطلب جد رسول الله ﷺ وأبرهة'];
const List t6 = ['6', 'للبيت له رب يحميه'];
const List t7 = ['7', 'أرسال الله الطير'];
const List t8 = ['8', 'تأملات من حادثة الفيل'];

const String p1 =
    'لما خرج رسول الله ﷺ زمن الحديبية سار حتى إذا كان بالثنية التي يهبط عليهم منها بركت بها راحلته فقال الناس! حَل حَل فألحت فقالوا: خلأت القصواء فقال النبي ﷺ : ماخلأت القصواء وماذاك لها بخلق ولكن حبسها حابس الفيل.';
const String p2 =
    'وجاء في السيرة النبوية لأبي حاتم من شأن الفيل أن ملكاً كان باليمن غلب عليها وكان أصله من الحبشة يقال له أبرهة، بنى كنيسة بصنعاء فسماها القليس، وزعم أنه يَصرف إليها حَج العرب وحَلف ان يسير الى الكعبة فيهدمها، فخرج ملك من ملوك حِمْيّر فيمن أطاعه من قومه يُقال له ذو نفر فقاتله فهزمه أبرهة وأخذه، فلما أتى به قال له ذو نفر أيها الملك لا تقتلني فإن استبقائي خير لك من قتلي فاستبقاه وأوثقه ثم خرج سائراً يريد الكعبة.';
const String p3 =
    'حتى إذا دنا من بلاد خثعم خرج إليه النفيل بن حبيب الخثعمي ومن اجتمع إليه من قبائل اليمن فقاتلوه فهزمهم وأخذ النفيل فقال النفيل: أيها الملك! إني عالم بأرض العرب فلا تقتلني وهاتان يداي على قومي بالسمع والطاعة، فاستبقاه وخرج معه يَدله حتى إذا بلغ الطائف خرج معه مَسعود بن معتب في رجال ثقيف فقال: أيها الملك نحن عبيد لك ليس لك عندنا خلاف وليس بيننا وبينك الذي تريد -يعنون- اللات إنما تريد البيت الذي بمكة نحن نبعث معك من يدلك عليه، فبعثوا معه مَولى لهم يُقال له أبو رغال فخرج معهم حتى إذا كان بالمغمس مات أبو رغال وهو الذي رجم قبره، وبعث أبرهة من المغمس رجلاً يقال له الأسود بن مقصود على مقدمة خيله، فجمع إليه أهل الحرم وأصاب لعبدالمطلب مائتي بعير بالأرك.';
const String p4 =
    'ثم بعث أبرهة حناطة الحميري الى أهل مكة فقال: سل عن شريفها ثم أبلغه أني لم آت لقتال إنما جئت لأهدم هذا البيت، فانطلق حناطة حتى دخل مكة فلقي عبدالمطلب بن هاشم فقال: إن الملك أرسلني إليك ليخبرك أنه لم يأتِ لقتال إلا أن تقاتلوه إنما جاء لهدم هذا البيت ثم الإنصراف عنكم فقال عبدالمطلب ماعندنا له قتال فقال سنخلي بينه وبين البيت فإن خلى الله بينه وبينه فوالله مالنا به قوة.';
const String p5 =
    'ثم قال: فانطلق معي إليه قال: فخرج معه حتى قدم المعسكر وكان "ذو نفر" صديقاً لعبد المطلب فاتاه فقال: ياذا نفر هل عندكم من غناء فيما نزل بنا؟ فقال: ماغناء رجل أسير لا يأمن من أن يقتل بُكرة أو عشية، ولكن سأبعث لك الى أنيس سائس الفيل فامره أن يصنع لك عند الملك مااستطاع من خير ويُعظم خطرك ومنزلتك عنده قال فأرسل الى انيس، فأتاه فقال: إن هذا سيد قريش صاحب عين مكة الذي يُطعم الناس في السهل والوحوش في الجبال، وقد أصاب له الملك مائتي بعير فإن استطعت أن تنفعه فانفعه فإنه صديق لي.';
const String p6 =
    'فدخل أنيس على أبرهة فقال: أيها الملك! هذا سيد قريش وصاحب عين مكة الذي يُطعم الناس في السهل والوحوش في الجبال، يستأذن عليك وأنه أحب أن تأذن له فقد جاءك غير ناصب لك ولا مخالف عليك فأذن له، وكان عبدالمطلب رجلاً عظيماً جسيماً وسيماً فلما رآه أبرهة عظمه وأكرمه وكره أن يجلس معه على سريره وأن يجلس تحته فهبط الى البساط فجلس عليه معه.';
const String p7 =
    'فقال له عبدالمطلب: أيها الملك إنك قد أصبت لي مالاً عظيماً فاردده عليّ فقال له: لقد أعجبتني حين رأيتك ولقد زهدت فيك قال: ولمَ؟ قال: جئت الى بيت هو دينك ودين آبائك وعصمتكم ومنعتكم لأهدمه، فلم تُكلمني فيه وتكلمني في مائتي بعير لك قال: أنا رب هذه الإبل ولهذا البيت رب سيمنعه قال: ماكان ليمنعه منى قال: فأنت وذاك قال: فأمر بإبله فرُدت عليه.';
const String p8 =
    'ثم خرج عبدالمطلب وأخبر قريش الخبر وأمرهم أن يتفرقوا في الشعاب، وأصبح ابرهة بالمغمس قد تهيأ للدخول وعبأ جيشه وقرب فيله وحمل عليه ما أراد أن يحمل وهو قائم، فلما حركه وقف وكاد أن يرزم الى الأرض فيبرك فضربوه بالمعول في رأسه فأبى، فأدخلوا محاجنه تحت أقرانه ومرافقه فأبى فوجهوه الى اتجاه اليمن فهرول فصرفوه الى الحرم فوقف، ولحق الفيل بجبل من تلك الجبال، فأرسل الله الطير من البحر كالبلسان مع كل طير ثلاثة أحجار حَجران في رجليه وحَجر في منقاره ويحملن أمثال الحمص والعدس من الحجارة فإذا غشين القوم أرسلنها عليهم.';
const String p9 =
    'فلم تُصب تلك الحجارة أحداً إلا هلك وليس كل القوم أصيب، فذلك قول الله تعالى: أَلَمْ تَرَى كَيْفَ فَعَلَ رَبُّكَ بِأَصْحَابِ الْفِيلِ أَلَمْ يَجْعَلْ كَيْدَهُمْ فِي تَضْلِيلٍ وَأَرْسَلَ عَلَيْهِمْ طَيْرًا أَبَابِيلَ تَرْمِيهِمْ بِحِجَارَةٍ مِنْ سِجِّيلٍ فَجَعَلَهُمْ كَعَصْفٍ مَأْكُولٍ - سورة الفيل';
const String p10 =
    'وبعث الله على أبرهة داء في جسده ورجعوا سراعاً يتساقطون في كل بلد وجعل أبرهة تتساقط أنامله كلما سقط انملة اتبعها مدة من قيح ودم فانتهى الى اليمن وهو مثل فرخ الطير فيمن بقي من أصحابه ثم مات .';
const String p11 =
    'بيان شرف الكعبة أول بيت وضع للناس وكيف أن مشركي العرب كانت تعظمه وتقدسه ولا يقدمون عليه شيء وتعود هذه المنزلة الى بقايا ديانة ابراهيم واسماعيل عليهما الصلاة والسلام.';
const String p12 =
    'حسد النصارى وحقدهم على مكة وعلى العرب الذين يعظمون هذا البيت.';
const String p13 =
    'التضحية في سبيل المقدسات: قام ملك من ملوك حِميَرفي وجه جيش إبرهة ووقع الملك أسيراً، وقام النفيل بن حبيب الخثعمي ومن اجتمع معه من قبائل اليمن فقاتلوا إبرهة إلا أنهم انهزموا أمام الجيش العرمرم وبذلوا دماءهم دفاعاً عن مقدساتهم.';
const String p14 =
    'خونة الأمة مخذولون: فهؤلاء العملاء الذين تعاونوا مع إبرهة وصاروا عيوناً له وجواسيس وأرشدوه الى بيت الله العتيق ليهدمه، لعنوا في الدنيا والآخرة لعنهم الناس ولعنهم الله سبحانه وتعالى وأصبح قبر أبي رغال رمزاً للخيانة والعمالة وصار ذاك الرجل مبغوضاً في قلوب الناس وكلما مر أحد على قبره رجمه.';
const String p15 =
    'حقيقة المعركة بين الله وأعدائه: في قول عبدالمطلب زعيم مكة: سنخلي بينه وبين البيت فإن خلى الله بينه وبينه فوالله مالنا به قوة، وهذا تقرير دقيق لحقيقة المعركة بين الله وأعدائه فمهما كانت قوة العدو وحشوده، فإنها لاتستطيع الوقوف لحظة واحدة أمام قدرة الله وبطشه ونقمته فهو سبحانه واهب الحياة وسالبها في أي وقت شاء.';
const String p16 =
    'قصة الفيل من دلائل النبوة: قال الماوردي رحمه الله: آيات الملك باهرة وشواهد النبوة ظاهرة تشهد مباديها بالعواقب، فلا يلتبس فيها كذب يصدق ولا منتحل بحق وبحسب قوتها وانتشارها يكون بشائرها وإنذارها، ولما دنا مولد رسول الله ﷺ تعاطرت آيات نبوته وظهرت آيات بركته فكان من أعظمها شأناً وأشهرها عياناً وبياناً أصحاب الفيل إلى أن قال: وآية الرسول في قصة الفيل أنه كان في زمانه حملاً في بطن أمه بمكة لأنه ولد بعد خمسين يوماً من الفيل وبعد موت أبيه في يوم الإثنين الثاني عشر من شهر ربيع الأول.';
const String p17 =
    'جعل الحادثة تاريخٌ للعرب استعظم العرب ماحدث لأصحاب الفيل فأرخوا به وقالوا وقع هذا عام الفيل وولد فلان عام الفيل ووقع هذا بعد عام الفيل بكذا من السنين وعام الفيل صادف عام 570م .';
