const int sectionIndex = 66;
const String sectionTitle = 'غزوة حنين';

const List t1 = ['1', 'هوازن وثقيف'];
const List t2 = ['2', 'الوصول لحنين '];
const List t3 = ['3', 'تعبئة جيش هوازن وثقيف'];
const List t4 = ['4', 'مباغتة جيش المسلمين'];
const List t5 = ['5', 'مفاجأة المسلمين بالكمائن'];
const List t6 = ['6', 'خطوات الرسول ﷺ لصد هذه الحشود'];
const List t7 = ['7', 'ثبات رسول ﷺ فى أرض المعركة'];
const List t8 = ['8', 'حينَ حمِي الوطيسُ'];
const List t9 = ['9', 'نزول الملائكة'];
const List t10 = ['10', 'مطاردة فلول الفارين'];
const List t11 = ['11', 'أساليب رسول الله ﷺ في القتال'];
const List t12 = ['12', 'اختيار رسول الله ﷺ مكان القتال'];
const List t13 = ['13', 'استخدام الحرب النفسية والدعاية'];
const List t14 = ['14', 'الحكمة من رفع الحصار'];
const List t15 = ['15', 'لارجعة للوثنية'];
const List t16 = ['16', 'الاعجاب بالكثرة يحجب نصر الله'];
const List t17 = ['17', 'الغنائم وسيلة لتأليف القلوب'];
const List t18 = ['18', 'تأثر الأنصار من توزيع الغنائم'];
const List t19 = ['19', 'رضينا برسول الله قسماً وحظاً'];
const List t20 = ['20', 'الصبر على جفاء الأعراب'];
const List t21 = ['21', 'تعامله صلى مع هوازن لما أسلمت'];
const List t22 = ['22', 'السياسة النبوية الحكيمة'];

const String p1 =
    'لما فتح الله مكة على رسوله والمؤمنين وخضعت له قريش خافت هوازن وثقفيف، قالوا: قد فرغ محمد لقتالنا فلنغزه قبل أن يغزونا وأجمعوا أمرهم على هذا وولَّوا عليهم ملك بن عوف النَّصري، فاجتمع إليه هوازن وثقيف وبني هلال، ولم يحضرها من هوازن كعب وكلاب وكان معهم دريد بن الصمة، وكان معروفاً بشدة البأس في الحرب وأصالة الرأي إلا أنه كان كبيراً فلم يكن له إلا الرأي والمشورة.';
const String p2 =
    'وكان رأي مالك بن عوف أن يخرجوا وراءهم النساء والذراري والأموال حتى لايفروا، فلما علم بذلك دريد سأله: لم ذلك؟ فقال: أردت أن أجعل خلف كل رجل أهله وماله ليقاتل عنهم فقال دريد: راعي ضأن والله وهل يرد المنهزم شئ؟ إنها إن كانت لك لم ينفعك إلا رجل بسيفه ورمحه، وإن كانت عليك فضحت في أهلك ومالك!! ولكنه لم يستمع لمشورته.';
const String p3 =
    'تحرك المسلمون باتجاه حنين في اليوم الخامس من شوال ووصلوا حنين في مساء العاشر من شوال، وقد استخلف الرسول ﷺ عتاب بن أسيد على مكة عند خروجه وكان عدد جيش المسلمين اثني عشر ألفاً من المسلمين أما عدد هوازن وثقيف، فكانوا ضعف عدد المسلمين أو أكثر، ولما رأى بعض الطلقاء جيش المسلمين قالوا: لن نغلب اليوم من قلة ودخل الأعجاب في النفوس.';
const String p4 =
    'رفع مالك بن عوف زعيم هوازن وثقيف الروح المعنوية لدى جنوده حيث وقف مالك خطيباً في جيشه وحثهم على الثبات والاستبسال، ومما قال في هذا الجمع الحاشد: إن محمداً لم يقاتل قط قبل هذه المرة، وإنما كان يلقي قوماً أغماراً، لاعلم لهم بالحرب فيُنصر عليهم.';
const String p5 =
    'حشر ذراري المقاتلين وأموالهم خلف الجيش حيث أمر قائد هوازن بحشد نساء المقاتلين وأطفالهم وأموالهم خلفهم وقد قصد من وراء هذا التصرف، دفع المقاتلين إلى الاستبسال والثبات أمام أعدائهم، لأن المقاتل -من وجهة نظره- إذا شعر أن أعزّ مايملك وراءه في المعركة صعب عليه أن يلوذ بالفرار مخلفاً ماوراءه في ميدان المعركة، وعن أنس بن مالك رضي الله عنه قال: إفتتحنا مكة ثم غزونا حنيناً فجاء المشركون بحنين صفوف رأيت، قال: فصفت الخيل ثم صفّت المقاتلة ثم صفّت النساء من وراء ذلك ثم صفت الغنم ثم صفت النعم.';
const String p6 =
    'تجريد السيوف وكسر أجفانها حيث جرت عادة العرب في حروبهم أن يكسروا أجفان سيوفهم قبل بدء القتال، وهذا التصرف يؤذن بإصرار المقاتل على الثبات أمام الخصم حتى النصر أو الموت، وقد أمر مالك جنده بذلك تحقيقاً لهذا، بدليل قولهم، إذا أنتم رأيتم القوم فاكسروا جفون سيوفكم وشدوا شدّة رجل واحد عليهم.';
const String p7 =
    'وضع الكمائن لمباغتة جيش المسلمين والانقضاض عليهم حيث كانت عند مالك بن عوف النصري معلومات وافية عن الأرض التي ستدور عليها المعركة ولهذا رأى أن يستغل هذه الظروف الطبيعية لصالح جيشه، فعمل بمشورة الفارس المحنك دريد بن الصمة في نصب الكمائن لجيوش المسلمين، وقد كادت هذه الخطة أن تقضي على قوات المسلمين لولا لطف الله سبحانه وتعالى وعنايته.';
const String p8 =
    'وكان ضمن الخطة التي رسمها القائد الهوازني الأخذ بزمام المبادرة ومهاجمة المسلمين، لأن النصر في الغالب يكون للمهاجم، أما المدافع فغالباً مايكون في مركز الضعف، ولهذا آتت هذه الخطة ثمارها بعض الوقت، ثم انقلبت موازين القوى -بفضل الله تعالى- ثم بثبات رسول الله ﷺ حيث كسب المسلمون الجولة وانتصروا على أعدائهم.';
const String p9 =
    'كان من ضمن بنود الخطة الحربية التي رسمها القائد مالك بن عوف الهوزاني، استعمال سلاح معنوي له تأثير كبير في النفوس، فقد شنَّ الحرب النفسية ضد المسلمين من أجل إلقاء الخوف في نفوسهم، وذلك بأن عمد إلى عشرات الآلاف من الجمال التي صحبها معه في الميدان فجعلها وراء جيشه ثم أركب عليها النساء، فكان لذلك المشهد منظر مهيب يحسب من يراه أن هذا الجيش مائة ألف مقاتل، وهو ليس كذلك.';
const String p10 =
    'بلغ النبي ﷺ عزم هوازن على حربه فأرسل عبدالله بن أبي حدرد الأسلمي حتى يوافيه بخبر هوازن فذهب رضي الله عنه ومكث بينهم يوماً أو يومين وعاد على وجه السرعة بخبر هؤلاء الأعداء، إلا أنه قصَّر رضي الله عنه في أداء هذا الواجب حيث لم يختلط بهوازن اختلاطاً كاملاً بحيث يسمع ويرى مايُدبر ضد المسلمين هناك، وكان من أهم مايجب أن يعنى به معرفة مواقع المشركين التي احتلوها وقد فوجئ المسلمون باختفاء تلك الكمائن التي نصبها الأعداء في منحنيات الوادي حتى استطاعوا أن يمطروا المسلمين بوابل من سهامهم فانهزموا في الجولة الأولى، فكان الجهل بهذه الكمائن أحد الأسباب الرئيسية وراء هزيمة المسلمين في أول المعركة وماحدث نتيجة لهذا الخطأ لايقدح في العصمة الثابتة لرسول الله ﷺ ، لأن هذا الأمر ليس وحياً من الله سبحانه وتعالى وإنما هو من باب الاجتهاد في الأمور العسكرية وقد بذل النبي ﷺ جهده في سبيل الحصول على أدق المعلومات وأوفاها لكي يضع على ضوئها الخطة العسكرية المناسبة لمجابهة العدو.';
const String p11 =
    'أعدّ رسول الله ﷺ جيشاً قوامه عشرة آلاف وهم من خرجوا معه من المدينة، وألفان من مسلمة الفتح فكان عدد من خرج في تلك الغزوة أثني عشر ألفاً، عن أنس بن مالك رضي الله عنه قال: لما كان يوم حنين أقبلت هوازن وغطفان بذراريهم وَنَعمهم ومع النبي ﷺ يؤمئذ عشرة آلاف ومعه الطلقاء وهم ألفان، وسعى ﷺ لتأمين عدة الجيش فطلب من ابن عمه نوفل بن الحارث بن عبدالمطلب ثلاثة آلاف رمح إعارة، وطلب من صفوان بن أمية دروعاً وتكفل ﷺ بالضمان وكان نوفل وصفوان لايزالان على شركهم، عن صفوان بن يعلي بن أمية عن أبيه عن النبي ﷺ قال: إذا أتتك رسلي فأعطهم -أو قال فادفع إليهم- ثلاثين درعاً، وثلاثين بعيراً، أو أقل من ذلك فقال له: العارية مؤداة يارسول الله، قال: فقال النبي ﷺ نعم، وفي رواية: أن رسول الله ﷺ استعاد منه يوم حنين دروعاً فقال: أغصباً يامحمد؟ قال: لا بل عارية مضمونة فقال: فضاع بعضها فعرض عليه رسول الله ﷺ أن يضعها له فقال: أنا اليوم يارسول الله في الإسلام أرغب. قال أبو داود: وكان أعاره قبل أن يسلم ثم أسلم.';
const String p12 =
    'لقد باغت المشركون المسلمين وأمطرهم الأعداء من جميع الجهات، فاضطربت صفوفهم وماج بعضهم في بعض، ونتيجة لهول هذا الموقف انهزم معظم الجيش ولاذوا بالفرار، كل يطلب النجاة لنفسه، وبقي الرسول ﷺ ونفر قليل في الميدان يتصدّون لهجمات المشركين.';
const String p13 =
    'يصف لنا العباس عمّ الرسول ﷺ ذلك المشهد المهيب حيث يقول: شهدت مع رسول الله ﷺ يوم حنين فلزمت أنا وأبو سفيان ابن الحارث رسول الله ﷺ فلم نفارقه، ورسول الله ﷺ على بغلة له بيضاء، فلما التقى المسلمون والكفار ولى المسلمون مدبرين، فطفق رسول الله ﷺ يركض بغلته قبل الكفار، قال العباس: وأنا آخذ بلجام بغلة رسول الله ﷺ أكفها إرادة أن لاتسرع.';
const String p14 =
    'فقال رسول الله ﷺ : أي عباس! نادِ أصحاب السَمُرَة، فقال العباس -وكان رجلاً صيتاً- فقلت: بأعلى صوتي: أين أصحاب السَّمُرة؟ قال فوالله! لكأن عطفتهم حين سمعوا صوتي عطفة البقر على أولادها، فقالوا: يا لبيك يا لبيك ! قال فاقتلوا الكفار والدعوة في الأنصار، يقولون: يامعشر الأنصار ! يامعشر الأنصار، قال: ثم قصرت الدعوة على بني الحارث من الخزرج فنظر رسول الله ﷺ وهو على بغلته، كالمتطاول عليها إلى قتالهم فقال رسول الله ﷺ : هذا حين حمي الوطيس.';
const String p15 =
    'لقد أيّد الله نبيه ﷺ يوم حنين بأمور منها: نزول الملائكة من السماء وسلاح الرعب ومن الأسلحة المادية تأثير قبضتي الحصى والتراب اللتين رمى بهما وجوه المشركين، حيث دخل في أعينهم كلهم من ذلك الحصى والتراب اللتين رمى بهما وجوه المشركين حيث دخل في أعينهم كلهم من ذلك الحصى والتراب فصار كل واحد يجد لها في عينيه أثراً، فكان من أسباب هزيمتهم قال العباس رضي الله عنه: ثم أخذ رسول الله ﷺ حصيات فرمى بهنّ وجوه الكفار، ثم قال: انهزموا وربّ محمد، قال: فذهبت أنظر فإذا القتال على هيئة فيما أرى قال: فوالله ماهو إلاّ أن رماهم بحصياته فما زالت أرى حدّهم كليلاً وأمرهم مدبراً.';
const String p16 =
    'قال أبو موسى الأشعري رضي الله عنه: لما فرغ النبي ﷺ من حنين بعث أبا عامر على جيش إلى أوطاس، فلقى دُريد بن الصمة، فقتل دريد وهزم الله أصحابه، قال أبو موسى: وبعثني مع أبي عامر فرُمي أبو عامر في ركبته، رماه جُشميُّ بسهم فأثبته في رُكبته. فانتهيت إليه فقلت: ياعم من رماك؟ فاشار إلى أبي موسى فقال: ذاك قاتلي الذي رماني فقصدت له فلحقته، فلما رآني وَلَّى فأتبعته وجعلت أقول له: ألا تستحي ألا تثبت فكفَّ، فاختلفنا ضربتين بالسيف فقتله، ثم قلت لأبي عامر قتل الله صاحبك فقال: فانزع هذا السهم فنزعته فنزا منه الماء.';
const String p17 =
    'حاصر رسول الله ﷺ أهل الطائف واستخدم أساليب متنوعة في القتال والحصار ومارس الشورى، واختار المكان المناسب عند الحصار واستخدم ﷺ أسلوباً جديداً في القتال وهو :';
const String p18 =
    'المنجنيق: فقد ثبت أن الرسول ﷺ استعمل هذا السلاح عند حصاره لحصن ثقيف بالطائف، فعن مكحول رضي الله عنه: أن النبي ﷺ نصب المنجنيق على أهل الطائف.';
const String p19 =
    'الدبابة: وهى على شكل بيت صغير تعمل من الخشب وتتخذ للوقاية من سهام الأعداء، عندما يُراد نقض جدار الحصن بحيث إذا دخلها الجنود كان سقفها حرزاً لهم من الرمي.';
const String p20 =
    'الحسك الشائك: وهو من وسائل الدفاع الثابتة ويعمل من خشبتين تسمّران على هيئة الصليب، حتى تتألف منها أربعة شعب مدببة، وإذا رُمي في الأرض بقيت شعبة منه بارزة تتعثر بها أقدام الخيل والمشاة، فتتعطل حركة السير السريعة المطلوبة في ميدان القتال.';
const String p21 =
    'نزل الجيش في مكان مكشوف قريب من الحصن وماكاد الجند يضعون رحالهم حتى أمطرهم الأعداء بوابل من السهام فأصيب من جراء ذلك ناس كثيرون وحينئذ عرض الحباب بن المنذر على الرسول ﷺ فكرة التحول من هذا الموقع إلى مكان آمن من سهام أهل الطائف، فقبل ﷺ هذه المشورة وكلَّف الحباب لكونه من ذوي الخبرات الحربية الواسعة في هذا المجال بالبحث عن موقع ملائم لنزول الجند، فذهب رضي الله عنه ثم حدد المكان المناسب وعاد فأخبر النبي ﷺ بذلك، فأمر النبي ﷺ جيشه بالتحول إلى المكان الجديد وهذا شاهد عيان يحدثنا عن مارأى قال عمرو بن أمية الضمري رضي الله عنه: لقد أطلع علينا من نبلهم ساعة نزلنا شيء الله به عليم كأنه رجل جراد وترسنا لهم حتى أصيب ناس من المسلمين بجراحة ودعا رسول الله ﷺ الحباب فقال: انظر مكاناً مرتفعاً مستأخراً عن القوم، فخرج الحباب حتى انتهى إلى موضع مسجد الطائف خارج من القرية - المسجد المعروف الآن بمسجد ابن عباس - فجاء إلى النبي ﷺ فأخبره، فأمر النبي ﷺ أن يتحولوا.';
const String p22 =
    'لما اشتدت مقاومة أهل الطائف وقتلوا مجموعة من المسلمين أمر النبي ﷺ بتحريق بساتين العنب والنخل في ضواحي الطائف للضغط على ثقيف ثم أوقف هذا العمل بعد أثره في معنوياتهم وإضعافه روح المقاومة، وبعد أن نشادته ثقيف بالله وبالرحم أن يترك هذا العمل ووجه النبي ﷺ نداء لعبيد الطائف أن من ينزل من الحصن ويخرج إلى المسلمين فهو حر، فخرج ثلاثة وعشرون من العبيد منهم أبو بكرة الثقفي فأسلموا، فأعتقهم ولم يعدهم إلى ثقيف بعد إسلامها.';
const String p23 =
    'كانت حكمة رسول الله ﷺ في رفع الحصار واضحة فالمنطقة المحيطة بها لم تعد تابعة لها، بل صارت ضمن سيادة الدولة الإسلامية، ولم تعد تستمد قوتها إلا من امتناع حصونها، فحصارها ورفعه سواء أمام القائد المحنك، وقد استشار رسول الله ﷺ من حوله في عملية الحصار فقال نوفل بن معاوية الديلي: ثعلب في جحر إن أقمت عليه أخذته، وإن تركته لم يضرك فأمر رسول الله ﷺ ابن الخطاب فأذن في الناس بالرحيل، فضج الناس من ذلك وقالوا: نرحل ولم يفتح علينا الطائف؟ فقال رسول الله ﷺ : فاغدوا على القتال فغدوا فأصبت المسلمين جراحات، فقال رسول الله ﷺ : إنا قافلون غداً إن شاء الله، فسُرُّوا بذلك وأذعنوا وجعلوا يرحلون، ورسول الله ﷺ يضحك، فلما ارتحلوا واستقلُّوا وقال: قولوا: آيبون تائبون عابدون لربنا حامدون، وقيل يارسول الله: ادع الله على ثقيف فقال: اللهم اهدِ ثقيفاً وائتِ بهم.';
const String p24 =
    'خرج مع رسول ﷺ إلى حنين بعض حديثي العهد بالجاهلية وكانت لبعض القبائل شجرة عظيمة خضراء يقال لها ذات أنواط يأتونها كل سنة فيعلقون أسلحتهم عليها ويذبحون عندها ويعكفون عليها يوماً، وبينما هم يسيرون مع رسول الله ﷺ إذ وقع بصرهم على الشجرة، فتحلبت أفواههم على أعياد الجاهلية التي هجروها ومشاهدها التي طال عهدهم بها، فقالوا: يارسول الله: إجعل لنا ذات أنواط كما لهم ذات أنواط، فقال رسول الله ﷺ : الله أكبر ! قلتم والذي نفس محمد بيده كما قال قوم موسى لموسى: اجعل لنا إلهاً كما لهم آلهة، قال: إنكم قوم تجهلون لتركبن سنن من كان قبلكم.';
const String p25 =
    'الاعجاب بالكثرة حجب عن المسلمين النصر في بداية المعركة وقد عبر القرآن الكريم عن ذلك بقوله: لَقَدْ نَصَرَكُمُ اللَّهُ فِي مَوَاطِنَ كَثِيرَةٍ وَيَوْمَ حُنَيْنٍ إِذْ أَعْجَبَتْكُمْ كَثْرَتُكُمْ فَلَمْ تُغْنِ عَنْكُمْ شَيْئًا وَضَاقَتْ عَلَيْكُمُ الأَرْضُ بِمَا رَحُبَتْ ثُمَّ وَلَّيْتُمْ مُدْبِرِينَ - سورة التوبة';
const String p26 =
    'وقد نبه إلى هذا رسول الله ﷺ حينما أوضح أنه لاحول ولاقوة إلا بالله فيقول: اللهم بك أحاول وبك أصول وبك أقاتل.';
const String p27 =
    'وهكذا أخذ الرسول ﷺ يراقب المسلمين ويقوّم ما يظهر من انحرافات في التصور والسلوك حتى في أخطر ظروف المواجهة مع خصومه العتاة، ومع الرغم من الهزيمة التي لحقت بالمسلمين في بداية غزوة حنين وفرار معظم المسلمين في ميدان المعركة لأنهم فوجئوا بما لم يتوقعوه إلا أن رسول الله ﷺ لم يعنف أحداً ممن فر عنه حتى حينما طالبه بعض المسلمين أن يقتل الطلقاء لأنهم فروا لم يوافق على هذا.';
const String p28 =
    'رأى ﷺ أن يتألف الطلقاء والأعراب بالغنائم تأليفاً لقلوبهم لحداثة عهدهم بالإسلام فأعطى لزعماء قريش وغطفان وتميم عطاء عظيماً إذ كانت عطية الواحد منهم مائة من الإبل ومن هؤلاء: أبو سفيان بن حرب وسهيل بن عمرو وحكيم بن حزام وصفوان بن أمية وعيينة بن حصن الفزاري والأقرع بن حابس ومعاوية ويزيد ابنا أبي سفيان وقيس بن عدي، وكان الهدف من هذا العطاء المجزي هو تحويل قلوبهم من حب الدنيا إلى حب الإسلام أو كما قال أنس بن مالك: إن كان الرجل ليسلم ما يريد إلا الدنيا فما يسلم حتى يكون الإسلام أحب إليه من الدنيا وما عليها، وعبر عن هذا صفوان بن أمية: لقد أعطاني رسول الله ﷺ ما أعطاني وأنه لابغض الناس إلي فما برح يعطيني حتى أنه لأحب الناس إلي.';
const String p29 =
    'وقد تأثر حدثاء الأنصار من هذا العطاء بحكم طبيعتهم البشرية وترددت بينهم قالة فراعى ﷺ هذا الاعتراض وعمل على إزالة التوتر وبين لهم الحكمة في تقسيم الغنائم وخاطب الأنصار خطاباً إيمانياً عقلياً عاطفياً وجدانياً مايملك القارئ المسلم على مر الدهور وكر العصور وتوالي الزمان إلا البكاء عندما يمر بهذا الحدث العظيم، فعندما دخل سعد بن عبادة على رسول الله ﷺ فقال: يارسول الله إن هذا الحي من الأنصار قد وجدوا عليك في أنفسهم لما صنعت في هذا الفئ الذي أصبت، قسمت في قومك وأعطيت عطايا عظاماً في قبائل العرب، ولم يكن في هذا الحيِّ من الأنصار منها شيء، قال: فأين أنت من ذلك ياسعد قال: يارسول الله ما أنا إلا من قومي.';
const String p30 =
    'فقال رسول الله ﷺ لسعد بن عبادة: اجمع لي قومك في هذه الحظيرة؟ قال: فجاء رجال من المهاجرين فتركهم فدخلوا، وجاء آخرون فردهم فلما اجتمعوا وأتى سعد، فقال: قد اجتمع لك هذا الحيُّ من الأنصار، فأتاهم رسول الله ﷺ .';
const String p31 =
    'فحمد الله وأثنى عليه بما هو أهله ثم قال: يامعشر الأنصار ما قالة بلغتني عنكم، وجدة وجدتموها في أنفسكم، ألم آتكم ضلالاً فهداكم الله بي وعالة فأغناكم الله بي وأعداء فألف الله بين قلوبكم قالوا: الله ورسوله أمن وأفضل، ثم قال: ألا تجيبوني يامعشر الأنصار قالوا: بماذا نجيبك يارسول الله ولله ولرسوله المن والفضل.';
const String p32 =
    'قال: أما والله لو شئتم لقلتم فلصدقتم ولصُدِّقتم: أتيتنا مكذبا فصدقناك ومخذولاً فنصرناك وطريداً فأويناك وعائلاً فآسيناك، أوجدتم عليَّ يامعشر الأنصار في أنفسكم في لعاعة من الدنيا تألفت بها قوماً ليسلموا ووكلتكم إلى إسلامكم، إلا ترضون يامعشر الأنصار أن يذهب الناس بالشَّاء والبعير وترجعون برسول الله إلى رحالكم فو الذي نفس محمد بيده لما تنقلبون به خير مما ينقلبون به.';
const String p33 =
    'ولولا الهجرة لكنت امرءاً من الأنصار، ولو سلك الناس شعباً ووادياً وسلكت الأنصار شِعْباً ووادياً لسلكت شعب الأنصار وواديها، الانصار شعار والناس دثار اللهم ارحم الأنصار وأبناء الأنصار وأبناء أبناء الأنصار، قال فبكى القوم حتى أخضلوا لحاهم، وقالوا: رضينا برسول الله ﷺ قسماً وحظاً، ثم انصرف رسول الله وتفرقوا وفي رواية: إنكم ستلقون بعدي أثرة فاصبروا حتى تلقوني على الحوض.';
const String p34 =
    'لقد ظهر من رسول الله ﷺ الكثير من الصبر على جفاء الأعراب وطمعهم في الأموال وحرصهم على المكاسب، فكان مثالاً للمربي الذي يدرك أحوالهم وما جبلتهم عليه بيئتهم وطبيعة حياتهم من القساوة والفظاظة والروح الفردية، فكان يبين لهم خلقه ويطمئنهم على مصالحهم ويعاملهم على قدر عقولهم، فكان بهم رحيماً ولهم مربياً ومصلحاً، فلم يسلك معهم مسلك ملوك عصره مع رعاياهم الذين كانوا ينحنون أمامهم أو يسجدون وكانوا دونهم محجوبين، وإذا خاطبوهم التزموا بعبارات التعظيم والإجلال كما يفعل العبد مع ربه أما الرسول عليه الصلاة والسلام فكان كأحدهم يخاطبونه ويعاتبونه ولا يحتجب عنهم قط، وكان الصحابة رضوان الله عليهم يراعون التأدب بحضرته ويخاطبونه بصوت خفيض ويكنون له في أنفسهم المحبة العظيمة، وأما جفاة الأعراب فقد عنفهم القرآن على سوء أدبهم وجفائهم وارتفاع أصواتهم وجرأتهم في طبيعة مخاطبتهم للرسول ﷺ وهذه مواقف تدل على حسن معاملة رسول الله ﷺ للأعراب.';
const String p35 =
    'جاء وفد هوازن لرسول الله بالجعرانة وقد أسلموا فقالوا يارسول الله إنا أصل وعشيرة وقد أصابنا من البلاء مالم يخف عليك فامنن علينا منّ الله عليك وقام خطيبهم زهير بن صرد أبو صرد فقال: يارسول الله إنما في الحظائر من السبايا خالاتك وحواضنك اللاتي كن يكفلنك ولو أنا ملحنا لابن أبي شمر أو النعمان بن المنذر ثم أصابنا منها مثل الذي أصابنا منك رجونا عائدتهما وعطفهما وأنت رسول الله خير المكفولين فكان هذا سبب إعتاقهم عن بكرة أبيهم فعادت فواضله عليه السلام عليهم قديماً وحديثاً وخصوصاً وعموماً.';
const String p36 =
    'فلما سمع رسول الله ﷺ من الوفد قال لهم: نساؤكم وأبناؤكم أحب أليكم أم أموالكم؟ فقالوا يارسول الله خيرتنا بين أحسابنا وأموالنا؟ بل أبناؤنا ونساؤنا أحب إلينا، فقال رسول الله أما ما كان لي ولبني عبدالمطلب فهو لكم، وإذا أنا صليت بالناس فقوموا فقولوا إنا نستشفع برسول الله ﷺ إلى المسلمين، وبالمسلمين إلى رسول الله ﷺ في أبنائنا ونسائنا فإني سأعطيكم عند ذلك وأسأل لكم.';
const String p37 =
    'فلما صلَّى رسول الله ﷺ بالناس الظهر قاموا فقالوا ما أمرهم به رسول الله ﷺ فقال: أما ما كان لي ولبني عبدالمطلب فهو لكم، فقال المهاجرون وما كان لنا فهو لرسول الله ﷺ وقالت الأنصار وما كان لنا فهو لرسول الله ﷺ وقال الأقرع بن حابس: أما أنا وبنو تميم فلا، وقال عيينه: أما أنا وبنو فزارة فلا، وقال العباس بن مرداس السلمي: أما أنا وبنو سليم فلا، فقالت بنو سليم بل ما كان لنا فهو لرسول الله ﷺ ، قال عباس بن مرداس لبني سليم وهنتموني؟ فقال رسول الله ﷺ : من أمسك منكم بحقه فله بكل إنسان ستة فرائض من أول فئ نصيبه فردوا إلى الناس نساءهم وأبناءهم، وفي رواية:... فخطب رسول الله ﷺ في المؤمنين فقال: إن إخوانكم هؤلاء جاؤونا تائبين، وإني أردت أن أرد إليهم سبيهم، فمن أحب منكم أن يطيب ذلك فليفعل، ومن أحب أن يكون على حظه حتى نعطيه إياه من أول مايفيء الله علينا فليفعل، فقال الناس: طيبنا يارسول الله لهم، فقال لهم: إنا لاندري من أذن منكم فيه ممن لم يأذن، فارجعوا حتى يرفع إلينا عرفاءكم أمركم فرجع الناس فكلمهم عرفاؤهم ثم رجعوا إلى النبي ﷺ فأخبروه أنهم طيبوا وأذنوا.';
const String p38 =
    'وقد سُر الرسول ﷺ بإسلام هوازن وسألهم عن زعيمهم مالك بن عوف النصري، فأخبروه أنه في الطائف مع ثقيف، فوعدهم برد أهله وأمواله عليه، وإكرامه بمائة من الإبل إن قدم عليه مسلماً، فجاء مالك مسلماً فأكرمه وأمّره على قومه وبعض القبائل المجاورة لقد تأثر مالك بن عوف وجادت قريحته لمدح النبي ﷺ فقال:';
const String p39 = 'ما إن رأيت ولاسمعت بمثله.. في الناس كلهم بمثل محمد';
const String p40 = 'أوفى وأعطى للجزيل إذا اجتذي.. ومتى تشاء يخبر عمّا في غدِ';
const String p41 = 'وإذا الكتيبة عرّدت أنيابها.. بالسمهري وضرب كل مهند';
const String p42 = 'فكأنه ليث على أشباله.. وسط الهباءة خادر في مرصد';
const String p43 =
    'عرّدت: اشتدت وضربت - الهباءة: غبار الحرب - الخادر: المقيم في عرينه';
const String p44 =
    'لقد كانت سياسته ﷺ مع خصومه مرنة إلى أبعد الحدود وبهذه السياسة الحكيمة استطاع ﷺ أن يكسب هوازن وحلفاءها إلى صف الإسلام واتخذ من هذه القبيلة القوية رأس حربة يضرب بها قوى الوثنية في المنطقة ويقودها زعيمهم مالك بن عوف الذي قاتل ثقيفاً في الطائف حتى ضيق عليهم، وقد فكر زعماء ثقيف في الخلاص من المأزق بعد أن أحاط الإسلام بالطائف من كل مكان فلا تستطيع تحركاً ولاتجارة، فمال بعض زعماء ثقيف إلى الإسلام مثل عروة بن مسعود الثقفي الذي سارع إلى اللحاق برسول الله ﷺ وهو في طريقه إلى المدينة بعد أن قسم غنائم حنين واعتمر من الجعرانة، فالتقى به قبل أن يصل إلى المدينة، وأعلن إسلامه، وعاد إلى الطائف، وكان من زعماء ثقيف محبوباً عندهم، فدعاهم إلى الإسلام وأذَّن في أعلى منزله فرماه بعضهم بسهام فأصابوه فطلب من قومه أن يدفنوه مع شهداء المسلمين في حصار الطائف.';
const String p45 =
    'إن الإنسان ليعجب من فقه النبي ﷺ في معاملة النفوس وفي سعيه الحثيث لتمكين دين الله تعالى، لقد استطاع ﷺ أن يزيل معالم الوثنية، وبيوتات العبادة الكفرية من مكة وماحولها، ورتب ﷺ الأمور التنظيمية للأراضي التي أضيفت للدولة الإسلامية، فعين عتاب بن أسيد أميراً على مكة، وجعل معاذ بن جبل مرشداً وموجهاً ومعلماً ومربياً، وعين على هوازن مالك بن عوف قائداً ومجاهداً ثم اعتمر ورجع إلى المدينة ﷺ .';
