const int sectionIndex = 18;
const String sectionTitle = 'الإسراء والمعراج';

const List t1 = ['1', 'ذروة التكريم'];
const List t2 = ['2', 'البراق وبيت المقدس'];
const List t3 = ['3', 'السماء الأولى'];
const List t4 = ['4', 'السماء الثانية'];
const List t5 = ['5', 'السماء الثالثة'];
const List t6 = ['6', 'السماء الرابعة'];
const List t7 = ['7', 'السماء الخامسة '];
const List t8 = ['8', 'السماء السادسة '];
const List t9 = ['9', 'السماء السابعة '];
const List t10 = ['10', 'سدرة المنتهى'];
const List t11 = ['11', 'فرض الصلاة'];
const List t12 = ['12', 'الرجوع من الرحلة'];
const List t13 = ['13', 'تأملات من الإسراء والمعراج'];

const String p1 =
    'كان وجود أبي طالب بجانب رسول الله سياجاً واقياً لرسول الله يمنع عنه أذى قريش، لأن قريشاً ماكانت تريد أن تخسر أبا طالب ولما توفي أبو طالب انهار هذا الحاجز ونال رسول الله من الضر الجسدي الشيء الكثير.';
const String p2 =
    'أما  خديجة فكانت البلسم الشافي لما يصيب رسول الله من الجراح النفسية التي يلحقها به المشركون، ولما خرج رسول الله ﷺ الى الطائف، فما كان جوابهم إلا أن ردوه أقبح رد ولم يكتفوا بذلك، بل أرسلوا الى قريش رسولاً يخبرهم بما جاء به محمد فتجهمت له قريش وضمرت له الشر، فلم يستطع رسول الله دخول مكة إلا بجوار رجل كافر.';
const String p3 =
    'إن الله عز وجل أراد أن يتيح لرسوله فرصة الاطلاع على المظاهر الكبرى لقدرته حتى يملأ قلبه ثقة فيه وإستناداً إليه حتى يزداد قوة في مهاجمة سلطان الكفار القائم في الأرض، كما حدث لموسى عليه السلام فقد شاء الله أن يريه عجائب قدرته.';
const String p4 =
    'قال تعالى: وَلَقَدْ رَآهُ نَزْلَةً أُخْرَىٰ عِندَ سِدْرَةِ الْمُنتَهَىٰ عِندَهَا جَنَّةُ الْمَأْوَىٰ إِذْ يَغْشَى السِّدْرَةَ مَا يَغْشَىٰ مَا زَاغَ الْبَصَرُ وَمَا طَغَىٰ لَقَدْ رَأَىٰ مِنْ آيَاتِ رَبِّهِ الْكُبْرَىٰ - سورة النجم';
const String p5 =
    'عن أنس بن مالك رضي الله عنه قال: قال رسول الله ﷺ أتيت بالبراق وهو دابة أبيض طويل فوق الحمار ودون البغل يضع حافره عند منتهى طرفه قال: فركبته حتى أتيت بيت المقدس قال: فربطته بالحلقة التي يربط بها الأنبياء، قال: ثم دخلت المسجد فصليت فيه ركعتين ثم خرجت فجاءني جبرئيل عليه السلام بإناء من خمر وإناء من لبن فاخترت اللبن، فقال: جبريل أخترت الفطرة.';
const String p6 =
    'وفي حديث مالك بن صعصعة: إن نبي الله ﷺ حدثهم عن ليلة أسري به قال: بينما أنا في الحطيم - هو مابين الركن والمقام - وربما قال في الحجر مضطجعاً إذ أتاني آت - هو مابين الركن والمقام -، فقدَّ قال: وسمعته يقول: فشق مابين هذه الى هذه، فقلت الجارود - وهو الى جانبي : مايعني به؟ قال: من ثغرة نحره الى شعرته وسمعته يقول: من قصه الى شعرته فاستخرج قلبي، ثم أتيت بطست من ذهب مملؤ إيماناً، فغسل قلبي، ثم حشى، ثم أعيد، ثم أتيت بدابة دون البغل وفوق الحمار أبيض فقال له الجارود: هو البراق يا أبا حمزة؟ قال أنس: نعم يضع خطوه عند أقصى طرفه.';
const String p7 =
    'فحملت عليه فانطلق بي جبريل حتى أتيت السماء الدنيا فاستفتح قيل: من هذا ؟ قال: جبريل ، قيل: ومن معك؟ قال: محمد ، قيل: وقد أرسل إليه؟ ، قال: نعم قيل: مرحباً به فنعم المجيء جاء ففتح، فلما خلصت فإذا فيها آدم فقال: هذا أبوك آدم فسلم عليه فسلمت عليه فرد السلام، ثم قال: مرحباً بالابن الصالح، والنبي الصالح.';
const String p8 =
    'ثم صعد بي حتى أتى السماء الثانية فاستفتح قيل: من هذا؟ قال: جبريل، قال: ومن معك؟ قال: محمد قيل: وقد أرسل إليه؟ قال: نعم، قيل: مرحباً به فنعم المجيء جاء، ففتح فلما خلصت إذا يحيى وعيسى وهما ابنا خالة قال: هذا يحيى وعيسى فسلم عليهما فسلمت فردا ثم قالا: مرحباً بالأخ الصالح والنبي الصالح.';
const String p9 =
    'ثم صُعد بي الى السماء الثالثة فاستفتح قيل: من هذا؟ قال: جبريل، قيل: ومن معك؟ قال: محمد، قيل وقد أرسل إليه؟ قال: نعم، قيل: مرحباً به فنعم المجيئ جاء، ففتح فلما خلصت إذا يوسف قال: هذا يوسف فسلم عليه فسلمت عليه، فرد ثم قال: مرحباً بالأخ الصالح والنبي الصالح.';
const String p10 =
    'ثم صُعد بي حتى أتى السماء الرابعة فاستفتح قيل: من هذا ؟ قال: جبريل قيل: ومن معك؟ قال: محمد قيل: أو قد أرسل إليه قال: نعم قيل: مرحباً به فنعم المجيء جاء، ففتح فلما خلصت فإذا إدريس، قال : هذا إدريس فسلم عليه فسلمت عليه فرد ثم قال: مرحباً بالأخ الصالح والنبي الصالح.';
const String p11 =
    'ثم صُعد بي حتى أتى السماء الخامسة فاستفتح قيل: من هذا؟ قال جبريل: قيل: ومن معك؟ قال: محمد ﷺ قيل: وقد أرسل إليه؟ قال: نعم قيل مرحباً به فنعم المجيء جاء ففتح، فلما خلصت فإذا هارون قال: هذا هارون فسلم عليه فسلمت عليه فرد ثم قال: مرحباً بالأخ الصالح والنبي الصالح.';
const String p12 =
    'ثم صُعد بي حتى أتى السماء السادسة فاستفتح: قيل: من هذا ؟ قال: جبريل قيل: ومن معك؟ قال: محمد قيل: وقد ارسل إليه؟ قال: نعم قال: مرحباً به، فنعم المجيء جاء فلما خلصت، فإذا موسى، قال: هذا موسى فسلم عليه، فرد ثم قال: مرحباً بالأخ الصالح، والنبي الصالح فلما تجاوزت بكى قيل له: ما يبكيك؟ قال: أبكي لأن غلاماً بعث بعدي يدخل الجنة من أمته أكثر ممن يدخلها من أمتي.';
const String p13 =
    'ثم صعد بي الى السماء السابعة فاستفتح جبريل: قيل: من هذا؟ قال: جبريل، قيل: ومن معك قال: محمد قيل: وقد بعث إليه؟ قال: نعم قال: مرحباً به ونعم المجيء جاء، فلما خلصت فإذا إبراهيم، قال: هذا أبوك فسلم عليه، قال فسلمت عليه فرد السلام، ثم قال: مرحباً بالابن الصالح والنبي الصالح.';
const String p14 =
    'ثم رفعت لي سدرة فإذا نبقها مثل قلال هجر، وإذا ورقها مثل آذان الفيلة، قال: هذه سدرة المنتهى وإذا أربعة أنهار نهران باطنان ونهران ظاهران، فقلت: ما هذان ياجبريل؟ قال: أما البطنان فنهران في الجنة، وأما الظاهران فالنيل والفرات ثم رفع لي البيت المعمور.';
const String p15 =
    'ثم أتيت بإناء من خمر، وإناء من لبن، وإناء من عسل، فأخذت اللبن، فقال: هي الفطرة التي أنت عليها وأمتك.';
const String p16 =
    'ثم فرضت عليّ الصلاة خمسين صلاة كل يوم فرجعت فممرت على موسى فقال: بما أمرت؟ قال: أمرت بخمسين صلاة كل يوم قال: إن أمتك لاتستطيع خمسين صلاة كل يوم، وإني والله قد جربت الناس قبلك وعالجت بني اسرائيل أشد المعالجة فارجع الى ربك فاسأله التخفيف لأمتك، فرجعت فوضع عني عشراً فرجعت الى موسى فقال : مثله فرجعت فوضع عني عشراً، فرجعت الى موسى فقال: مثله، فرجعت فوضع عني عشراً فرجعت الى موسى فقال مثله، فرجعت فأمرت بعشر صلوات كل يوم فرجعت فقال مثله فرجعت فأمرت بخمس صلوات كل يوم، فرجعت إلى موسى فقال: بما أمرت؟ قلت: أمرت بخمس صلوات كل يوم قال: إن أمتك لاتستطيع خمس صلوات كل يوم، وإني قد جربت الناس قبلك وعالجت بني إسرائيل أشد المعالجة فارجع إلى ربك فاسأله التخفيف لأمتك قال: سألت ربي حتى استحييت ولكن أرضى وأسلم، قال: فلما جاوزت نادى مناد: أمضيت فريضتي وخففت عن عبادي.';
const String p17 =
    'فلما رجع رسول الله ﷺ من رحلته الميمونة أخبر قومه بذلك فقال لهم في مجلس حضره المطعم بن عدي، وعمرو بن هشام والوليد بن المغيرة فقال: إني صليت الليلة العشاء في هذا المسجد ، وصليت به الغداة، وأتيت فيما دون ذلك بيت المقدس فَنُشر لي رهط من الأنبياء منهم إبراهيم وموسى وعيسى وصليت لهم وكلمتهم فقال عمرو بن هشام كالمستهزئ به: صفهم لي فقال: أما عيسى ففوق الربعة ودون الطول عريض الصدر ظاهر الدم جعد أشعر تعلوه صهبة كأنه عروة بن مسعود الثقفي، وأما موسى فضخم آدم طوال كأنه من رجال شنوءة متراكب الأسنان، مقلص الشفة، خارج اللثة عابس وأما إبراهيم فوالله إنه لأشبه الناس بي خَلْقاً وخُلقاً.';
const String p18 =
    'فقالوا: يامحمد فصف لنا بيت المقدس، قال:دخلت ليلاً وخرجت منه ليلاً فأتاه جبريل بصورته في جناحه، فجعل يقول: باب منه كذا في موضع كذا وباب منه كذا في موضع كذا.';
const String p19 =
    'ثم سألوه عن عيرهم ، فقال لهم: أتيت على عير بني فلان بالرّوحاء، قد أضلوا ناقة لهم، فانطلقوا في طلبها فانتهيت إلى رحالهم ليس بها منهم أحد وإذا قدح ماء فشربت منه فاسألوهم عن ذلك قالوا: هذه والإله آية: ثم انتهيت إلى عير بني فلان فنفرت مني الإبل، وبرك منها جمل أحمر عليه جُوالق مخطط ببياض لاأدري أكسر البعير أم لا فاسألوهم عن ذلك قالوا: هذه والإله آية ثم انتهيت إلى عير بني فلان في التنعيميقدمها جمل أورق وها هي تطلع عليكم من الثنية فقال الوليد بن المغيرة ساحر فانطلقوا فنظروا فوجدوا الأمر كما قال، فرموه بالسحر وقالوا: صدق الوليد بن المغيرة فيما قال.';
const String p20 =
    'كانت هذه الحادثة فتنة لبعض الناس ممن كانوا آمنوا وصدقوا بالدعوة، فارتدوا وذهب بعض الناس إلى أبي بكر الصديق رضي الله عنه فقالوا: هل لك إلى صاحبك يزعم أنه أسري به الليلة إلى بيت المقدس.';
const String p21 =
    'قال: أو قال ذلك؟ قالوا: نعم قال: لئن كان قال ذلك لقد صدق قالوا: أو تصدقه أنه ذهب الليلة إلى بيت المقدس وجاء قبل أن يصبح؟ قال: نعم إني لأصدقه فيما هو أبعد من ذلك أصدقه بخبر السماء في غدوة أو روحة فلذلك سُميَّ أبو بكر الصديق.';
const String p22 =
    'إن الرسول ﷺ كان مُقدماً على مرحلة جديدة مرحلة الهجرة والإنطلاق لبناء الدولة، يريد الله تعالى للَّبنات الأولى في البناء أن تكون سليمة قوية متراصة متماسكة، فجعل الله هذا الاختبار والتمحيص، ليخلص الصف من الضعاف المترددين والذين في قلوبهم مرض ويثبت المؤمنين الأقوياء والخلص الذين لمسوا عياناً صدق نبيهم بعد أن لمسوه تصديقاً وشهدوا مدى كرامته على ربه فأي حظ يحوطهم وأي سعد يغمرهم وهم حول هذا النبي المصطفى وقد آمنوا به وقدموا حياتهم فداء له ولدينهم، كم يترسخ الإيمان في قلوبهم أمام هذا الحدث الذي تم بعد وعثاء الطائف وبعد دخول مكة بجوار وبعد أذى الصبيان والسفهاء.';
const String p23 =
    'شجاعة النبي ﷺ العالية تتجسد في مواجهته للمشركين بأمر تنكره عقولهم ولا تدركه في أول الأمر تصوراتهم ولم يمنعه من الجهر به الخوف من مواجهتهم وتلقي نكيرهم واستهزائهم ، فضرب بذلك ﷺ لأمته أروع الأمثلة في الجهر بالحق أمام أهل الباطل وإن تحزبوا ضد الحق وجندوا لحربه كل مافي وسعهم وكانت من حكمة النبي ﷺ في إقامة الحجة على المشركين بأن حدثهم عن إسرائه إلى بيت المقدس وأظهر الله له علامات تلزم الكفار بالتصديق.';
const String p24 =
    'شرب رسول الله ﷺ اللبن حين خيّر بينه وبين الخمر وبشارة جبريل عليه الصلاة والسلام: هديت للفطرة تؤكد أن هذا الإسلام دين الفطرة البشرية التي ينسجم معها فالذي خلق الفطرة البشرية خلق لها هذا الدين الذي يلبي نوازعها واحتياجاتها ويحقق طموحاتها ويكبح جماحها فَأَقِمْ وَجْهَكَ لِلدِّينِ حَنِيفًا فِطْرَةَ اللَّهِ الَّتِي فَطَرَ النَّاسَ عَلَيْهَا لاَ تَبْدِيلَ لِخَلْقِ اللَّهِ ذَلِكَ الدِّينُ الْقَيِّمُ وَلَكِنَّ أَكْثَرَ النَّاسِ لاَ يَعْلَمُونَ - سورة الروم';
const String p25 =
    'إدراك الصحابة لأهمية المسجد الأقصى وهو يقع أسيراً تحت حكم الرومان فحرروه في عهد عمر بن الخطاب رضي الله عنه وظل ينعم بالأمن والأمان حتى عاث الصليبيون فساداً فيه بعد خمسة قرون من هجرة المصطفى ومكثوا مايعادل قرناً يعيثون فساداً فحرره المسلمون بقيادة صلاح الدين الأيوبي وهاهو ذا يقع تحت الاحتلال اليهودي فما الطريق إلى تخليصه؟';
