const int sectionIndex = 1;
const String sectionTitle = 'مقدمة';

const List t1 = ['1', 'مقدمة'];
const List t2 = ['2', 'الإقتداء برسول الله ﷺ'];
const List t3 = ['3', 'سيرة رسول الله ﷺ'];
const List t4 = ['4', 'نشر دين الله'];

const String p1 = 'بسم الله الرحمن الرحيم';
const String p2 =
    'إن الحمدلله نحمده ونستعينه ونستغفره ونعوذ بالله من شرور أنفسنا ومن سيئات أعمالنا، من يهده الله فلا مضل له ومن يضلل فلا هادي له، وأشهد أن لا إله إلا الله وحده لاشريك له وأشهد أن محمداً عبده ورسوله .. أما بعد';

const String p3 =
    'يارب لك الحمد حتى ترضى ولك الحمد إذا رضيت ولك الحمد بعد الرضى .. أما بعد';
const String p4 =
    'إن دراسة الهدي النبوي له أهميته لكل مسلم فهو يحقق عدة أهداف، من أهمها الإقتداء برسول الله ﷺ من خلال معرفة شخصيته ﷺ وأعماله وأقواله وتقريراته وتكسب المسلم محبة الرسول ﷺ وتنميه وتباركه، ويتعرف على حياة الصحابة الكرام الذين جاهدوا مع رسول الله ﷺ ، فتدعوه تلك الدراسة لمحبتهم والسير على نهجهم واتباع سبيلهم، كما أن السيرة النبوية توضح للمسلم حياة الرسول ﷺ بدقائقها وتفاصيلها منذ ولادته، وحتى موته مروراً بطفولته وشبابه ودعوته وجهاده وصبره، وانتصاره على عدوه وتظهر بوضوح أنه كان زوجاً وأباً وقائداً ومحارباً وحاكماً وسياسياً ومربياً وداعية وزاهداً وقاضياً وعلى هذا فكل مسلم يجد بغيته فيها.';
const String p5 =
    'فالداعية يجد له في سيرة رسول الله ﷺ أساليب الدعوة ومراحلها المتسلسلة، ويتعرف على الوسائل المناسبة لكل مرحلة من مراحلها، فيستفيد منها في اتصاله بالناس ودعوتهم للإسلام ويستشعر الجهد العظيم الذي بذله رسول الله ﷺ من أجل إعلاء كلمة الله، وكيف التصرف أمام العوائق والعقبات والصعوبات وماهو الموقف الصحيح أمام الشدائد والفتن؟ ويجد المربي في سيرته ﷺ دروساً نبوية في التربية والتأثير على الناس بشكل عام، وعلى أصحابه الذين رباهم على يده وكلأهم بعنايته فأخرج منهم جيلاً قرآنياً فريداً وكوّن منهم أمة هي خير أمة أخرجت للناس تأمر بالمعروف وتنهى عن المنكر وتؤمن بالله واقام بهم دولة نشرت العدل في مشارق الأرض ومغاربها.';
const String p6 =
    'ويجد القائد المحارب في سيرته ﷺ نظاماً محكماً ومنهجاً دقيقاً في فنون قيادة الجيوش والقبائل والشعوب والأمة، فيجد نماذج في التخطيط واضحة ودقة في التنفيذ بينة وحرصاً على تجسيد مبادئ العدل وإقامة قواعد الشورى بين الجند والأمراء والراعي والرعية، ويتعلم منها السياسي كيف كان ﷺ يتعامل مع أشد خصومه السياسيين المنحرفين كرئيس المنافقين عبدالله بن أبي سلول الذي أظهر الإسلام وأبطن الكفر والبغض لرسول الله ﷺ ، وكيف كان يحوك المؤامرات وينشر الإشاعات التي تسيء إلى رسول الله ﷺ لإضعافه وتنفير الناس منه، وكيف عامله رسول الله ﷺ وصبر عليه وعلى حقده حتى ظهرت حقيقته للناس فنبذوه جميعاً حتى أقرب الناس له وكرهوه والتفوا حول قيادة النبي ﷺ .';
const String p7 =
    'وقد قام رسول الله ﷺ وأصحابه بتحقيق شروط التمكين فحققوا الإيمان بكل معانيه وكافة أركانه، ومارسوا العمل الصالح بكل أنواعه، وحرصوا على كل أنواع الخير وصنوف البر وعبدوا الله عبودية شاملة في كافة شؤون حياتهم، وحاربوا الشرك بكل أشكاله وأنواعه وخفاياه، وأخذوا بأسباب التمكين المادية والمعنوية على مستوى الأفراد والجماعة حتى أقاموا دولتهم في المدينة ومن ثم نشروا دين الله بين الشعوب والأمم.';
const String p8 =
    'إن تأخر المسلمين اليوم عن القيادة العالمية لشعوب الأرض نتيجة منطقية لقوم نسوا رسالتهم وحطوا مكانتها وشابوا معدنها بركام هائل من الأوهام في مجال العلم والعمل على حد سواء وأهملوا السنن الربانية وظنوا أن التمكين قد يكون بالأماني والأحلام.';
const String p9 =
    'إن هذا الضعف الإيماني والجفاف الروحي والتخبط الفكري والقلق النفسي والشتات الذهني والانحطاط الخلقي الذي أصاب المسلمين بسبب الفجوة الكبيرة التي حدثت بين الأمة والقرآن الكريم والهدي النبوي الشريف وعصر الخلفاء الراشدين والنقاط المشرقة المضيئة في تاريخنا المجيد.';
