const int sectionIndex = 33;
const String sectionTitle = 'غزوة بني قينقاع';

const List t1 = ['1', 'المواقف العدائية لليهود'];
const List t2 = ['2', 'فى سوق بني قينقاع'];
const List t3 = ['3', 'ضرب الحصار على اليهود'];
const List t4 = ['4', 'مصير يهود بني قينقاع'];
const List t5 = ['5', 'فقه النبي ﷺ في تعامل مع المنافق ابن سلول'];
const List t6 = ['6', 'موالاة ابن سلول لليهود وبراءة عبادة بن الصامت'];

const String p1 =
    'وقعت الغزوة فى شوال  فى السنة الثانية للهجرة، واتفق معظم من كتب في مغازي رسول الله ﷺ وسيرته على أنها وقعت بعد معركة بدر.';
const String p2 =
    'لم يلتزم يهود بني قينقاع بالمعاهدة التي ابرمها الرسول ﷺ معهم ووقفوا من الرسول ﷺ والمسلمين مواقف عدائية، فأظهروا الغضب والحسد عندما انتصر المسلمون في بدر وجاهروا بعداوتهم للمسلمين، وقد جمعهم النبي ﷺ في سوقهم بالمدينة ونصحهم ودعاهم إلى الإسلام وحذّرهم أن يصيبهم ما أصاب قريشاً في بدر غير أنهم واجهوا النبي ﷺ بالتحدي والتهديد، رغم ما يفترض أن يلتزموا به من الطاعة والمتابعة لبنود المعاهدة التي جعلتهم تحت رئاسته فقد جابهوه بقولهم: يامحمد لايغرنك من نفسك أنك قتلت نفراً من قريش كانوا أغماراً لايعرفون القتال إنك لو قاتلتنا لعرفت إنا نحن الناس وإنك لم تلق مثلنا، وهكذا بدأت الأزمة تتفاعل.';
const String p3 =
    'أخذ اليهود فرصة سانحة حقيرة لمناوشة المسلمين عندما جاءت امرأة من العرب قدمت بجلب لها فباعته بسوق بني قينقاع، وجلست إلى صائغ لها فجعلوا يريدونها على كشف وجهها فأبت، فعمد الصائغ إلى طرف ثوبها فعقده إلى ظهرها فلما قامت انكشفت سوءتها فضحكوا بها فصاحت فوثب رجل من المسلمين على الصائغ فقتله وكان يهودياً وشدت اليهود على المسلم فقتلوه فاستصرخ أهل المسلم المسلمين على اليهود فغضب المسلمون فوقع الشر بينهم وبين بني قينقاع.';
const String p4 =
    'فحين علم رسول الله ﷺ بذلك، سار إليهم على رأس جيش من المهاجرين والأنصار وذلك يوم السبت للنصف من شوال من السنة الثانية للهجرة، وكان الذي حمل لواء المسلمين يومئذ حمزة بن عبدالمطلب رضي الله عنه واستخلف ﷺ على المدينة أبا لبابة بن عبدالمنذر العمري واسمه بشير، وحين سار إليهم رسول الله ﷺ نبذ إليهم العهد كما أمره الله تعالى في قوله: وَإِمَّا تَخَافَنَّ مِنْ قَوْمٍ خِيَانَةً فَانْبِذْ إِلَيْهِمْ عَلَى سَوَاءٍ إِنَّ اللَّهَ لا يُحِبُّ الْخَائِنِينَ - سورة الأنفال';
const String p5 =
    'حين علم اليهود بمقدمه ﷺ تحصنوا في حصونهم فحاصرهم النبي ﷺ خمس عشرة ليلة - كما ذكر ابن هشام واستمر الحصار حتى قذف الله في قلوبهم الرعب واضطروا للنزول على حكمه ﷺ فقد فاجأهم ﷺ بهذا بأسلوب الحصار فأربكهم وأوقعهم في حيرة من أمرهم، بعد أن قطع عنهم كل مدد وجمد حركتهم فعاشوا في سجن مما جعلهم في النهاية ييأسون من المقاومة والصبر فبعد أن كانوا يهددون رسول الله ﷺ وبأنهم قوم يختلفون بأساً وشدة عن مشركي قريش إذا بهم يضطرون للنزول على حكم رسول الله ﷺ ، فأمر بهم فربطوا فكانوا يكتفون أكتافاً واستعمل رسول الله ﷺ على كتافهم المنذر بن قدامة السلمي الأوسي.';
const String p6 =
    'حاول ابن سلول زعيم المنافقين أن يحلّ حلفائه من وثاقهم فعندما مرّ عليهم قال: حلّوهم فقال المنذر: أتحلون قوماً ربطهم رسول الله ﷺ والله لا يحلهم رجل إلا ضربت عنقه فاضطر عبدالله بن أبي بن سلول أن يتراجع عن أمره ويلجأ إلى استصدار الأمر من النبي ﷺ بفك أسرهم فأتى رسول الله ﷺ فقال: يامحمد أحسن في موالي -وكانوا حلفاء الخزرج- قال: فأبطأ عليه رسول الله ﷺ فقال يامحمد: أحسن في موالي قال: فأعرض عنه فأدخل ابن أبي يده في جيب، ودرع رسول الله ﷺ فقال له رسول الله ﷺ : أرسلني وغضب رسول الله ﷺ حتى رأوا لوجهه ظللاً ثم قال:ويحك أرسلني قال: لا والله لا أرسلك حتى تحسن في موالي أربع مائة حاسر وثلاثة مائة دارع قد منعوني من الأحمر والأسود تحصدهم في غداة واحدة، إني والله امرؤ أخشى الدوائر: فقال رسول الله ﷺ : هم لك.';
const String p7 =
    'فخلى رسول الله ﷺ سبيلهم ثم أمر بإجلائهم وغنم رسول الله ﷺ والمسلمون ماكان لديهم من مال وقد تولى جمع أموالهم وإحصاءها محمد بن مسلمة رضي الله عنه وحاول ابن أبي بن سلول أن يحدث رسول الله ﷺ في يهود بني قينقاع لكي يُقرّهم في ديارهم فوجد على باب رسول الله ﷺ عُويم بن ساعدة الأنصاري الأوسي فردّه عويم وقال: لاتدخل حتى يأذن رسول الله ﷺ لك فدفعه ابن أبي فغلّظ عليه عويم حتى جحش وجه ابن أبي الجدار فسال الدم.';
const String p8 =
    'ويظهر في هذا الخبر فقه النبي ﷺ السياسي حيث لبى طلب ابن سلول، فلعل هذا الموقف يغسل قلبه ويزيل الغشاوة عنه فتتم هدايته فقال له: هم لك ولعل الذين يسيرون وراء زعامة ابن أبي يصلحون بصلاحه فيتماسك الصف ويلتحم فلا يتأثر من كيد أعداء الإسلام.';
const String p9 =
    'وهناك بُعدٌ آخر حيث حرص ﷺ أن يتفادى حدوث فتنة في مجتمع المؤمنين حيث أن بعض الأنصار حديثي عهد بالإسلام ويُخشى أن يؤثر فيهم رأس المنافقين عبدالله بن أبي لسمعته الكبيرة فيهم، ولذلك سلك ﷺ معه أسلوب المداراة والصبر عليه وعلى إساءاته تجنباً للفتنة وإظهاراً لحقيقة الرجل من خلال تصرفاته ومواقفه عند من يجهلها، ومن ثم يفر الناس من حوله ولايتعاطفون معه، وقد حقق هذا الأسلوب نجاحاً باهراً فقد ظهرت حقيقة ابن سلول لجميع الناس حتى أقرب الناس إليه ومنهم ولده عبدالله فكانوا بعدها إذا تكلم أسكتوه وتضايقوا من كلامه بل أرادوا قتله كما سيأتي بإذن الله تعالى.';
const String p10 =
    'لما نقضت العهد بنو قينقاع وكان عبادة بن الصامت أحد بني عوف - لهم من حلف بني قينقاع مثل الذي لهم من عبدالله بن أبي مشى لرسول الله ﷺ وخلعهم إليه وتبرأ إلى الله عزوجل وإلى رسوله ﷺ من حلفهم وقال: يارسول الله أتولى الله ورسوله ﷺ والمؤمنين وأبرأ من حلف هؤلاء الكفار وولايتهم، ونزلت الاّيات فى براءة عبادة بن الصامت:';
const String p11 =
    'قال تعالى: يَاأَيُّهَا الَّذِينَ ءَامَنُوا لا تَتَّخِذُوا الْيَهُودَ وَالنَّصَارَى أَوْلِيَاءَ بَعْضُهُمْ أَوْلِيَاءُ بَعْضٍ وَمَنْ يَتَوَلَّهُمْ مِنْكُمْ فَإِنَّهُ مِنْهُمْ إِنَّ اللَّهَ لا يَهْدِي الْقَوْمَ الظَّالِمِينَ فَتَرَى الَّذِينَ فِي قُلُوبِهِمْ مَرَضٌ يُسَارِعُونَ فِيهِمْ يَقُولُونَ نَخْشَى أَنْ تُصِيبَنَا دَائِرَةٌ فَعَسَى اللَّهُ أَنْ يَأْتِيَ بِالْفَتْحِ أَوْ أَمْرٍ مِنْ عِنْدِهِ فَيُصْبِحُوا عَلَى مَا أَسَرُّوا فِي أَنْفُسِهِمْ نَادِمِينَ وَيَقُولُ الَّذِينَ ءَامَنُوا أَهَؤُلاءِ الَّذِينَ أَقْسَمُوا بِاللَّهِ جَهْدَ أَيْمَانِهِمْ إِنَّهُمْ لَمَعَكُمْ حَبِطَتْ أَعْمَالُهُمْ فَأَصْبَحُوا خَاسِرِينَ يَاأَيُّهَا الَّذِينَ ءَامَنُوا مَنْ يَرْتَدَّ مِنْكُمْ عَنْ دِينِهِ فَسَوْفَ يَأْتِي اللَّهُ بِقَوْمٍ يُحِبُّهُمْ وَيُحِبُّونَهُ أَذِلَّةٍ عَلَى الْمُؤْمِنِينَ أَعِزَّةٍ عَلَى الْكَافِرِينَ يُجَاهِدُونَ فِي سَبِيلِ اللَّهِ وَلا يَخَافُونَ لَوْمَةَ لائِمٍ ذَلِكَ فَضْلُ اللَّهِ يُؤْتِيهِ مَنْ يَشَاءُ وَاللَّهُ وَاسِعٌ عَلِيمٌ إِنَّمَا وَلِيُّكُمُ اللَّهُ وَرَسُولُهُ وَالَّذِينَ ءَامَنُوا الَّذِينَ يُقِيمُونَ الصَّلاةَ وَيُؤْتُونَ الزَّكَاةَ وَهُمْ رَاكِعُونَ وَمَنْ يَتَوَلَّ اللَّهَ وَرَسُولَهُ وَالَّذِينَ ءَامَنُوا فَإِنَّ حِزْبَ اللَّهِ هُمُ الْغَالِبُونَ - سورة المائدة';
