const int sectionIndex = 35;
const String sectionTitle = 'غزوة أُحد - في قلب المعركة';

const List t1 = ['1', 'فشل محاولة أبو سفيان'];
const List t2 = ['2', 'بدء القتال'];
const List t3 = ['3', 'مخالفة الرماة لأمر الرسول ﷺ'];
const List t4 = ['4', 'الاتفاف حول المسلمين'];
const List t5 = ['5', 'كسر أنفه الشريف ﷺ'];
const List t6 = ['6', 'أشاعة مقتل النبى ﷺ'];
const List t7 = ['7', 'أنس بن النضر'];
const List t8 = ['8', 'فرار مجموعة من الصحابة'];
const List t9 = ['9', 'الدفاع عن رسول الله ﷺ'];
const List t10 = ['10', 'نحري دون نحرك يا رسول الله'];
const List t11 = ['11', 'اللحظات العصيبة'];
const List t12 = ['12', 'انسحاب النبي ﷺ إلى أحد شعاب جبل أحد'];

const String p1 =
    'حاول أبو سفيان أن يوجد شرخاً وتصدعاً في جبهة المسلمين المتماسكة، فأرسل الى الأنصار يقول: خلو بيننا وبين ابن عمنا فننصرف عنكم فلا حاجة بنا الى قتال فردوا عليه بما يكره، ولما فشلت المحاولة الاولى لجأت قريش الى محاولة اخرى عن طريق عميل خائن من أهل المدينة وهو أبو عامر الراهب حيث حاول أبو عامر الراهب أن يستزل بعض الانصار فقال: يامعشر الأوس أنا ابو عامر قالوا: فلا أنعم الله بك عينا يافاسق فلما سمع ردهم عليه قال: لقد أصاب قومي بعدي شر ثم قاتلهم قتالاً شديداً ورماهم بالحجارة.';
const String p2 =
    'وبدأ القتال بمبارزة بين علي بن أبي طالب رضي الله عنه وطلحة بن عثمان حامل لواء المشركين يوم أحد يقول صاحب السيرة الحلبية: خرج طلحة بن عثمان وكان بيده لواء المشركين، وطلب المبارزة مراراً فلم يخرج إليه أحد فقال: يا أصحاب محمد إنكم تزعمون أن الله تعالى يعجلنا بسيوفكم الى النار ويعجلكم بسيوفنا الى الجنة فهل أحد منكم يعجلني بسيفه الى النار أو أعجله بسيفي الى الجنة؟ فخرج إليه علي بن أبي طالب رضي الله عنه فقال له علي رضي الله عنه : والذي نفسي بيده لا أفارقك حتى يعجلك الله بسيفي الى النار أو يعجلني بسيفك الى الجنة، فضربه علي فقطع رجله فوقع على الأرض فانكشفت عورته فقال: يابن عمي أنشدك الله والرحم فرجع عنه ولم يجهز عليه فكبر رسول الله وقال لعلي بعض أصحابه أفلا أجهزت عليه قال: إن ابن عمي ناشدني الرحم حين انكشفت عورته فاستحييت منه.';
const String p3 =
    'والتحم الجيشان وأشتد القتال وشرع رسول الله يشحذ في همم أصحابه ويعمل على رفع معنوياتهم وأخذ سيفا،ً وقال: من يأخذ مني هذا؟ فبسطوا أيديهم كل إنسان منهم يقول: أنا أنا قال: فمن يأخذه بحقه قال: فأحجم القوم فقال: سماك بن خرشة أبو دجانة وماحقه يارسول الله؟ قال: أن تضرب به العدو حتى ينحني قال: أنا آخذه بحقه، فدفعه إليه وكان رجلاً شجاعاً يختال عند الحرب -اي يمشي مشية المتكبر- وحين رآه رسول الله ﷺ يتبختر بين الصفين قال: إنها لمشية يبغضها الله إلا في مثل هذا الموطن.';
const String p4 =
    'استبسل المسلمون في مقاتلة المشركين وكان شعارهم أمت أمت، واستماتوا في قتال بطولي ملحمي سجل فيه أبطال الاسلام صوراً رائعة في البطولة والشجاعة وسجل التاريخ روائع بطولات حمزة بن عبدالمطلب ومصعب بن عمير وأبو دجانة وأبو طلحة الأنصاري وسعد بن أبي وقاص وأمثالهم كثير، وحقق المسلمون الانتصار في الجولة الاولى من المعركة وفي ذلك يقول الله سبحانه وتعالى في كتابه العزيز: وَلَقَدْ صَدَقَكُمُ اللَّهُ وَعْدَهُ إِذْ تَحُسُّونَهُمْ بِإِذْنِهِ حَتَّى إِذَا فَشِلْتُمْ وَتَنَازَعْتُمْ فِي الأَمْرِ وَعَصَيْتُمْ مِنْ بَعْدِ مَا أَرَاكُمْ مَا تُحِبُّونَ مِنْكُمْ مَنْ يُرِيدُ الدُّنْيَا وَمِنْكُمْ مَنْ يُرِيدُ الآخِرَةَ ثُمَّ صَرَفَكُمْ عَنْهُمْ لِيَبْتَلِيَكُمْ وَلَقَدْ عَفَا عَنْكُمْ وَاللَّهُ ذُو فَضْلٍ عَلَى الْمُؤْمِنِينَ - سورة آل عمران';
const String p5 =
    'ولما رأى الرماة الهزيمة التي حلت بقريش وأحلافها ورأوا الغنائم في أرض المعركة جذبهم ذلك الى ترك مواقعهم ظناً منهم أن المعركة انتهت، فقالوا لأميرهم عبدالله بن جبير: الغنيمة الغنيمة ظهر أصحابكم فما تنتظرون؟ فقال عبدالله بن جبير: أنسيتم ماقال لكم رسول الله ﷺ ؟ قالوا: والله لنأتين الناس فلنصيبن من الغنيمة ثم انطلقوا يجمعون الغنائم ولم يعبأوا بقول أميرهم.';
const String p6 =
    'رأى خالد بن الوليد -وكان على خيالة المشركين- الفرصة سانحة ليقوم بالاتفاف حول المسلمين، ولما رأى المشركون ذلك عادوا الى القتل من جديد، وأحاطوا بالمسلمين من جهتين وفقد المسلمون مواقعهم الاولى وأخذوا يقاتلون بدون تخطيط فأصبحوا يقاتلون متفرقين فلا نظام يجمعهم ولا وحدة تشملهم، بل لم يعودوا يميزون بعضهم فقد قتلوا اليمان -والد حذيفة بن اليمان- خطأ وأخذ المسلمون يتساقطون شهداء في الميدان، وفقدوا اتصالهم بالرسول ﷺ وشاع أنه قتل واختلط الحابل بالنابل واشتدت حرارة القتال وصار المشركون يقتلون كل من يلقونه من المسلمين.';
const String p7 =
    'استطاع المشركين الخلوص قريباً من النبي ﷺ فرموه بحجر كسر أنفه الشريف ورباعيته وشجه في وجهه الكريم، فأثقله وتفجر الدم منه ﷺ ، وعن أنس رضي الله عنه أن رسول الله ﷺ كسرت رباعيته يوم أحد وشج في رأسه -كسر في الرأس- فجعل يسلت الدم عنه ويقول: كيف يفلح قوم شجوا نبيهم وكسروا رباعيته -إحدى الاسنان الأربع التي تكون بين الثنية والناب- وهو يدعوهم الى الله فأنزل الله عز وجل: لَيْسَ لَكَ مِنَ الأَمْرِ شَيْءٌ أَوْ يَتُوبَ عَلَيْهِمْ أَوْ يُعَذِّبَهُمْ فَإِنَّهُمْ ظَالِمُونَ - سورة آل عمران';
const String p8 =
    'وحمل ابن قمئة على مصعب بن عمير رضي الله عنه حيث كان شديد الشبه برسول الله ﷺ فقتله فقال لقريش: قد قتلت محمداً، وشاع أن محمداً قد قتل فتفرق المسلمون، ودخل بعضهم المدينة وانطلقت طائفة منهم فوق الجبل واختلطت على الصحابة أحوالهم فما يدرون كيف يفعلون من هول الفاجعة ففر جمع من المسلمين من ميدان المعركة وجلس بعضهم الى جانب ميدان المعركة بدون قتال وآخرون آثروا الشهادة.';
const String p9 =
    'كان يأسف لعدم شهود بدراً والذي قال في ذلك: والله لئن اراني الله مشهداً مع رسول الله ﷺ ليرين الله كيف أصنع وقد صدق في وعده، ومرّ يوم أحد على قوم ممن أذهلتهم الشائعة وألقوا بسلاحهم فقال أنس: مايجلسكم؟ قالوا: قتل رسول الله فقال: ياقوم إن كان محمد قد قتل فإن ربَّ محمد لم يقتل وموتوا على مامات عليه، وقال: اللهم إني أعتذر إليك مما قال هؤلاء -يعني المسلمين- وأبرأ إليك مما جاء به هؤلاء -يعني المشركين- ثم لقي سعد بن معاذ فقال: ياسعد إني لأجد ريح الجنة دون أحد، ثم ألقى بنفسه في أتون المعركة ومازال يقاتل حتى استشهد، فوجد فيه بضع وثمانون مابين ضربة بسيف أو طعنة برمح أو رمية بسهم فلم تعرفه إلا أخته ببنانه وفي هذا وأمثاله نزل قول الله تعالى: مِنَ الْمُؤْمِنِينَ رِجَالٌ صَدَقُوا مَا عَاهَدُوا اللَّهَ عَلَيْهِ فَمِنْهُمْ مَنْ قَضَى نَحْبَهُ وَمِنْهُمْ مَنْ يَنْتَظِرُ وَمَا بَدَّلُوا تَبْدِيلا - سورة الأحزاب';
const String p10 =
    'ولقد حكى القرآن الكريم خبر فرار هذه المجموعة من الصحابة الذين ترخصوا في الفرار بعد سماعهم نبأ مقتل النبي ﷺ الذي شاع في ساحة المعركة، وكان أول من علم بنجاة الرسول ﷺ وأنه حي هو الصحابي كعب بن مالك الذي رفع صوته بالبشرى، فأمره النبي ﷺ بالسكوت حتى لايفطن المشركون الى ذلك، وقد نص القرآن الكريم على أن الله تعالى قد عفا عن تلك الفئة التي فرت قال تعالى: إِنَّ الَّذِينَ تَوَلَّوْا مِنْكُمْ يَوْمَ الْتَقَى الْجَمْعَانِ إِنَّمَا اسْتَزَلَّهُمُ الشَّيْطَانُ بِبَعْضِ مَا كَسَبُوا وَلَقَدْ عَفَا اللَّهُ عَنْهُمْ إِنَّ اللَّهَ غَفُورٌ حَلِيمٌ - سورة آل عمران';
const String p11 =
    'عندما ابتدأ الهجوم المعاكس من المشركين خلف المسلمين والهدف الرئيس فيه شخص النبي ﷺ ، لم يتزحزح عليه الصلاة والسلام من موقفه والصحابة يسقطون واحداً تلو الواحد بين يديه وحصر رسول الله ﷺ في قلب المشركين وليس معه إلا تسعة من أصحابه سبعة منهم من الانصار، وكان الهدف أن يفك هذا الحصار وأن يصعد في الجبل ليمضي الى جيشه، واستبسل الأنصار في الدفاع عن رسول الله ﷺ واستشهدوا واحداً بعد الآخر، ثم قاتل عنه طلحة بن عبيدالله حتى أثخن وأصيب بسهم شلت يمينه وأراد النبي ﷺ الى صخرة فلم يستطع فقعد طلحه تحته حتى استوى على الصخرة قال الزبير: فسمعت النبي ﷺ يقول: أوجب طلحة.';
const String p12 =
    'وقاتل سعد بن أبي وقاص بين يدي رسول الله ﷺ ، وكان يناوله النبال ويقول له: إرم ياسعد فداك أبي وأمي كما قاتل بين يديه أبو طلحة الأنصاري الذي كان من أمهر الرماة، وهو الذي قال عنه النبي ﷺ : لصوت أبي طلحة في الجيش أشد على المشركين من فئة وقد كان متترساً على رسول الله بحجفة وكان رامياً شديد النزع كسر يومئذ قوسين أو ثلاثة، وكان الرجل يمر معه الجعبة من النبل فيقول رسول الله ﷺ : انثرها لأبي طلحة ثم يشرف الى القوم فيقول أبو طلحة: يانبي الله بأبي أنت لاتشرف الى القوم ألايصيبك سهم نحري دون نحرك يا رسول الله، جعل الله نحري اقرب الى السهام من نحرك لأصاب بها دونك.';

const String p13 =
    'ووقفت نسيبة بنت كعب تذب عن رسول الله ﷺ بالسيف وترمي بالقوس، وأصيبت بجراح كبيرة وترس أبو دجانة دون رسول الله ﷺ بنفسه يقع النبل في ظهره وهو منحني عليه حتى كثر فيه النبل.';
const String p14 =
    'وألتف حول الرسول ﷺ في تلك اللحظات العصيبة أبو بكر وأبوعبيدة، وقام أبو عبيدة بنزع السهمين من وجه النبي ﷺ بأسنانه ثم توارد مجموعة من الأبطال المسلمين حيث بلغوا قرابة الثلاثين يذودون عن رسول الله ﷺ منهم قتادة وثابت بن الدحداح وسهل بن حنيف وعمر بن الخطاب وعبدالرحمن بن عوف والزبير بن العوام.';
const String p15 =
    'واستطاع عمر بن الخطاب أن يرد هجوماً مضاداً قاده خالد ضد المسلمين من عالية الجبل، واستبسل الصحابة الذين كانوا مع عمر في رد الهجوم العنيف وعاد المسلمون فسيطروا على الموقف من جديد، ويئس المشركون من إنهاء المعركة بنصر حاسم وتعبوا من طولها ومن جلادة المسلمين، وانسحب النبي ﷺ بمن معه ومن لحق به من أصحابه الى أحد شعاب جبل أحد، وكان المسلمون في حالة من الألم والخوف والغم لما أصاب رسول الله ﷺ وما أصابهم رغم نجاحهم في رد المشركين، فأنزل الله عليهم النعاس فناموا يسيراً ثم أفاقوا آمنين مطمئنين قال تعالى: ثُمَّ أَنْزَلَ عَلَيْكُمْ مِنْ بَعْدِ الْغَمِّ أَمَنَةً نُعَاسًا يَغْشَى طَائِفَةً مِنْكُمْ وَطَائِفَةٌ قَدْ أَهَمَّتْهُمْ أَنْفُسُهُمْ يَظُنُّونَ بِاللَّهِ غَيْرَ الْحَقِّ ظَنَّ الْجَاهِلِيَّةِ يَقُولُونَ هَلْ لَنَا مِنَ الأَمْرِ مِنْ شَيْءٍ قُلْ إِنَّ الأَمْرَ كُلَّهُ لِلَّهِ يُخْفُونَ فِي أَنْفُسِهِمْ مَا لا يُبْدُونَ لَكَ يَقُولُونَ لَوْ كَانَ لَنَا مِنَ الأَمْرِ شَيْءٌ مَا قُتِلْنَا هَاهُنَا قُلْ لَوْ كُنْتُمْ فِي بُيُوتِكُمْ لَبَرَزَ الَّذِينَ كُتِبَ عَلَيْهِمُ الْقَتْلُ إِلَى مَضَاجِعِهِمْ وَلِيَبْتَلِيَ اللَّهُ مَا فِي صُدُورِكُمْ وَلِيُمَحِّصَ مَا فِي قُلُوبِكُمْ وَاللَّهُ عَلِيمٌ بِذَاتِ الصُّدُورِ - سورة آل عمران';
const String p16 =
    'وقد أجمع المفسرون على أن الطائفة التي قد أهمتهم أنفسهم هم المنافقون أما قريش فإنها يئست من تحقيق نصر حاسم وأجهد رجالها من طول المعركة.';
