const int sectionIndex = 17;
const String sectionTitle = 'عام الحزن ومحنة الطائف';

const List t1 = ['1', 'عام الحزن'];
const List t2 = ['2', 'تجرأ كفار قريش على رسول الله ﷺ'];
const List t3 = ['3', 'رحلة الرسول ﷺ إلى الطائف'];
const List t4 = ['4', 'لماذا اختار الرسول ﷺ الطائف؟'];
const List t5 = ['5', 'موضع السلطة في الطائف'];
const List t6 = ['6', 'سوء أدبهم مع رسول الله ﷺ'];
const List t7 = ['7', 'تضرع ودعاء'];
const List t8 = ['8', 'الدعاء سلاح المؤمن'];
const List t9 = ['9', 'إسلام الجن'];
const List t10 = ['10', 'الفتح الرباني'];

const String p1 =
    'كانت وفاة أبي طالب بعد مغادرة بني هاشم شعبه وذلك في آخر السنة العاشرة من المبعث، وقد كان أبو طالب يحوط النبي ويغضب لهو وكانت قريش تحترمه وعندما حضرته الوفاة جاء زعماء الشرك وحرضوه على الاستمساك بدينه وعدم الدخول في الإسلام قائلين: أترغب عن ملة عبدالمطلب؟ وعرض عليه رسول الله ﷺ الإسلام قائلاً: قل لا إله إلا الله أشهد لك بها يوم القيامة، فقال أبو طالب: لولا تعيرني بها قريش يقولون إنما حمله عليها الجزع، لأقررت بها عينك، فأنزل الله: إِنَّكَ لاَ تَهْدِي مَنْ أَحْبَبْتَ وَلَكِنَّ اللَّهَ يَهْدِي مَنْ يَشَاءُ وَهُوَ أَعْلَمُ بِالْمُهْتَدِينَ - سورة القصص';
const String p2 =
    'كانت أفكار الجاهلية راسخة في عقل أبي طالب ولم يتمكن من تغييرها فهو شيخ كبير يصعب عليه تغيير فكره وماألفه عن آبائه وكان أقرانه حاضرين وقت احتضاره فأثَّروا عليه خوفا من شيوع خبر إسلامه وتأثير ذلك على قومه.';
const String p3 =
    'أما السيدة خديجة أم المؤمنين رضي الله عنها فقد توفيت قبل الهجرة إلى المدينة بثلاث سنين في نفس عام وفاة أبي طالب.';
const String p4 =
    'وبموت أبي طالب الذي أعقبه موت خديجة رضي الله تعالى عنها، تضاعف الأسى والحزن على رسول الله ﷺ بفقد هذين الحبيبين اللذين كانا دعامتين من دعائم سير الدعوة في أزماتها، كان أبو طالب السند الخارجي الذي يدفع عنه القوم وكانت خديجة السند الداخلي الذي يخفف عنه الأزمات والمحن فتجرأ كفار قريش على رسول الله ﷺ ونالوا منه مالم يكونوا يطمعون به في حياة أبي طالب وابتدأت مرحلة عصيبة في حياة الرسول ﷺ واجه فيها كثيراً من المشكلات والمصاعب والمحن والفتن حينما أصبح في الساحة وحيداً لاناصر له إلا الله سبحانه وتعالى.';
const String p5 =
    'ومع هذا فقد مضى في تبليغ رسالة ربه إلى الناس كافة على مايلقى من الخلاف والأذى الشديد الذي أفاضت كتب الحديث وكتب السير بأسانيدها الصحيحة الثابتة في الحديث عنه، وتحمّل ﷺ من ذلك ماتنوء الجبال بحمله ولما تكالبت الفتن والمحن على رسول الله ﷺ في بلده الذي نبت فيه وبين قومه الذين يعرفون عنه كل صغيرة وكبيرة عزم ﷺ على أن ينتقل إلى بلد غير بلده وقوم غير قومه يعرض عليهم دعوته ويلتمس منهم نصرتهم رجاء أن يقبلوا منه ماجاءهم به من الله عزوجل، فخرج إلى الطائف وهي من أقرب البلاد إلى مكة.';
const String p6 =
    'كان النبي ﷺ يقتدي بالأنبياء والمرسلين الذين سبقوه في الدعوة إلى الله، فهذا نوح لبث في قومه داعياً قال تعالى: وَلَقَدْ أَرْسَلْنَا نُوحًا إِلَىٰ قَوْمِهِ فَلَبِثَ فِيهِمْ أَلْفَ سَنَةٍ إِلَّا خَمْسِينَ عَامًا فَأَخَذَهُمُ الطُّوفَانُ وَهُمْ ظَالِمُونَ - سورة العنكبوت';
const String p7 =
    'رغم امتداد الزمن الطويل ماتوقف عن الدعوة ولاضعفت همته في تبليغها ولا ضعفت بصيرته وحيلته في تنويع أوقاتها وأساليبها، قال الآلوسي في تفسيره: رَبِّ إِنِّي دَعَوْتُ قَوْمِي أي إلى الإيمان والطاعة لَيْلاً وَنَهَارًا أي دائماً من غير فتور ولاتوان، ثم وصف إعراضهم الشديد، وإصرارهم العنيد، ثم علق على قوله تعالى: ثُمَّ إِنِّي أَعْلَنْتُ لَهُمْ وَأَسْرَرْتُ لَهُمْ إِسْرَارًا فقال: أي دعوتهم مرة بعد مرة وكرة غبَّ كرة على وجوه مختلفة وأساليب متفاوتة وهو تعميم لوجوه الدعوة بعد تعميم الأوقات، وقوله: ثُمَّ إِنِّي دَعَوْتُهُمْ جِهَارًا يشعر بمسبوقية الجهر بالسر، وهو الأليق بمن همه الإجابة لأنه أقرب إليها لما فيه من اللطف المدعو.';
const String p8 =
    'كان رسول الله ﷺ يسعى لإيجاد مركز جديد للدعوة وطلب النصرة من ثقيف لكنها لم تستجب له وأغرت به صبيانها فرشقوه بالحجارة وفي طريق عودته من الطائف التقى بعداس الذي كان نصرانياً فأسلم، وأرَّخ الواقدي الرحلة في شوال سنة عشر من المبعث بعد موت أبي طالب وخديجة، وذكر أن مدة إقامته بالطائف كانت عشرة أيام.';
const String p9 =
    'كانت الطائف تمثل العمق الإستراتيجي لملأ قريش بل كانت لقريش أطماع في الطائف ولقد حاولت في الماضي أن تضم الطائف إليها ووثبت على وادي وج وذلك لما فيه من الشجر والزرع، حتى خافتهم ثقيف وحالفتهم وأدخلت معهم بني دوس وقد كان كثير من أغنياء مكة يملكون الأملاك في الطائف ويقضون فيها فصل الصيف وكانت قبيلة بني هاشم وعبد شمس على اتصال مستمر مع الطائف، كما كانت تربط مخزوم مصالح مالية مشتركة بثقيف، فإذا اتجه الرسول ﷺ إلى الطائف فذلك توجه مدروس وإذا استطاع أن يجد له فيها موضع قدم وعصبة تناصره فإن ذلك سيفزع قريشاً ويهدد أمنها ومصالحها الاقتصادية تهديداً مباشراً بل قد يؤدي لتطويقها وعزلها عن الخارج، وهذا التحرك الدعوي السياسي الاستراتيجي الذي يقوم به الرسول ﷺ يدل على حرصه في الأخذ بالأسباب لإيجاد دولة مسلمة أو قوة جديدة تطرح نفسها داخل حلبة الصراع لأن الدولة أو إيجاد القوة التي لها وجودها من الوسائل المهمة في تبليغ دعوة الله إلى الناس.';
const String p10 =
    'كان بنو مالك والأحلاف بحكم أسبقيتهم الزمنية للاستيطان هما المسيطرين عليها وتنتهي إليهما قيادتها، فكانت لهما الرئاسة الدينية المتمثلة في رعاية المسجد، بالإضافة إلى الزعامة السياسية العامة والعلاقة الخارجية والنفوذ الاقتصادي، إلا أنهما مع ذلك لم يكونا في وضع يمكنهما من الدفاع عن منطقة الطائف التي كانت من أخصب بلاد العرب وأكثرها جذباً للأنظار والأطماع فكانا يخافان قبيلة هوازن، ويخافان قريش ويخافان بني عامر وكلها قبائل قوية وقادرة على الانقضاض والاستلاب ولذلك فقد اعتمد زعماء الطائف على سياسة المهادنة وحفظ الاستقرار السياسي عن طريق المعاهدات والموازنات وهي عين الطريقة التي كانت تسير عليها قريش، فصار بنو مالك يوثقون علاقاتهم مع هوازن ليأمنوا شرها وصار الأحلاف يرتبطون بقريش لتأمين جانبها.';
const String p11 =
    'هذا ولم يكن الرسول ﷺ غافلاً عن هذه الشبكة من العلاقات والمعاهدات وهو يتجه إلى الطائف بل كان يعرف أن الطائف لم تكن توجد بها سلطة مركزية واحدة وإنما يقتسم السلطة فيها بطنان من بطون العرب بموجب اتفاقية داخلية، وأن أيا منهما كان يدور في فلك قبيلة خارجية أقوى فإذا استطاع أن يستميل إليه أياً منهما فسوف يكون لذلك أثر كبير في ميزان القوى السياسية هذا على وجه العموم أما إذا استطاع على وجه الخصوص أن يستميل إليه الأحلاف وهو المعسكر المتحالف مع قريش، فإن خطته تكون قد بلغت تمامها وهو أمر غير مستحيل فهو يعلم أن موادة هذا المعسكر لقريش لاتقوم على القناعة المذهبية أو الولاء الديني بقدر ماتقوم على أساس التخوف من قريش، وعلى هذا التقدير للوضع السياسي اتجه الرسول ﷺ مباشرة - حينما دخل الطائف - إلى بني عمرو بن عمير الذين يترأسون الأحلاف ويرتبطون بقريش ولم يذهب إلى بني مالك الذين يتحالفون مع هوازن.';
const String p12 =
    'قال ابن هشام في السيرة: لما انتهى رسول الله ﷺ إلى الطائف عمد إلى نفر من ثقيف هم يومئذ سادة ثقيف وأشرافهم وهم إخوة ثلاثة عبد ياليل بن عمرو ومسعود بن عمرو حبيب بن عمرو وعند أحدهم امرأة من قريش من بني جمح غير أن بني عمرو كانوا شديدي الحذر وكثيري التخوف، فلم يستجيبوا لدعوة الرسول ﷺ بل بالغوا في السفه وسوء الأدب معه فقام رسول الله ﷺ من عندهم وقد يئس من خير ثقيف وقال لهم: إذا فعلتم مافعلتم فاكتموا عني وكره رسول الله ﷺ أن يبلغ قومه عنه فيؤزرهم ذلك عليه، فقد كان رسول الله ﷺ يود أن تتم اتصالاته تلك في جو من السرية وألا تنكشف تحركاته لقريش.';
const String p13 =
    'كان خروج رسول الله ﷺ من مكة على الأقدام حتى لا تظن قريش أنه ينوي الخروج من مكة لأنه لو خرج راكباً فذلك مما يثير الشبهة والشكوك وأنه ينوي الخروج والسفر الى جهة ما مما قد يعرضه للمنع من الخروج من مكة دون اعتراض من أحد.';
const String p14 =
    'واختيار الرسول ﷺ زيداً كي يرافقه في رحلته وفيه جوانب أمنية فهو ابن رسول الله ﷺ بالتبني فإذا رآه معه أحد لا يثير ذلك أي نوع من الشك لقوة الصلة بينهما.';
const String p15 =
    'كان بنو عمرو لئاماً فلم يكتموا خبر الرسول ﷺ بل أغرو به سفهاءهم وعبيدهم يسبونه ويرمون عراقيبه بالحجارة حتى دمت عقباه وتلطخت نعلاه وسال دمه الزكي على أرض الطائف ومازالوا به وبزيد بن حارثة حتى ألجأوهما الى بستان لعتبة وشيبة ابني ربيعة وهما فيه فكره مكانهما لعداوتهما الله ورسوله ورجع عنه من سفهاء ثقيف من كان يتبعه، فعمد الى ظل شجرة من عنب فجلس فيه هو وصاحبه زيد ريثما يستريحا من عنائهما وما أصابهما وابنا ربيعا ينظران إليه ويريان مالقي من سفهاء أهل الطائف ولم يحركا ساكناً وفي هذه الغمرة من الأسى والحزن والآلام النفسية والجسمانية.';
const String p16 =
    'وتوجه رسول الله ﷺ الى ربه بهذا الدعاء الذي يفيض إيماناً ويقيناً، ورضىً بما ناله في الله واسترضاء الله وقال: اللهم إليك أشكو ضعف قوتي وقلة حيلتي وهواني على الناس، يا أرحم الراحمين أنت رب المستضعفين وأنت ربي الى من تكلني الى بعيد يتجهمني أم الى عدو ملكته أمري إن لم يكن بك عليّ غضب فلا أبالي، ولكن عافيتك أوسع لي، أعوذ بنور وجهك الذي أشرقت له الظلمات، وصلح عليه أمر الدنيا والآخرة من أن تنزل بي غضبك أو يحل عليّ سخطك لك العُتبى حتى ترضى ولا حول ولا قوة إلا بالله.';
const String p17 =
    'وإنا في هذا الدعاء عمق توحيد النبي ﷺ ومبلغ تجرده لله جل وعلا فهو لم يشعر لهذا الحزن المفضي والهم المتواصل ليدرأ عن نفسه الأذى أو ليجلب لنفسه شيئاً من حياة الهدوء والنعيم، بل هو يستعذب كل هذا الأذى من أجل الله تعالى.';
const String p18 =
    'إن الدعاء من أعظم العبادات وهو سلاح فعّال في مجال الحماية للإنسان وتحقيق أمنه، فمهما بلغ العقل البشري من الذكاء والدهاء فهو عرضة للزلل والإخفاق وقد تمر على المسلم مواقف يعجز فيها عن التفكير والتدبير تماماً، فليس له مخرج منها سوى أن يجأر الى الله بالدعاء ليجد فرجاً ومخرجاً، فعندما لحق برسول الله ﷺ من أهل الطائف الأذى والطرد والسخرية والاستهزاء وأصبح هائماً على وجهه، لجأ الى الله بالدعاء فما أن انتهى من الدعاء حتى جاءت الإجابة من رب العالمين مع جبريل وملك الجبال.';
const String p19 =
    'فعن عائشة رضى الله عنها أنها سألت رسول الله ﷺ : هل أتى عليك يوم كان أشد من أحد؟ قال: لقد لقيت من قومك مالقيت وكان أشدَّ مالقيت منهم يوم العقبة إذ عرضت نفسي على ابن عبد ياليل بن عبد كُلال فلم يجبني الى ما أردت فانطلقت وأنا مهموم على وجهي فلم أستفق إلا وأنا بقرن الثعالب، فرفعت رأسي فإذا أنا بسحابة قد أظلتني فنظرت فإذا فيها جبريل فناداني فقال: إن الله قد سمع قول قومك لك وماردُّوا عليك، وقد بعث الله إليك ملك الجبال لتأمره بما شئت، فناداني ملك الجبال فسلَّم عليَّ ثم قال: يامحمد فقال: ذلك فيما شئت إن شئت أن أطبق عليهم الأخشبين، فقال النبي ﷺ : بل أرجوا أن يخرج الله من أصلابهم من يعبد الله وحده لايشرك به شيئاً.';
const String p20 =
    'لما انصرف النبي ﷺ من الطائف راجعاً الى مكة حين يئس من خبر ثقيف، حتى إذا كان بنخلة قام من جوف الليل يصلي، فمر به النفر من الجن الذين ذكرهم الله تعالى وكانوا سبعة نفر من جن أهل نصيبين فاستمعوا لتلاوة الرسول ﷺ فلما فرغ من صلاته ولّوا الى قومهم منذرين قد آمنوا وأجابوا الى ماسمعوا فقص الله تعالى خبرهم على النبي ﷺ فقال: وَإِذْ صَرَفْنَا إِلَيْكَ نَفَرًا مِنَ الْجِنِّ يَسْتَمِعُونَ الْقُرْءَانَ فَلَمَّا حَضَرُوهُ قَالُوا أَنْصِتُوا فَلَمَّا قُضِيَ وَلَّوْا إِلَى قَوْمِهِمْ مُنْذِرِينَ قَالُوا يَاقَوْمَنَا إِنَّا سَمِعْنَا كِتَابًا أُنْزِلَ مِنْ بَعْدِ مُوسَى مُصَدِّقًا لِمَا بَيْنَ يَدَيْهِ يَهْدِي إِلَى الْحَقِّ وَإِلَى طَرِيقٍ مُسْتَقِيمٍ - سورة الأحقاف';
const String p21 =
    'هذه الدعوة التي رفضها المشركون بالطائف تنتقل الى عالم آخر هو عالم الجن، فتلقوا دعوة النبي ﷺ ومضوا بها الى قومهم، كما مضى بها أبو ذر الغفاري الى قومه، والطفيل بن عمرو الى قومه، وضماد الأزدي الى قومه، فأصبح في عالم الجن دعاة يبلغون دعوة الله تعالى: يَاقَوْمَنَا أَجِيبُوا دَاعِيَ اللَّهِ وَءَامِنُوا بِهِ يَغْفِرْ لَكُمْ مِنْ ذُنُوبِكُمْ وَيُجِرْكُمْ مِنْ عَذَابٍ أَلِيمٍ - سورة الأحقاف';
const String p22 =
    'وأصبح أسم محمد ﷺ تهفو به قلوب الجن وليس قلوب المؤمنين من الإنس فقط وأصبح من الجن حواريون حملوا راية التوحيد ووطنوا أنفسهم دعاة الى الله ونزل في حقهم قرآناً يتلى الى أن يرث الله الأرض ومن عليها قال تعالى: قُلْ أُوحِيَ إِلَيَّ أَنَّهُ اسْتَمَعَ نَفَرٌ مِّنَ الْجِنِّ فَقَالُوا إِنَّا سَمِعْنَا قُرْآنًا عَجَبًا يَهْدِي إِلَى الرُّشْدِ فَآمَنَّا بِهِۖ وَلَن نُّشْرِكَ بِرَبِّنَا أَحَدًا وَأَنَّهُ تَعَالَىٰ جَدُّ رَبِّنَا مَا اتَّخَذَ صَاحِبَةً وَلَا وَلَدًا - سورة الجن';
const String p23 =
    'كان هذا الفتح الرباني في مجال الدعوة ورسول الله ﷺ ببطن نخلة عاجز عن دخول مكة فهل يستطيع عتاة مكة وثقيف أن يأسروا هؤلاء المؤمنين من الجن، وينزلوا بهم ألوان التعذيب ؟ وعندما دخل النبي ﷺ - مكة في جوار المطعم بن عدي كان يتلو على صحابته سورة الجن فتتجاوب أفئدتهم خشوعاً وتأثراً من روعة الفتح العظيم في عالم الدعوة وأرتفاع راياتها، فليسوا هم وحدهم في المعركة، هناك إخوانهم من الجن يخوضون معركة التوحيد مع الشرك.';
