const int sectionIndex = 67;
const String sectionTitle = 'غزوة حنين - بين النصر والهزيمة';

const List t1 = ['1', 'تأملات قرآنية'];
const List t2 = ['2', 'من أسباب الهزيمة'];
const List t3 = ['3', 'عوامل النصر'];
const List t4 = ['4', 'من الأحكام الفقهية فى غزوة حنين'];
const List t5 = ['5', 'أنس بن أبي مرثد الغنوي وحراسة المسلمين'];
const List t6 = ['6', 'من معالم المنهج النبوي'];
const List t7 = ['7', 'شجاعة أم سليم يوم حنين'];
const List t8 = ['8', 'الشيماء بنت الحارث أخت النبي ﷺ'];
const List t9 = ['9', 'إسلام الشاعر كعب بن زهير'];

const String p1 =
    'قال تعالى: لَقَدْ نَصَرَكُمُ اللَّهُ فِي مَوَاطِنَ كَثِيرَةٍ وَيَوْمَ حُنَيْنٍ إِذْ أَعْجَبَتْكُمْ كَثْرَتُكُمْ فَلَمْ تُغْنِ عَنْكُمْ شَيْئًا وَضَاقَتْ عَلَيْكُمُ الأَرْضُ بِمَا رَحُبَتْ ثُمَّ وَلَّيْتُمْ مُدْبِرِينَ ثُمَّ أَنْزَلَ اللَّهُ سَكِينَتَهُ عَلَى رَسُولِهِ وَعَلَى الْمُؤْمِنِينَ وَأَنْزَلَ جُنُودًا لَمْ تَرَوْهَا وَعَذَّبَ الَّذِينَ كَفَرُوا وَذَلِكَ جَزَاءُ الْكَافِرِينَ ثُمَّ يَتُوبُ اللَّهُ مِنْ بَعْدِ ذَلِكَ عَلَى مَنْ يَشَاءُ وَاللَّهُ غَفُورٌ رَحِيمٌ - سورة التوبة';
const String p2 =
    'تصوير بياني بديع لحال المسلمين فيه تنقل بالسامع من صورة إلى صورة من صورة المسلمين وهم معجبون بكثرتهم مسرورين بها، إلى صورة فشلهم وهزيمتهم مع هذه الكثرة فلم تنفعهم، إلى صورة الخوف الذي أصابهم حتى لم تعد الأرض تسعهم وأقفلت منافذها في وجوههم إلى الصورة الحسية لهذا الفشل في الفرار والنكوص وتولية الأدبار حتى لم يبق حول النبي ﷺ إلا القليل، وبعد الخوف الشديد الذي أصاب المؤمنين في مبدأ لقائهم بأعدائهم في غزوة حنين يجئ نصر الله الذي عبر عنه سبحانه بقوله: ثُمَّ أَنْزَلَ اللَّهُ سَكِينَتَهُ عَلَى رَسُولِهِ وَعَلَى الْمُؤْمِنِينَ وَأَنْزَلَ جُنُودًا لَمْ تَرَوْهَا وَعَذَّبَ الَّذِينَ كَفَرُوا وَذَلِكَ جَزَاءُ الْكَافِرِينَ - سورة التوبة';
const String p3 =
    'فباب المغفرة دائماً مفتوح لمن يخطئ ثم يتوب إن معركة حنين التي يذكرها السياق هنا ليعرض نتائج الإنشغال عن الله، والاعتماد على قوة غير قوته، لتكشف لنا حقيقة أخرى ضمنية، حقيقة القوى التي تعتمد عليها كل عقيدة ، إن الكثرة العددية ليست بشيء، إنما هي القلة العارفة المتصلة الثابتة المتجردة للعقيدة إلى أن يقول... لقد قامت كل عقيدة بالصفوة المختارة، لابالزبد الذي يذهب جفاء ولا بالهشيم الذي تذره الرياح.';
const String p4 =
    'أن شيئاً من العجب تسرب إلى قلوب المسلمين لما رأوا عددهم فقد قال رجل منهم: لن نغلب اليوم من قلة، فشق ذلك على النبي ﷺ فكانت الهزيمة.';
const String p5 =
    'خروج شبان ليس لديهم سلاح أو سلاح كاف وإنما عندهم حماس وتسرع.';
const String p6 = 'أن عدد المشركين كان كثيراً بلغ أكثر من ضعفي عدد المسلمين.';
const String p7 =
    'أن مالك بن عوف سبق بجيشه إلى حنين، فتهيأ هنالك ووضع الكمائن والرماة في مضايق الوادي وعلى جوانبه، وفاجؤوا المسلمين برميهم بالنبال وبالهجوم المباغت.';
const String p8 =
    'كان العدو مهيَّأً ومنظماً ومستعداً للقتال حال مواجهته لجيش المسلمين، فقد جاء المشركون بأحسن صفوف رأيت: صف الخيل ثم المقاتلة ثم النساء من وراء ذلك ثم الغنم ثم النعم.';
const String p9 =
    'وجود ضعاف الإيمان الذين أسلموا حديثاً في مكة ففروا، فانقلبت أولاهم على أخراهم، فكان ذلك سبباً لوقوع الخلل وهزيمة غيرهم.';
const String p10 =
    'ثبات الرسول في القتال وعدم تراجعه مما جعل الجنود يثبتون ويستجيبون لنداء القائد الثابت.';
const String p11 =
    'شجاعة القائد فالرسول القائد لم يثبت في مكانه فحسب بل تقدم نحو عدوه راكباً بغلته، فطفق يركض ببغلته قبل الكفار والعباس آخذ بلجام البغلة يكفها أن لاتسرع.';
const String p12 =
    'ثبات قلة من المسلمين معه وحوله حتى جاء الذين تولوا وأكملوا المسيرة مسيرة الثبات والبر والقتال حتى النصر وسرعة استجابة الفارين والتحاقهم بالقتال.';
const String p13 =
    'وقوع الجيش المعادي في خطأ عسكري قاتل وهو عدم الاستمرار في مطاردة الجيش الإسلامي بعد فراره مما أعطى فرصة ثمينة للجيش الإسلامي ليلتقط أنفاسه ويعود إلى ساحة القتال.';
const String p14 =
    'رمية للحصى: فقد أخذ النبي ﷺ حصيات فرمى بهن وجوه الكفار ثم قال: انهزموا ورب محمد.';
const String p15 =
    'الإستعانة والإستغاثة بالله عزوجل فقد كان الرسول يلح على الله في الدعاء بالنصر على الأعداء.';
const String p16 =
    'إنزال الملائكة في الغزوة ومشاركتها فيها وقد سجل الله هذه المشاركة في كتابه الكريم وفي سورة التوبة : وَأَنْزَلَ جُنُودًا لَمْ تَرَوْهَا وَعَذَّبَ الَّذِينَ كَفَرُوا وَذَلِكَ جَزَاءُ الْكَافِرِينَ.';
const String p17 =
    'نزول الآية الكريمة: وَالْمُحْصَنَاتُ مِنَ النِّسَاءِ إِلا مَا مَلَكَتْ أَيْمَانُكُمْ - سورة النساء ، في يوم أوطاس لبيان حكم المسبيات المتزوجات، وقد فرق السبي بينهن وبين أزواجهن فأوضحت الآية جواز وطئهن إذا انقضت عدتهن، لأن الفرقة تقع بينهن وبين أزواجهن الكفار بالسبي وتنقضي العدة بالوضع للحامل وبالحيض لغير الحامل.';
const String p18 =
    'منع المخنثين خلقة من الدخول على النساء الأجنبيات وكان ذلك مباحاً إذ لاحاجة للمخنث بالنساء وكان سبب المنع مارواه البخاري عن زينب بنت أبي سلمة عن أمها أم سلمة، دخل عليَّ النبي ﷺ وعندي مخنث فسمعته يقول لعبدالله بن أمية: يا عبدالله أرأيت إن فتح الله عليكم الطائف غداً، فعليك بابنة غيلان فإنها تقبل بأربع وتدبر بثمان فقال النبي ﷺ : لايدخلن عليكم، وفي هذا المنع حرص النبي ﷺ على سلامة أخلاق المجتمع الإسلامي.';
const String p19 =
    'النهي عن قصد قتل النساء والأطفال والشيوخ والأجراء ممن لايشتركون في القتال ضد المسلمين وقد ذكر ابن كثير: أن رسول الله مر يوم حنين بامرأة قتلها خالد بن الوليد والناس متقصطفون عليها فقال رسول الله ﷺ : ماكانت هذه لتقاتل وقال لأحدهم: الحق خالداً فقل له لايقتلن ذرية ولاعسيفاً وفي رواية فقال له إن رسول الله ينهاك أن تقتل وليداً أو امرأة أو عسيفا.';
const String p20 =
    'النهي عن الغلول: أخذ النبي يوم حنين وبرة من سنام بعير من الغنائم، فجعلها بين اصبعيه ثم قال: أيها الناس إنه لا يحل لي مما أفاء الله عليكم قدر هذه، إلا الخمس، والخمس مردود عليكم، فأدُّوا الخياط والمخيط وإياكم والغلول، فإن الغلول عار ونار وشنار على أهله في الدنيا والآخرة، ولما سمع الناس هذا الزجر بما فيه من وعيد من رسول الله ﷺ أشفقوا على أنفسهم وخافوا خوفاً شديداً فجاء أنصاري بكبة خيط من خيوط شعر فقال: يارسول الله أخذت هذه الوبرة لأخيط بها برذعة بعير لي دبر، فقال له ﷺ : أما حقِّي منها، وما كان لبني عبدالمطلب فهو لك فقال الأنصاري: أما إذا بلغ الأمر فيها ذلك فلا حاجة لي بها فرمى بها من يده.';
const String p21 =
    'وفاء نذر كان في الجاهلية : قال عبدالله بن عمر رضي الله عنهما: لما قفلنا من حنين سأل عمر النبي ﷺ عن نذر كان نذره في الجاهلية اعتكاف فأمره النبي ﷺ بوفائه.';
const String p22 =
    'قال رسول الله ﷺ قبل اندلاع معركة حنين من يحرسنا الليلة. فقال أنس بن أبي مرثد أنا يارسول الله، قال ﷺ : فاركب، فركب ابن أبي مرثد فرساً له، وجاء إلى رسول الله ﷺ فقال له ﷺ : استقبل هذا الشِّعْب حتى تكون في أعلاه ونُغَرَنَّ من قبلك الليلة.';
const String p23 =
    'قال سهيل بن الحنظلية: فلما أصبحنا خرج رسول الله ﷺ إلى مصلاّه فركع ركعتين، ثم قال: هل أحسنتم فارسكم؟ قالوا: ما أحسناه فثوّب بالصلاة وجعل ﷺ يصلي وهو يلتفت إلى الشِّعب، حتى إذا قضى صلاته قال: أبشروا فقد جاءكم فارسكم فجعل ينظر إلى خلال الشجر في الشِّعب فإذا هو قد جاء حتى وقف عليه فقال: إني انطلقت حتى إذا كنت في أعلى الشِّعب حيث أمرني ﷺ ، فلما أصبحت طلعت الشعبين كليهما فنظرت فلم أرَ أحداً، فقال ﷺ : هل نزلت الليلة؟ فقال: لا إلا مصلياً أو قاضي حاجة، فقال له ﷺ : قد أوجبت فلا عليك أن تعمل بعدها.';
const String p24 =
    'وفي هذا الخبر يظهر لنا المنهج النبوي الكريم في الإهتمام بالأفراد، فقد ظهر اهتمام النبي ﷺ بطليعة القوم حتى جعل يلتفت في صلاته، وما كان ذلك ليحدث إلا لأمر هام، ثم إنه ﷺ قال: أبشروا فقد جاء فارسكم، إنها الكلمة التي يستعملها ﷺ في إخبارهم بما يسرهم من الأمور العظيمة وتلك هي أهمية الفرد في المجتمع الإسلامي، إنه ليس كماً مهملاً ولارقماً في سجل ولا بزالاً في آلة يستغنى عنه عند الضرورة: ليؤتى بغيره، إنها بعض التفسير للمنهج الإلهي في قوله: وَلَقَدْ كَرَّمْنَا بَنِي ءَادَمَ وَحَمَلْنَاهُمْ فِي الْبَرِّ وَالْبَحْرِ وَرَزَقْنَاهُمْ مِنَ الطَّيِّبَاتِ وَفَضَّلْنَاهُمْ عَلَى كَثِيرٍ مِمَّنْ خَلَقْنَا تَفْضِيلا - سورة الإسراء';
const String p25 =
    'كما أن في هذه القصة معلما من معالم المنهج النبوي الكريم في وجوب اليقظة وتعرف أحوال العدو ومراقبة حركاته ومعرفة ماعنده من القوة عدداً وعدّة، وما رسمه من خطط حربية وهي سياسة مهمة بالنسبة للقادة الذين يسعون لإعلاء كلمة الله في الأرض.';
const String p26 =
    'وأما في قول الرسول ﷺ : قد أوجبت فلا عليك أن تعمل بعدها فهذا محمول على النوافل التي يكفر الله بها السيئات ويرفع بها الدرجات، والمقصود أنه عمل عملاً صالحاً كبيراً يكفي لتكفير ماقد يقع منه من سيئات في المستقبل ويرفع الله به درجاته في الجنة وليس المقصود أن هذا العمل يكفيه عن أداء الواجبات.';
const String p27 =
    'قال أنس رضي الله عنه: إن أم سليم اتخذت يوم حنين خنجراً ، فكان معها فرآها أبو طلحة فقال: يارسول الله هذه أم سليم معها خنجر، فقال لها رسول الله ﷺ : ما هذا الخنجر؟ قالت: اتخذته إن دنا مني أحد من المشركين بقرت به بطنه، فجعل رسول الله ﷺ : يضحك فقالت: يارسول الله: اقتل من بعدنا من الطلقاء -الذين أسلموا يوم الفتح- انهزموا بك فقال رسول الله: يا أم سليم إن الله قد كفى وأحسن.';
const String p28 =
    'كان المسلمون قد ساقوا فيمن ساقوه إلى رسول الله الشيماء بنت الحارث بنت حليمة السعدية أخت رسول الله ﷺ من الرضاعة، وعنفوا عليها في السوق وهم لا يدرون فقالت للمسلمين: تعلمون والله اني لأخت صاحبكم من الرضاعة، فلم يصدقوها حتى أتو بها رسول الله ولما انتهت الشيماء إلى رسول الله ﷺ قالت: يارسول الله! إني أختك من الرضاعة فقال ماعلامة ذلك؟ قال عضة عضضتها في ظهري، وأنا متوركتك - حاملتك على وركي - وعرف رسول الله ﷺ العلامة، وبسط لها رداءه وأجلسها عليه وخيرها وقال: ان أحببت فعندي محببة مكرمة، وان أحببت أن أمتعك وترجعي إلى قومي فعلت، فقالت: بل تمتعني وتردني إلى قومي، ومتعها رسول الله ﷺ فأسلمت، وأعطاها رسول الله ﷺ ثلاثة أعبد وجارية ونعماء وشاء.';
const String p29 =
    'لما قدم رسول الله ﷺ من الطائف جاءه كعب بن زهير -الشاعر ابن الشاعر- وكان قد هجا رسول الله ﷺ ثم ضاقت به الأرض، وضاقت عليه نفسه وحثه أخوه بجير على أن يأتي رسول الله ﷺ تائباً مسلماً، وحذره من سوء العاقبة إن لم يفعل ذلك، فقال قصيدته التي يمدح فيها رسول الله ﷺ والتي اشتهرت بـ قصيدة بانت سعاد فقدم المدينة، وغدا إلى رسول الله ﷺ حين صلى الصبح، ثم جلس إليه ووضع يده في يده، وكان رسول الله ﷺ لايعرفه، فقال لرسول الله ﷺ : إن كعب بن زهير جاء يستأمنك تائباً مسلماً، فهل أنت قابل منه؟ فوثب عليه رجل من الأنصار، فقال يارسول الله دعني وعدو الله أضرب عنقه، فقال رسول الله ﷺ : دعه عنك فقد جاء تائباً نازعاً وأنشد كعب قصيدته اللامية التي قال فيها:';
const String p30 = 'إن الرسول لنور يستضاء به.. مهند من سيوف الله مسلول';
const String p31 = 'في عصبة من قريش قال قائلهم.. ببطن مكة لما أسلموا زولوا';
