const int sectionIndex = 34;
const String sectionTitle = 'غزوة أُحد - ما قبل المعركة';

const List t1 = ['1', 'السعي للقضاء على الأسلام'];
const List t2 = ['2', 'الثأر ليوم بدر'];
const List t3 = ['3', 'توقف رحلتي الشتاء والصيف'];
const List t4 = ['4', 'خروج قريش'];
const List t5 = ['5', 'الاستخبارات النبوية'];
const List t6 = ['6', 'تتابع حركة العدو'];
const List t7 = ['7', 'مشاورته ﷺ لأصحابه'];
const List t8 = ['8', 'الوعي السياسي للصحابة'];
const List t9 = ['9', 'خروج جيش المسلمين إلى أحد'];
const List t10 = ['10', 'تقديم المصلحة العامة على الخاصة'];
const List t11 = ['11', 'انسحاب المنافق ابن سلول بثلث الجيش'];
const List t12 = ['12', 'عبدالله بن حرام وانخذال المنافقين'];
const List t13 = ['13', 'بنو سلمة وبنو حارثة'];
const List t14 = ['14', 'الاستعانة بغير المسلمين'];
const List t15 = ['15', 'رد النبي ﷺ بعض الصحابة لصغر سنهم'];
const List t16 = ['16', 'خطة الرسول ﷺ لمواجهة كفار مكة'];
const List t17 = ['17', 'إن الله مع من أطاعه'];
const List t18 = ['18', 'السيطرة على جبل أحد وأوامر الرماه'];
const List t19 = ['19', 'صف الصفوف'];

const String p1 =
    'فقد أخبر المولى عز وجل أن المشركين ينفقون أموالهم في الصد عن سبيل الله وإقامة العقبات أمام الدعوة الاسلامية، ومنع الناس في الدخول في الاسلام والسعي للقضاء على الاسلام والمسلمين ودولتهم النائشة، قال تعالى: إِنَّ الَّذِينَ كَفَرُوا يُنْفِقُونَ أَمْوَالَهُمْ لِيَصُدُّوا عَنْ سَبِيلِ اللَّهِ فَسَيُنْفِقُونَهَا ثُمَّ تَكُونُ عَلَيْهِمْ حَسْرَةً ثُمَّ يُغْلَبُونَ وَالَّذِينَ كَفَرُوا إِلَى جَهَنَّمَ يُحْشَرُونَ سورة الانفال .قال الطبري: يصرفون أموالهم وينفقونها ليمنعوا الناس عن الدخول في الاسلام.';
const String p2 =
    'كان للهزيمة الكبيرة في بدر وقتل السادة والاشراف من قريش وقعاً كبيراً من الخزي والعار الذي لحق بهم وجعلهم يشعرون بالمذلة والهزيمة، ولذلك بذلوا قصارى جهدهم في غسل هذه الذلة والمهانة التي لصقت بهم ولذلك شرعوا في جمع المال لحرب رسول الله ﷺ فور عودتهم من بدر، قال ابن اسحاق: لما اصيب يوم بدر من كفار قريش أصحاب القليب ورجع فَلُّهُم الى مكة ورجع أبوسفيان بعيرهم فأوقفها بدار الندوة، وكذلك كانوا يصنعون فلم يحركها ولا فرقها فطابت أنفس أشرافهم أن يجهزوا منها جيشاً لقتال رسول الله ﷺ فمشى عبدالله بن ربيعة وعكرمة بن أبي جهل والحارث بن هشام وحويطب بن عبدالعزى وصفوان بن أمية في رجال ممن أصيب آباؤهم وأبناؤهم وإخوانهم يوم بدر، فكلموا أبا سفيان ومن كانت له في تلك العير تجارة من قريش فقالوا: إن محمداً قد وتركم وقتل خياركم فأعينونا بهذا المال على حربه لعلنا ندرك منه ثأرنا بمن أصاب منا فقال ابو سفيان: أنا أول من أجاب الى ذلك.';
const String p3 =
    'كانت حركة السرايا التي تقوم بها الدولة الاسلامية قد أثرت على اقتصاد قريش، وفرضت عليهم حصاراً اقتصادياً قوياً وكان الاقتصاد المكي قائماً على رحلتي الشتاء والصيف، رحلة الشتاء الى اليمن وتحمل إليها بضائع الشام ومحاصيلها ورحلة الصيف الى الشام تحمل إليها محاصيل اليمن وبضائعها، وقطع أحد جناحي هاتين الرحلتين ضر للجناح الآخر لأن تجارتهم الى الشام قائمة على سلع اليمن وتجارتهم الى اليمن قائمة على سلع الشام، قال تعالى: لإِيلافِ قُرَيْشٍ إِيلافِهِمْ رِحْلَةَ الشِّتَاءِ وَالصَّيْفِ فَلْيَعْبُدُوا رَبَّ هَذَا الْبَيْتِ الَّذِي أَطْعَمَهُمْ مِنْ جُوعٍ وَءَامَنَهُمْ مِنْ خَوْفٍ - سورة قريش.';
const String p4 =
    'استكملت قريش قواها في يوم السبت السابع من شوال من السنة الثالثة من الهجرة، وعبأت جيشها المكون من ثلاثة آلاف مقاتل مصحبين معهم النساء والعبيد ومن تبعها من القبائل العربية المجاورة، فخرجت قريش بحدها وحديدها وأحابيشها ومن تبعها من كنانة وأهل تهامة، وخرجوا بالظعن التماس الحفيظة لئلا يفروا، وخرج ابو سفيان وهو قائد الناس بهند ابنة عتبة بن ربيعة وخرج صفوان بن أمية بن خلف ببرزة ابنة مسعود الثقية وخرج عكرمة بن أبي جهل بأم حكيم بنت الحارث بن هشام بن المغيرة وخرج الحارث بن هشام بن المغيرة بفاطمة بنت الوليد بن المغيرة فأقبلوا حتى نزلوا ببطن السبخة من قناة على شفير الوادي مما يلي المدينة.';
const String p5 =
    'وكانت التعبئة القرشية قد سبقتها حملة إعلامية ضخمة تولى كبرها أبو عزة عمرو بن عبدالله الجمحي وعمرو بن العاص وهبيرة المخزومي وابن الزبعرى وقد حققت نتائج كبيرة وبلغت النفقات الحربية لجيش قريش خمسين ألف دينار ذهباً.';
const String p6 =
    'كان العباس بن عبدالمطلب يرقب حركات قريش واستعداداتها العسكرية، فلما تحرك هذا الجيش بعث العباس رسالة مستعجلة الى النبي ﷺ ضمنها جميع تفاصيل الجيش، وأسرع رسول العباس بإبلاغ الرسالة وجدّ في السير حتى إنه قطع الطريق بين مكة والمدينة التي تبلغ مساحتها الى خمسمائة كيلومتراً في ثلاثة أيام وسلم الرسالة الى النبي ﷺ وهو في مسجد قباء.';
const String p7 =
    'لم يكتفي النبي ﷺ بمعلومات المخابرات المكية، بل حرص على أن تكون معلوماته على هذا العدو متجددة مع تلاحق الزمن وفي هذا إرشاد لقادة المسلمين بأهمية متابعة الأخبار التي يتولد عنها وضع خطط واستراتيجيات نافعة ولذلك أرسل ﷺ الحُباب بن المنذر الى قريش يستطلع الخبر فدخل بين جيش مكة وحزر عَدَده وعُدَدَه ورجع فسأله رسول الله ﷺ : مارأيت؟ قال: رأيت يارسول الله عدداً حزرتهم ثلاثة آلاف يزيدون قليلاً أو ينقصون قليلاً والخيل مائتي فرس ورأيت دروعاً ظاهرة حزرتها سبعمائة درع قال: هل رأيت ظعنا؟ قال: رأيت النساء معهن الدفاف والأكبار - الطبل الذي له وجه واحد وهو فارس معرب - فقال رسول الله ﷺ : أرَدْن أن يحرِّضنّ القوم ويذكرونهم قتلى بدر هكذا جاءني خبرهم لاتذكر من شأنهم حرفاً حسبنا الله ونعم الوكيل اللهم بك أجول وبك أصول.';
const String p8 =
    'بعد أن جمع ﷺ المعلومات الكاملة عن جيش كفار قريش، جمع أصحابه رضي الله عنهم وشاورهم في البقاء في المدينة والتحصن فيها أو الخروج لملاقاة المشركين، وكان رأي النبي ﷺ البقاء في المدينة وقال: إنا في جُنَّة حصينة فإن رأيتم أن تقيموا وتدعوهم حيث نزلوا فإن أقاموا أقاموا بشر مقام وإن دخلوا علينا قاتلناهم فيها، وكان رأي عبدالله بن أبي بن سلول مع رأي رسول الله ﷺ إلا أن رجالاً من المسلمين ممن كان فاته بدر قالوا: يا رسول الله اخرج بنا الى أعدائنا.';
const String p9 =
    'وقال ابن اسحاق: فلم يزل الناس برسول الله ﷺ الذي كان من أمرهم حب لقاء القوم حتى دخل رسول الله ﷺ بيته فلبس لأمته فتلاوم القوم فقالوا: عرض نبي الله ﷺ بأمر وعرضتم بغيره، فاذهب ياحمزة فقل لنبي الله ﷺ أمرنا لأمرك تبع، فأتى حمزة فقال له: يانبي الله إن القوم تلاوموا، فقالوا أمرنا لأمرك تبع، فقال رسول الله ﷺ : إنه ليس لنبي إذا لبس لامته أن يضعها حتى يقاتل.';
const String p10 =
    'من الواضح أن الرسول ﷺ عوّد أصحابه على التصريح بآرائهم عند مشاورته لهم حتى ولو خالفت رأيه، فهو إنما يشاورهم فيما لانص فيه تعويداً لهم على التفكير في الأمور العامة ومعالجة مشاكل الأمة فلا فائدة من المشورة إذا لم تقترن بحرية إبداء الرأي، ولم يحدث أن لام الرسول ﷺ أحداً لأنه أخطأ في اجتهاده ولم يوفق في رأيه.';
const String p11 =
    'وهنا يظهر الوعي السياسي عند الصحابة رضوان الله عليهم، فرغم أن لهم إبداء الرأي إلا أنه ليس لهم فرصة على القائد فحسبهم أن يبينوا رأيهم ويتركوا للقائد حرية اختيار مايترجح لديه من الآراء، فلما رأوا أنهم ألحوا في الخروج، وأن الرسول ﷺ عزم على الخروج بسبب إلحاحهم عادوا فاعتذروا إليه لكن الرسول الكريم علمهم درساً آخر هو من صفات القيادة الناجحة وهو عدم التردد بعد العزيمة والشروع في التنفيذ فإن ذلك يزعزع الثقة بها ويغرس الفوضى بين الأتباع.';
const String p12 =
    'من الأسباب المهمة التي اتخذها ﷺ لملاقاة أعدائه، اختياره لوقت التحرك والطريق التي تناسب خطته، فقد تحرك بعد منتصف الليل حيث يكون الجو هادئاً والحركة قليلة وفي هذا الوقت بالذات يكون الأعداء غالباً في نوم عميق لأن الإعياء ومشقة السفر قد أخذ منهم مجهوداً كبيراً.';
const String p13 =
    'ومن المعروف من نام بعد تعب يكون ثقيل النوم فلا يشعر بالأصوات العالية والحركة الثقيلة، قال الواقدي رحمه الله: نام رسول الله ﷺ حتى أدلج فلما كان في السَّحَر قال: أين الأدلاء؟ ثم أنه ﷺ اختار الطريق المناسب الذي يسلكه حتى يصل إلى أرض المعركة، وذكر صفة ينبغي أن تتوافر في هذا الطريق وهو السِّرية حتى لايرى الأعداء جيش المسلمين فقال ﷺ لأصحابه:من رجل يخرج بنا على القوم من طريق لايمر بنا عليهم؟ فأبدى أبو خيثمة رضي الله عنه استعداده قائلاً: أنا يارسول الله فنفذ به في حرة بني حارثة وبين أموالهم حتى سلك به في مال لربعي بن قيظي، وفي رواية ابن هشام لمربع بن قيظي: وكان رجلاً منافقاً ضرير البصر فلما أحس برسول الله ﷺ ومن معه من المسلمين، قام يحثي في وجوههم التراب وهو يقول: إن كنت رسول الله فلا أحل لك أن تدخل حائطي، وقد ذكر أنه أخذ حفنة من تراب بيده ثم قال: والله لو أعلم أني لا أصيب بها غيرك يامحمد لضربت بها وجهك، فابتدره القوم ليقتلوه فقال لهم: لاتقتلوه فهذا الأعمى أعمى القلب أعمى البصر وقد بدر إليه سعد بن زيد أخو بني الأشهل قبل نهي رسول الله عنه فضربه بالقوس في رأسه فشجه.';
const String p14 =
    'ولاشك في أن مروره ﷺ بين الأشجار والبساتين، يدلنا على حرصه ﷺ على الأخذ بالإحتياطات الأمنية المناسبة في أثناء السير، لأن الطرق العامة تكشف للأعداء عن مقدار قوات المسلمين وهذا أمر محذور، فالرسول ﷺ علم الأمة الأخذ بالسرية من حيث المكان والزمان.';
const String p15 =
    'وفي هذا الخبر تطبيق عملي لتقديم المصلحة العامة على المصلحة الخاصة إذا تعارضت المصالح، فالرسول ﷺ حينما مر بالجيش في أرض المنافق مربع بن قيظي وترتب على ذلك إفساد المزرعة لكن فيه مصلحة للجيش باختصار الطريق لهم إلى أحد، فبين ﷺ أن مايكون به مصلحة للدين مقدم على ماسواه من المصالح الأخرى فهنا تعارضت مصلحتان مصلحة عامة ومصلحة خاصة، ومصلحة الدين في هذا الموقف مصلحة عامة وهي مقدمة على المصلحة الخاصة وهي مصلحة المال، وقد رتب الشارع الحكيم مقاصد الشرع في تحقيق المنافع لعباده من حفظ دينهم ونفوسهم وعقولهم ونسلهم وأموالهم طبق ترتيب معين فيما بينها فإذا نظرنا إلى كليات الدين الخمس وأهميتها وجدنا أن هذه الكليات متدرجة حسب الأهمية: الدين والنفس والعقل والنسل والمال، فما يكون به حفظ الدين مقدم على مايكون به حفظ النفس عند تعارضهما، ومايكون به حفظ النفس مقدم على مابه يكون حفظ العقل ومابه يكون حفظ النسل مقدم على مابه حفظ المال، والترتيب بهذا الشكل من هذه الكليات يحظى باتفاق العلماء.';
const String p16 =
    'عندما وصل جيش المسلمين انسحب المنافق ابن سلول بثلاثمائة من المنافقين، بحجة أنه لن يقع قتال مع المشركين ومعترضاً على قرار القتال خارج المدينة، قائلاً : أطاع الولدان ومن لارأي له أطاعهم وعصاني علام نقتل أنفسنا، وكان هدفه الرئيس من هذا التمرد أن يحدث بلبلة واضطراباً في الجيش الإسلامي لتنهار معنوياته ويتشجع العدو وتعلو همته، وعمله هذا ينطوي على خيانة عظيمة وبغض للإسلام والمسلمين، وقد اقتضت حكمة الله أن يمحص الله الجيش ليظهر الخبيث من الطيب حتى لايختلط المخلص بالمغرض والمؤمن بالمنافق قال تعالى: مَا كَانَ اللَّهُ لِيَذَرَ الْمُؤْمِنِينَ عَلَى مَا أَنْتُمْ عَلَيْهِ حَتَّى يَمِيزَ الْخَبِيثَ مِنَ الطَّيِّبِ وَمَا كَانَ اللَّهُ لِيُطْلِعَكُمْ عَلَى الْغَيْبِ - سورة آل عمران ،فالجبن والنكوص هما اللذان كشفا عن طوية المنافقين فافتضحوا أمام أنفسهم وأمام الناس قبل أن يفضحهم القرآن.';
const String p17 =
    'حاول عبدالله بن حرام رضي الله عنه إقناع المنافقين بالعودة، فأبوا فقال: ياقوم أذكركم الله ألا تخذلوا قومكم ونبيكم عندما حضر من عدوهم، فقالوا: لو نعلم أنكم تقاتلون لما أسلمناكم ولكنا لانرى أن يكون قتال فلما استعصوا عليه وأبوا إلا الانصراف عنهم قال: أبعدكم الله أعداء الله فسيغني الله عنكم نبيه، وفي هؤلاء المنخذلين نزل قول الله تعالى: وَمَا أَصَابَكُمْ يَوْمَ الْتَقَى الْجَمْعَانِ فَبِإِذْنِ اللَّهِ وَلِيَعْلَمَ الْمُؤْمِنِينَ وَلِيَعْلَمَ الَّذِينَ نَافَقُوا وَقِيلَ لَهُمْ تَعَالَوْا قَاتِلُوا فِي سَبِيلِ اللَّهِ أَوِ ادْفَعُوا قَالُوا لَوْ نَعْلَمُ قِتَالا لاتَّبَعْنَاكُمْ هُمْ لِلْكُفْرِ يَوْمَئِذٍ أَقْرَبُ مِنْهُمْ لِلإِيمَانِ يَقُولُونَ بِأَفْواهِهِمْ مَا لَيْسَ فِي قُلُوبِهِمْ وَاللَّهُ أَعْلَمُ بِمَا يَكْتُمُونَ - سورة آل عمران';
const String p18 =
    'ولما رجع ابن ابي سلول وأصحابه همت بنو سَلَمة وبنو حارثة أن ترجعا ولكن الله ثبتهما وعصمهما وفي ذلك نزل قوله سبحانه: إِذْ هَمَّتْ طَائِفَتَانِ مِنْكُمْ أَنْ تَفْشَلا وَاللَّهُ وَلِيُّهُمَا وَعَلَى اللَّهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُونَ - سورة آل عمران قال جابر بن عبدالله نزلت هذه الآية فينا بني سلمة وبني حارثة وما أحب أنها لم تنزل.';
const String p19 =
    'عندما وصل رسول الله ﷺ الى مكان يدعى الشيخين رأى كتيبة لها صوت وجلبة فقال: ماهذه؟ فقالوا: هؤلاء حلفاء عبدالله بن سلول بن أبي من يهود فقال ﷺ : لا نستنصر بأهل الشرك على أهل الشرك وهذا أصل وضعه النبي ﷺ في عدم الركون الى أعداء الاسلام في الاستنصار بهم.';
const String p20 =
    'رد النبي ﷺ في معسكره بالشيخين جماعة من الفتيان لصغر أعمارهم إذ كانوا في سن الرابعة عشر أو دون ذلك منهم عبدالله بن عمر وزيد بن ثابت وأسامة بن زيد وزيد بن ارقم والبراء بن عازب وأبو سعيد الخدري بلغ عددهم أربعة عشر صبياً وقد ثبت أن ابن عمر كان منهم وأجاز منهم رافع بن خديج لما قيل له: إنه رام فبلغ ذلك سمرة بن جندب فذهب الى زوج أمه مرّي بن سنان بن ثعلبة عم أبي سعيد الخدري وهو الذي ربى سمرة في حجره - يبكي وقال له: يا أبت أجاز رسول الله ﷺ رافعاً وردني وأنا أصرع رافعاً فرجع زوج أمه ذلك الى النبي ﷺ فالتفت النبي ﷺ الى رافع وسمرة فقال لهما تصارعا فصرع سمرة رافعاً فأجازه كما أجاز رافعاً وجعلهما من جنده وعسكر كتائبه ولكل منهما مجاله واختصاصه، ونلحظ أن رسول الله ﷺ أجاز رافعاً وسمرة لامتياز عسكري امتازوا به على أقرانهم وردوا صغار السن خشية أن لايكون لهم صبر على ضرب السيوف ورمي السهام وطعن الرماح فيفروا من المعركة إذا حمي الوطيس فيحدث فرارهم خلخة في صفوف المسلمين.';
const String p21 =
    'وضع الرسول ﷺ خطة محكمة لمواجهة المشركين من قريش، حيث اختار الموقع المناسب وانتخب من يصلح للقتال ورد من لم يكن صالحاً واختار خمسين منهم للرماية وشدد الوصية عليهم وقام بتقسيم الجيش الى ثلاث كتائب وأعطى اللواء لأحد أفراد الكتيبة وهذه الكتائب هي:';
const String p22 =
    'كتيبة المهاجرين وأعطى ولواءها مصعب بن عمير | كتيبة الأوس من الأنصار ولواءها أسيد بن حضير | كتيبة الخزرج من الأنصار ولواءها الحباب بن المنذر.';
const String p23 =
    'وكان ﷺ من هديه يحرض أصحابه على قتال الأعداء ويحثهم على التحلي بالصبر في ميادين القتال، لكي تتقوى روحهم المعنوية ويصمدوا عند ملاقاة أعدائهم ومن ذلك مافعله يوم أحد، وفي ذلك يقول الواقدي: ثم قام رسول الله ﷺ فخطب الناس: يا أيها الناس أوصيكم بما أوصاني الله في كتابه من العمل بطاعته، والتناهي عن محارمه، ثم إنكم اليوم بمنزل أجر وذخر لمن ذكر الذي عليه، ثم وطّن نفسه له على الصبر واليقين والجد والنشاط، فإن جهاد العدو شديد كريه، قليل من يصبر عليه إلا من عزم الله رشده، فإن الله مع من أطاعه ،وإن الشيطان مع من عصاه، فافتتحوا أعمالكم بالصبر على الجهاد، والتمسوا بذلك ماوعدكم الله وعليكم بالذي آمركم، فإني حريص على رشدكم فإن الاختلاف والتنازع والتثبيط من أمر العجز والضعف مما لايحب الله ولا يعطي عليه النصر ولا الظفر.';
const String p24 =
    'أدرك الرسول ﷺ أهمية جبل أحد لحماية جيش المسلمين، فعندما وصل جيش المسلمين الى جبل أحد جعل الرسول ﷺ ظهورهم الى الجبل ووجوههم الى المدينة، وانتقى خمسين من الرماة تحت إمرة عبدالله بن جبير ووضعهم فوق جبل عينين المقابل لجبل أحد وذلك يمنع التفاف جيش المشركين حول جيش المسلمين، وأصدر أوامره إليهم قائلاً: إن رأيتمونا تخطفنا الطير فلا تبرحوا مكانكم هذا حتى أرسل إليكم وإن رأيتمونا هَزَمْنا القوم وأوطأناهم فلا تبرحوا حتى أرسل إليكم.';
const String p25 =
    'وقال رسول الله ﷺ للجيش: لاتبرحوا حتى أوذنكم وقال: لا يقاتلن أحد حتى آمره بالقتال، وقال لأمير الرماة: انضح الخيل عنا بالنبل لايأتونا من خلفنا واثبت مكانك إن كانت لنا أو علينا، وقال للرماة: الزموا مكانكم لا تبرحوا منه فإذا رأيتمونا نهزمهم حتى ندخل عسكرهم فلا تفارقوا مكانكم وإن رأيتمونا نقتل فلا تغيثونا ولا تدفعوا عنا وارشقوهم بالنبل فإن الخيل لاتقدّم على النبل إنا لن نزال غالبين مامكثتم مكانكم اللهم إني أشهدك عليهم.';
const String p26 =
    'وسيطر المسلمون على المرتفعات وتركوا الوادي لجيش مكة ليواجه أحد وظهره الى المدينة وأصبحت مهمة الرماة في النقاط التالية: احتلال الموقع حماية المسلمين من الخلف صد الخيل عن المسلمين.';
const String p27 =
    'وتقدم رسول الله ﷺ وأصحابه وصفّهم على هيئة صفوف الصلاة، وجعل رسول الله ﷺ يمشي على رجليه يُسوي تلك الصفوف ويبوئ أصحابه للقتال يقول: تقدم يافلان وتأخر يافلان فهو يقوِّمهم حتى استوت الصفوف فوضع ﷺ في مقدمة الصفوف الأشداء لكي يفتحوا الطريق لمن خلفهم وقد أخذ الرسول ﷺ بهذا الاسلوب لأنه أبلغ في قتال الأعداء.';
