const int sectionIndex = 59;
const String sectionTitle = 'مراسلات الملوك';

const List t1 = ['1', 'خارج حدود الجزيرة العربية'];
const List t2 = ['2', 'كتاب النبي ﷺ الى هرقل'];
const List t3 = ['3', 'كتاب النبي ﷺ الى كسرى'];
const List t4 = ['4', 'معرفة عقائد الملوك'];
const List t5 = ['5', 'مارية القبطية'];
const List t6 = ['6', 'تمزيق ملك كسرى'];
const List t7 = ['7', 'مواصفات رجل السياسة الاسلامية'];

const String p1 =
    'كان صلح الحديبية إيذاناً ببداية المد الاسلامي، فقد انساح هذا المد الى أطراف الجزيرة العربية بل تجاوزها الى مارواء حدود الجزيرة العربية فمذ أن عقد الرسول ﷺ صلح الحديبية مع قريش وما تلا ذلك من إخضاع يهود شمال الحجاز في خيبر ووادي القرى وتيماء وفدك الى سيادة الاسلام، فإن الرسول لم يأل جهداً لنشر الاسلام خارج حدود الحجاز وكذلك خارج حدود الجزيرة العربية وقد عبّر عليه الصلاة والسلام عن هذا المنهج قولاً وعملاً من خلال إرساله عدداً من الرسل والمبعوثين الى أمراء أطراف الجزيرة العربية والى ملوك العالم المعاصر خارج الجزيرة العربية.';
const String p2 =
    'بسم الله الرحمن الرحيم، من محمد بن عبدالله ورسوله الى هرقل عظيم الروم، سلام على من اتبع الهدى أما بعد، فإني أدعوك بدعاية الاسلام أسلم تسلم يؤتك الله أجرك مرتين، فإن توليت عليك إثم الأريسيِّين - قُلْ يَاأَهْلَ الْكِتَابِ تَعَالَوْا إِلَى كَلِمَةٍ سَوَاءٍ بَيْنَنَا وَبَيْنَكُمْ أَلا نَعْبُدَ إِلا اللَّهَ وَلا نُشْرِكَ بِهِ شَيْئًا وَلا يَتَّخِذَ بَعْضُنَا بَعْضًا أَرْبَابًا مِنْ دُونِ اللَّهِ فَإِنْ تَوَلَّوْا فَقُولُوا اشْهَدُوا بِأَنَّا مُسْلِمُونَ - سورة آل عمران';
const String p3 =
    'ولقد تسلم هرقل رسالة النبي ﷺ ودقق في الأمر كما في الحديث الطويل المشهور بين أبي سفيان وهرقل المروي في الصحيحين حين سأله عن أحوال النبي، وقال بعد ذلك لأبي سفيان: إن كان ماتقول حقاً فسيملك موضع قدمي هاتين، وقد كنت أعلم أنه خارج ولم أكن أنه منكم فلو أني أعلم أني أخلص لتجشمت لقاءه ولو كنت عنده لغسلت عن قدمه.';
const String p4 =
    'أرسل النبي ﷺ بكتاب الى كسرى ملك الامبراطورية الفارسية مع عبدالله بن حذفة السهمي، أمره أن يدفعه الى عظيم البحرين فدفعه عظيم البحرين الى كسرى، فلما قرأه مزقه، فدعا عليهم رسول الله ﷺ أن يُمَزَّقُوا كُلَّ ممزق ونص الرسالة كما أورده الطبري كالتالي:';
const String p5 =
    'بسم الله الرحمن الرحيم، من محمد رسول الله الى كسرى عظيم فارس، سلام على من اتبع الهدى وآمن بالله ورسوله وأشهد أن لا إله إلا الله وأني رسول الله الى الناس كافة، لينذر من كان حياً أسلم تسلم، فإن أبيت عليك أثم المجوس.';
const String p6 =
    'في رسائل رسول الله ﷺ للملوك فوارق دقيقة مؤسسة على حكمة الدعوة روعي فيها مايمتاز به هؤلاء الملوك في العقائد التي يدينون بها، والخلفيات التي يمتازون بها، فلما كان هرقل والمقوقس يدينان بألوهية المسيح كلياً أو جزئياً، وكنه ابن الله، جاءت في الكتابين اللذين وجّها إليهما كلمة عبد الله مع اسم النبي ﷺ صاحب هاتين الرسالتين، فيبتدئ الكتابان بعد التسمية بقوله: من محمد عبدالله ورسوله الى هرقل عظيم الروم.';
const String p7 =
    'وبقوله: من محمد عبدالله ورسوله الى المقوقس عظيم القبط بخلاف ماجاء في كتابه ﷺ الى كسرى أبرويز فاكتفى بقوله: من محمد رسول الله الى كسرى عظيم الفرس وجاءت كذلك آية: قُلْ يَاأَهْلَ الْكِتَابِ تَعَالَوْا إِلَى كَلِمَةٍ سَوَاءٍ بَيْنَنَا وَبَيْنَكُمْ أَلا نَعْبُدَ إِلا اللَّهَ وَلا نُشْرِكَ بِهِ شَيْئًا وَلا يَتَّخِذَ بَعْضُنَا بَعْضًا أَرْبَابًا مِنْ دُونِ اللَّهِ فَإِنْ تَوَلَّوْا فَقُولُوا اشْهَدُوا بِأَنَّا مُسْلِمُونَ - سورة آل عمران ، وما جاءت في كتابه الى كسرى ابرويز لأن الآية تخاطب أهل الكتاب الذين دانوا بألوهية المسيح، واتخذوا احبارهم ورهبانهم أرباباً من دون الله والمسيح ابن مريم، وقد كان هرقل امبراطور الدولة البيزنطية والمقوقس حاكم مصر قائدين سياسيين وزعيمين دينيين كبيرين للعالم المسيحي، مع اختلاف يسير في الاعتقاد في المسيح هل له طبيعة أم طبيعتان.';
const String p8 =
    'ولما كان كسرى ابرويز وقومه يعبدون الشمس النار، ويدينون بوجود الهين، احدهما يمثل الخير وهو يزدان، والثاني يمثل الشر وهو اهرمن، وكانوا بعيدين عن مفهوم النبوة والتصور الصحيح للرسالة السماوية، جاءت في الكتاب الذي وجه الى الامبراطور الايراني عبارة: وأني رسول الله الى الناس كافة لينذر من كان حياً.';
const String p9 =
    'وقد كان تلقي الملوك لهذه الرسائل يختلف، فأما هرقل والنجاشي والمقوقس فتأدبوا وتلطفوا في جوابهم وأكرم النجاشي.';
const String p10 =
    'وكذلك المقوقس الذى أرسل الهدايا لرسول الله ﷺ ، وفى ذلك جواز أخذ هدية الكافر فقد أرسل مع سفير رسول الله حاطب بن أبي بلتعة هدية تشتمل على جاريتين وكسوة للرسول ﷺ وبغلة يركبها فقبلها رسول الله ﷺ ، واحدى هاتين الجاريتين مارية القبطية أم ابراهيم ابن رسول الله.';
const String p11 =
    'وأما كسرى ابرويز فلما قرء عليه الكتاب مزقه، وقال: يكتب إليَّ هذا وهو عبدي؟ فبلغ ذلك رسول الله ﷺ فقال: مزق الله ملكه، وأمر كسرى باذان وهو حاكمه على اليمن بإحضاره فأرسل بأبويه يقول له: إن ملك الملوك قد كتب الى الملك باذان يأمره أن يبعث إليك من يأتيه بك، وقد بعثني إليك لتنطلق معي فأخبره رسول الله ﷺ بأن الله سلط على كسرى ابنه شيرويه فقتله، وقد تحقق ما أنبأ به رسول الله بكل دقة، فقد استولى على عرشه ابنه قباذ الملقب بـ شرويه وقتل كسرى ذليلاً مهاناً بإيعاز منه سنة 628م وقد تمزق ملكه بعد وفاته وأصبح لعبة في أيدي أبناء الأسرة الحاكمة، فلم يعش شرويه إلا ستة أشهر، وتوالى على عرشه مدة أربع سنوات عشرة ملوك، واضطرب حبل الدولة الى أن اجتمع الناس على يزدجرد وهو آخر ملوك بني ساسان، وهو الذي واجه الزحف الاسلامي الذي أدى الى انقراض الدولة الساسانية التي دامت وازدهرت أكثر من أربعة قرون انقراضاً كلياً، وكان ذلك في سنة 637م وهكذا تحققت هذه النبوءة في ظرف ثماني سنين.';
const String p12 =
    'قال اللواء الركن محمود شيت خطاب رحمه الله في كتابه الفريد سفراء النبي ﷺ شروط ومواصفات رجل السياسة الاسلامية:';
const String p13 =
    'الاسلام والدعوة إليه: قال تعالى: قُلْ هَذِهِ سَبِيلِي أَدْعُو إِلَى اللَّهِ عَلَى بَصِيرَةٍ أَنَا وَمَنِ اتَّبَعَنِي وَسُبْحَانَ اللَّهِ وَمَا أَنَا مِنَ الْمُشْرِكِينَ - سورة يوسف، وإذا كان المسلمون كلهم دعاة الى الله تعالى فرسل النبي ﷺ الى الملوك والأمراء في زمانه هم صفوة الدعاة.';
const String p14 =
    'الفصاحة والوضوح: وقد طلب موسى تدعيمه بموقف الفصاحة من هارون أخيه: وَاجْعَلْ لِي وَزِيرًا مِنْ أَهْلِي هَارُونَ أَخِي اشْدُدْ بِهِ أَزْرِي - سورة طه، وقد اختار الرسول ﷺ كل سفرائه ومبعوثيه من العرب الذين تربوا في الجزيرة العربية ومع البدو أحياناً فقد كانوا أصحاب نقاوة ولم تتكدر باختلاط الأعاجم بعد، فقد كانوا على قدر كبير من الفصاحة والوضوح.';
const String p15 =
    'العلم: العلم بالشيء هو وسيلة نقل الفكرة والمبدأ، لذا عندما تنظر الى جعفر بن أبي طالب رضي الله عنه وهو يحاور النجاشي ثم يقرأ عليه - سورة كهيعص تتيقن من دقة الاختيار النبوي ونصاعة خطاب العالم ودقة اختياره للألفاظ والعبارات.';
const String p16 =
    'الصبر: قال تعالى: فَاصْبِرْ كَمَا صَبَرَ أُولُو الْعَزْمِ مِنَ الرُّسُلِ وَلا تَسْتَعْجِلْ لَهُمْ كَأَنَّهُمْ يَوْمَ يَرَوْنَ مَا يُوعَدُونَ لَمْ يَلْبَثُوا إِلا سَاعَةً مِنْ نَهَارٍ بَلاغٌ فَهَلْ يُهْلَكُ إِلا الْقَوْمُ الْفَاسِقُونَ - سورة الاحقاف، والحقيقة أن الصبر هو عدة الداعية وزاده المستمر ولو تصفحت سيرة الرسول ﷺ وسيرة صحابته الأجلاء لوجدتها حافلة بالصبر على الدعوة وموقف الطائف شاهد على ذلك.';
const String p17 =
    'الشجاعة: وقد تحدث التاريخ الاسلامي عن شجاعة السفراء والذين أرسلهم الرسول ﷺ الى الملوك وأنهم كانوا لايخافون لومة لائم.';
const String p18 =
    'الحكمة: وقد كان سفراء الرسول ﷺ يتصفون بالحكمة، فهذا عمرو بن العاص كان في اقواله وأفعاله، قيل لعمرو: مالعقل؟ قال: الإصابة بالظن ومعرفة مايكون بما قد كان ليس العاقل الذي يعرف الخير من الشر إنما العقل الذي يعرف خير الشرين.';
const String p19 =
    'سعة الحيلة: يجب أن يكون السفير مدركاً لأبعاد المناورة السياسية متأنياً كتوماً وسعة الحيلة التي ترتكز أولاً وقبل كل شيء على الذكاء من أهم سمات السفير، وقد كان سفراء الرسول ﷺ يتصفون بالذكاء والدهاء وتوقع الأحداث والحساب لكل مايمكن أن يحدث.';
const String p20 =
    'المظهر: تميز سفراء النبي ﷺ بالمظهر الحسن مع نقاء المخبر وقد حرص النبي ﷺ على اختيار سفرائه من بين أصحابه الذين تتوافر فيهم صفات شكلية جميلة الى جانب سماتهم العقلية والنفسية سالفة الذكر.';
