const int sectionIndex = 71;
const String sectionTitle = 'غزوة تبوك - المنافقين فى الغزوة';

const List t1 = ['1', 'إنما كنا نخوض ونلعب'];
const List t2 = ['2', 'في رواية قتادة'];
const List t3 = ['3', 'لا تَعتذِرُوا'];
const List t4 = ['4', 'محاولة اغتيال رسول الله ﷺ'];
const List t5 = ['5', 'وَهَمُّوا بمَا لَم يَنالُوا'];

const String p1 =
    'قال عبدالله بن عمر رضي الله عنهما: قال رجل في غزوة تبوك في مجلس يوماً: ما رأينا مثل قرائنا هؤلاء لا أرغب بطونا ولا أكذب ألسنة ولا أجبن عند اللقاء، فقال رجل في المجلس: كذبت ولكنك منافق لأخبرن رسول الله ﷺ ، فبلغ ذلك رسول الله ﷺ ونزل القرآن، قال عبدالله: فأنا رأيته متعلقاً بحقب -حبل يشد به الرحل في بطن البعير- ناقة رسول الله والحجارة تنكبه -تصيبه وتؤذيه- وهو يقول: يارسول الله إنما كنا نخوض ونلعب، والرسول ﷺ يقول: أبالله وآياته ورسوله كنتم تستهزئون؟';
const String p2 =
    'وفي رواية قتادة قال: بينما رسول الله ﷺ في غزوته إلى تبوك وبين يديه أناس من المنافقين فقالوا: يرجو هذا الرجل أن تفتح له قصور الشام وحصونها؟ هيهات هيهات !! فأطلع الله نبيه على ذلك، فقال نبي الله ﷺ : احبسوا على هؤلاء الركب، فأتاهم فقال: قلتم كذا قلتم كذا، قالوا فأنزل الله فيهم ماتسمعون فأنزل الله تعالى: يَحْذَرُ الْمُنَافِقُونَ أَنْ تُنَزَّلَ عَلَيْهِمْ سُورَةٌ تُنَبِّئُهُمْ بِمَا فِي قُلُوبِهِمْ قُلِ اسْتَهْزِئُوا إِنَّ اللَّهَ مُخْرِجٌ مَا تَحْذَرُونَ وَلَئِنْ سَأَلْتَهُمْ لَيَقُولُنَّ إِنَّمَا كُنَّا نَخُوضُ وَنَلْعَبُ قُلْ أَبِاللَّهِ وَءَايَاتِهِ وَرَسُولِهِ كُنْتُمْ تَسْتَهْزِئُونَ - سورة التوبة';
const String p3 =
    'والاستفهام في قوله: قُلْ أَبِاللَّهِ وَءَايَاتِهِ وَرَسُولِهِ كُنْتُمْ تَسْتَهْزِئُونَ استفهام إنكاري، والمعنى: قل يامحمد لهؤلاء موبخاً ومنكراً: ألم تجدوا ماتستهزئون به في مزاحكم ولعبكم -كما تزعمون- سوى فرائض الله وأحكامه وآياته ورسوله الذي جاء لهدايتكم وإخراجكم من الظلمات إلى النور.';
const String p4 =
    'ثم بين سبحانه أن استهزاءهم هذا أدى بهم إلى الكفر، فقال: لا تَعْتَذِرُوا قَدْ كَفَرْتُمْ بَعْدَ إِيمَانِكُمْ إِنْ نَعْفُ عَنْ طَائِفَةٍ مِنْكُمْ نُعَذِّبْ طَائِفَةً بِأَنَّهُمْ كَانُوا مُجْرِمِينَ ، ومعنى ال أي لاتذكروا هذا العذر لدفع هذا الجرم لأن الإقدام على الكفر لأجل اللعب لاينبغي أن يكون فاعتذاركم إقرار بذنبكم فهو كما يقال: عذر أقبح من ذنب.';
const String p5 =
    'وقوله: إِنْ نَعْفُ عَنْ طَائِفَةٍ مِنْكُمْ نُعَذِّبْ طَائِفَةً بِأَنَّهُمْ كَانُوا مُجْرِمِينَ ، أي إن نعف عن بعضكم لتوبتهم وإنابتهم إلى ربهم، كمِخَشنّ بن حُمَير نعذب بعضاً آخر لإجرامهم وإصرارهم عليه.';

const String p6 =
    'وقد قال ابن كثير أن الضحاك قال: إن نفراً من المنافقين هموا بالفتك بالنبي ﷺ ، وهو في غزوة تبوك في بعض الليالي في حال السير، وكانوا بضعة عشر رجلاً نزلت فيهم هذه الآية، وفي رواية الواحدي عن الضحاك: خرج المنافقون مع رسول الله ﷺ إلى تبوك، فكانوا إذا خلا بعضهم إلى بعض سبوا رسول الله ﷺ وأصحابه وطعنوا في الدين، فنقل ماقالوا حذيفة إلى رسول الله ﷺ فقال لهم رسول الله: يا أهل النفاق ما هذا الذي بلغني عنكم؟ فحلفوا ماقالوا شيئاً من ذلك فأنزل الله هذه الآية إكذاباً لهم.';

const String p7 =
    'وقد نزل في هؤلاء المنافقين قول الله تعالى: يَحْلِفُونَ بِاللَّهِ مَا قَالُوا وَلَقَدْ قَالُوا كَلِمَةَ الْكُفْرِ وَكَفَرُوا بَعْدَ إِسْلامِهِمْ وَهَمُّوا بِمَا لَمْ يَنَالُوا وَمَا نَقَمُوا إِلا أَنْ أَغْنَاهُمُ اللَّهُ وَرَسُولُهُ مِنْ فَضْلِهِ فَإِنْ يَتُوبُوا يَكُ خَيْرًا لَهُمْ وَإِنْ يَتَوَلَّوْا يُعَذِّبْهُمُ اللَّهُ عَذَابًا أَلِيمًا فِي الدُّنْيَا وَالآخِرَةِ وَمَا لَهُمْ فِي الأَرْضِ مِنْ وَلِيٍّ وَلا نَصِيرٍ - سورة التوبة';
const String p8 =
    'والمعنى الإجمالي أنهم يحلفون بالله أنهم ماقالوا تلك الكلمة التي نسبت إليهم والله يكذبهم ويثبت أنهم قد قالوا كلمة الكفر التي رويت عنهم ولم يذكر القرآن هذه الكلمة لأنه لاينبغي ذكرها.';
const String p9 =
    'أما همهم بما ينالوا فهو اغتيال رسول الله ﷺ في العقبة منصرفة من تبوك، ذاك أنه لما رجع رسول الله ﷺ قافلاً من تبوك إلى المدينة، وسبب النزول السابق ذكره يوضح ذلك وقوله: وَمَا نَقَمُوا إِلا أَنْ أَغْنَاهُمُ اللَّهُ وَرَسُولُهُ مِنْ فَضْلِهِ ، أي: وما أنكر هؤلاء المنافقون من أمر الإسلام وبعثة الرسول ﷺ فيهم شيئاً يقتضي الكراهة والهم بالإنتقام إلا أن أغناهم الله تعالى إياهم ورسوله من فضله بالغنائم التي هي عندهم أحب الأشياء لديهم في هذه الحياة.';
const String p10 =
    'وقوله تعالى: فَإِنْ يَتُوبُوا يَكُ خَيْرًا لَهُمْ ، أي: فإن يتوبوا من النفاق ومايصدر عنه من مساوئ الأقوال والأفعال يكن ذلك المتاب خيراً لهم في الدنيا والآخرة، وقوله: وَإِنْ يَتَوَلَّوْا يُعَذِّبْهُمُ اللَّهُ عَذَابًا أَلِيمًا فِي الدُّنْيَا وَالآخِرَةِ وَمَا لَهُمْ فِي الأَرْضِ مِنْ وَلِيٍّ وَلا نَصِيرٍ ،أي: وإن يعرضوا عما دعوا إليه من التوبة وأصروا على النفاق وماينشأ منه من المساوئ الخلقية والنفسية يعذبهم الله عذاباً أليماً في الدنيا بما يلازم قلوبهم من الخوف والهلع.';
