const int sectionIndex = 8;
const String sectionTitle = 'تجارته وبشارات النبوة';

const List t1 = ['1', 'تجارته وزواجه ﷺ'];
const List t2 = ['2', 'اشتراكه ﷺ في بناء الكعبة الشريفة'];
const List t3 = ['3', 'بشارات الأنبياء بمحمد ﷺ'];
const List t4 = ['4', 'بشارات علماء أهل الكتاب بنبوته ﷺ'];
const List t5 = ['5', 'أحبار اليهود'];
const List t6 = ['6', 'الحالة العامة التي وصل إليها الناس'];
const List t7 = ['7', 'إرهاصات نبوته ﷺ'];

const String p1 =
    'كانت خديجة بنت خويلد رضي الله عنها أرملة ذات شرف ومال تستأجر الرجال ليتجروا بمالها، فلما بلغها عن محمد صدق حديثه وعظم أمانته وكرم أخلاقه، عرضت عليه أن يخرج في مالها إلى الشام تاجراً وتعطيه أفضل ماتعطي غيره من التجار فقبل وسافر معه غلامها ميسرة، وقدما الشام وباع محمد سلعته التي خرج بها واشترى ماأراد من السلع فلما رجع إلى مكة وباعت خديجة ما أحضره لها تضاعف مالها.';
const String p2 =
    'رأت خديجة في مالها البركة مالم تر قبل هذا وأخبرت بشمائله الكريمة ووجدت ضالتها المنشودة، فتحدثت بما في نفسها إلى صديقتها نفيسة بنت منبه، وهذه ذهبت إليه تفاتحه أن يتزوج خديجة، فرضى بذلك وعرض ذلك على أعمامه فوافقوا، وخرج معه عمه حمزة بن عبدالمطلب فخطبها إليه وتزوجها رسول الله ﷺ وأصدقها عشرين بَكرة وكانت أول إمرأة تزوجها رسول الله ﷺ ولم يتزوج غيرها حتى ماتت رضي الله عنها، وقد ولدت لرسول الله ﷺ غلامين وأربع بنات وابناه هما: القاسم و به كان ﷺ يكنى وعبدالله ويلقب الطاهر والطيب.';
const String p3 =
    'وقد مات القاسم بعد أن بلغ سناً تمكنه من ركوب الدابة، ومات عبدالله وهو طفل وذلك قبل البعثة، أما بناته فهن: زينب ورقية وأم كلثوم وفاطمة وقد أسلمن وهاجرن إلى المدينة وتزوجن هذا وقد كان عمر الرسول ﷺ حين تزوج خديجة رضي الله عنها خمساً وعشرين عام وكان عمرها أربعين عاماً.';
const String p4 =
    'لما بلغ محمد ﷺ خمساً وثلاثين سنة اجتمعت قريش لتجديد بناء الكعبة لما أصابها من حريق وسيل جارف صدّع جدرانها، وكانت لاتزال كما بناها إبراهيم عليه السلام رضما فوق القامة فأرادوا هدمها ليرفعوها ويسقفوها، ولكنهم هابوا هدمها وخافوا منه فقال الوليد بن المغيرة أنا أبدؤكم في هدمها فأخذ المعول ثم قام عليها وهو يقول: اللهم لم نزغ ولانريد إلا الخير وهدم من ناحية الركني: فتربص الناس تلك الليلة وقالوا: ننظر فإن أصيب لم نهدم منها شيئاً ورددناها كما كانت، وإن لم يصبه شيء فقد رضي الله ماصنعنا فأصبح الوليد غادياً يهدم وهدم الناس معه حتى انتهوا إلى حجارة خضرة كالأسمنة آخذ بعضها ببعض.';
const String p5 =
    'وكانوا قد جزؤوا العمل وخصوا كل قبيلة بناحية واشترك سادة قريش وشيوخها في نقل الحجارة ورفعها، وقد شارك النبي ﷺ وعمه العباس في بناء الكعبة وكانا ينقلان الحجارة، فقال العباس للنبي ﷺ : اجعل إزارك على رقبتك يقيك من الحجارة فخر إلى الأرض وطمحت عيناه إلى السماء ثم أفاق فقال: إزاري إزاري فشد عليه إزاره، فلما بلغوا موضع الحجر الأسود اختصموا فيه كل قبيلة تريد أن ترفعه إلى موضعه دون الأخرى، وكادوا يقتتلون فيما بينهم لولا أن أبا أمية بن المغيرة قال: يامعشر قريش! اجعلوا بينكم فيما تختلفون فيه أول من يدخل من باب المسجد، فلما توافقوا على ذلك دخل محمد ﷺ فلما رأوه قالوا: هذا الأمين قد رضينا فلما أخبروه الخبر قال: هلموا ثوباً فأتوه به فوضع الركن فيه بيديه ثم قال: لتأخذ كل قبيلة بناحية من الثوب ثم ارفعوا جميعاً فرفعوه حتى إذا بلغوا موضعه وضعه بيده ثم بنى عليه.';
const String p6 =
    'وأصبح ارتفاع الكعبة ثمانية عشر ذراعاً ورفع بابها عن الأرض بحيث يصعد إليه بدرج لئلا يدخل إليها كل أحد، فيدخلوا من شاؤوا وليمنعوا الماء من الشرب إلى جوفها، وأسند سقفها إلى ستة أعمدة من الخشب إلا أن قريشاً قصرت بها النفقة الطيبة عن اتمام البناء على قواعد اسماعيل، فأخرجوا منها الحجر وبنوا عليه جداراً قصيراً دلالة على أنه منها لأنهم شرطوا على أنفسهم أن لايدخل في بنائها إلا نفقة طيبة ولايدخلها مهر بغي ولابيع ربا ولا مظلمة لأحد.';
const String p7 =
    'دعا إبراهيم عليه السلام ربه أن يبعث في العرب رسولاً منهم فأرسل محمداً إجابة لدعوته قال تعالى: رَبَّنَا وَابْعَثْ فِيهِمْ رَسُولًا مِنْهُمْ يَتْلُو عَلَيْهِمْ ءَايَاتِكَ وَيُعَلِّمُهُمُ الْكِتَابَ وَالْحِكْمَةَ وَيُزَكِّيهِمْ إِنَّكَ أَنْتَ الْعَزِيزُ الْحَكِيمُ - سورة البقرة';
const String p8 =
    'وبشر به عيسى عليه السلام وأخبرنا الله تعالى عن بشارة عيسى قال تعالى: وَإِذْ قَالَ عِيسَى ابْنُ مَرْيَمَ يَابَنِي إِسْرَائِيلَ إِنِّي رَسُولُ اللَّهِ إِلَيْكُمْ مُصَدِّقًا لِمَا بَيْنَ يَدَيَّ مِنَ التَّوْرَاةِ وَمُبَشِّرًا بِرَسُولٍ يَأْتِي مِنْ بَعْدِي اسْمُهُ أَحْمَدُ فَلَمَّا جَاءَهُمْ بِالْبَيِّنَاتِ قَالُوا هَذَا سِحْرٌ مُبِينٌ - سورة الصف';
const String p9 =
    'وقد وقع التحريف في نسخ التوراة والإنجيل وحذف منهما التصريح باسم محمد ﷺ إلا توراة السامرة وإنجيل برنابا الذي كان موجوداً قبل الاسلام وحرّمت الكنيسة تداوله في آخر القرن الخامس الميلادي، وقد أيدته المخطوطات التي عثر عليها في منطقة البحر الميت حديثا،ً فقد جاء في إنجيل برنابا العبارات المصرحة باسم النبي محمد ﷺ مثل ماجاء في الإصحاح الحادي والأربعين منه ونص العبارة: فاحتجب الله وطردهما الملاك ميخائيل من الفردوس فلما التفت آدم رأى مكتوباً فوق الباب: لا إله إلا الله محمد رسول الله.';
const String p10 =
    'قال ابن تيمية: والأخبار بمعرفة أهل الكتاب بصفة محمد ﷺ عندهم في الكتب المتقدمة متواترة عنهم ثم قال: ثم العلم بأن الأنبياء قبله بشّروا به يعلم من وجوه: أحدهما : مافي الكتب الموجودة اليوم بأيدي أهل الكتاب، والثاني: إخبار من وقف على تلك الكتب ممن أسلم وممن لم يسلم بما وجدوه من ذكره بها، وهذا مثل ماتواتر عن الأنصار أن جيرانهم من أهل الكتاب كانوا يخبرون بمبعثه وأنه رسول الله وأنه موجود عندهم وكانوا ينتظرونه وكان هذا من أعظم مادعا الأنصار الى الإيمان به لما دعاهم الى الاسلام حتى آمن الانصار به وبايعوه.';
const String p11 =
    'ومن حديث كعب الأحبار قال: إني أجد في التوراة مكتوباً: محمد رسول الله لا فظ ولا غليظ ولا سخّاب في الأسواق ولا يجزي السيئة بالسيئة، ولكن يعفو ويصفح أمته الحمادون يحمدون الله في كل منزلة ويكبّرونه على كل نجد يأتزرون الى أنصافهم ويوضئون أطرافهم صفهم في الصلاة، وصفُّهم في القتال سواء مناديهم ينادي في جو السماء لهم في جوف الليل دوي كدوي النحل مولده بمكة ومهجره بطابة وملكه بالشام.';
const String p12 =
    'أخبر سلمان الفارسي رضي الله عنه في قصة إسلامه المشهورة عن راهب عمورية حين حضرته المنية قال لسلمان: إنه قد أظل زمان نبي مبعوث بدين إبراهيم يخرج بأرض العرب مهاجره، الى أرض بين حرتين بينهما نخل به علامات لاتخفى يأكل الهدية ولا يأكل الصدقة بين كتفيه خاتم النبوة فإن استطعت أن تلحق بتلك البلاد فأفعل، ثم قصّ سلمان خبر قدومه الى المدينة واسترقاقه ولقائه برسول الله ﷺ حين الهجرة واهدائه له طعاماً على أنه صدقة فلم يأكل منه الرسول ثم أهدائه له طعاماً على أنه هدية وأكله منه ثم رؤيته خاتم النبوة بين كتفيه وإسلامه على أثر ذلك.';
const String p13 =
    'ومن ذلك إخبار أحبار اليهود ورجالاتها بقرب مبعثه عليه الصلاة والسلام ومن ذلك قصة ابي التيهان الذي خرج من بلاد الشام ونزل في بني قريظة ثم توفي قبل البعثة النبوية بسنتين، فإنه لما حضرته الوفاة قال لبني قريظة: يامعشر يهود ماترونه أخرجني من أرض الخَمْر والخَمير -الشام- الى أرض البؤس والجوع -يعني: الحجاز-؟ قالوا: أنت أعلم قال: إني قدمت هذه البلدة أتوكَّفُ -انتظر- خروج نبي قد أظلَّ زمانه وكنت أرجوا أن يبعث فأتبعه.';
const String p14 =
    'وقد شاع حديث ذلك وانتشر بين اليهود وغيرهم حتى بلغ درجة القطع عندهم وبناء عليه كان اليهود يقولون لأهل المدينة المنورة: إنه قد تقارب زمان نبي يُبْعث الآن نقتلكم معه قلت عادٍ وإرم، وكان ذلك الحديث سبباً في إسلام رجال من الأنصار وقد قالوا: إن مما دعانا الى الاسلام مع رحمة الله تعالى وهداه لما كنا نسمع من رجال اليهود كنا أهل شرك أصحاب أوثان وكانوا أهل كتاب عندهم علم ليس لنا وكانت لا تزال بيننا وبينهم شرور فإذا نلنا منهم بعض مايكرهون قالوا لنا: إنه تقارب الزمان نبي يبعث الآن نقتلكم معه قتل عادٍ وإرم.';
const String p15 =
    'وقد قال هرقل ملك الروم عندما استلم رسالة النبي ﷺ : وقد كنت أعلم أنه خارج لم أكن أظن أنه منكم.';
const String p16 =
    'كانت قضية إزالة أنقاض الجاهلية ووثنية تخريبية تراكمت عبر القرون والأجيال ودفنت تحتها تعاليم الأنبياء والمرسلين وجهود المصلحين والمعلمين وإقامة بناء شامخ مشيد البنيان واسع الأرجاء يسع العالم كله، ويؤدي الأمم كلها قضية إنشاء إنسان جديد يختلف عن الانسان القديم في كل شيء كأنه ولد من جديد أو عاش من جديد قال تعالى: أَوَمَنْ كَانَ مَيْتًا فَأَحْيَيْنَاهُ وَجَعَلْنَا لَهُ نُورًا يَمْشِي بِهِ فِي النَّاسِ كَمَنْ مَثَلُهُ فِي الظُّلُمَاتِ لَيْسَ بِخَارِجٍ مِنْهَا كَذَلِكَ زُيِّنَ لِلْكَافِرِينَ مَا كَانُوا يَعْمَلُونَ - سورة الأنعام';
const String p17 =
    'وقضية اقتلاع جرثومة الفساد واستئصال شأفة الوثنية واجتثاثها من جذورها بحيث لا يبقى لها عين ولا أثر وترسيخ عقيدة التوحيد في أعماق النفس الإنسانية ترسيخاً لا يتصور فوقه، وغرس ميل الى إرضاء الله وعبادته وخدمة الانسانية والانتصار للحق يتغلب على كل رغبة ويقهر كل شهوة ويجرف كل مقاومة، وبالجملة الأخذ بحجز الانسانية المنتحرة التي استجمعت قواها للوثوب في جحيم الدنيا والآخرة والسلوك بها على طريق اولها سعادة يحظى بها العارفون المؤمنون وآخرها جنة الخلد التي وعد المتقون ولا تصوير أبلغ وأصدق من قوله تعالى في معرض المن ببعثة محمد ﷺ : وَاعْتَصِمُوا بِحَبْلِ اللَّهِ جَمِيعًا وَلاَ تَفَرَّقُوا وَاذْكُرُوا نِعْمَةَ اللَّهِ عَلَيْكُمْ إِذْ كُنْتُمْ أَعْدَاءً فَأَلَّفَ بَيْنَ قُلُوبِكُمْ فَأَصْبَحْتُمْ بِنِعْمَتِهِ إِخْوَانًا وَكُنْتُمْ عَلَى شَفَا حُفْرَةٍ مِنْ النَّارِ فَأَنْقَذَكُمْ مِنْهَا كَذَلِكَ يُبَيِّنُ اللَّهُ لَكُمْ آيَاتِهِ لَعَلَّكُمْ تَهْتَدُونَ - سورة آل عمران';
const String p18 =
    'الإرهاص هو الأمرُ الخارِق للعادة فمن إرهاصات نبوته ﷺ تسليم الحجر عليه قبل النبوة فعن جابر بن سمرة قال: قال رسول الله ﷺ : إني لأعرف حجراً بمكة كان يسلم عليّ قبل أن أبعث إني لأعرفه الآن، وكذلك الرؤيا الصادقة وهي أول مابدي له من الوحي فكان لايرى رؤيا إلا جاءت مثل فلق الصبح وحبب إليه ﷺ العزلة والتحنث التعبد فكان يخلو في غار حراء وهو جبل يقع في الجانب الشمالي الغربي من مكة، ويتعبد فيه الليالي ذوات العدد فتارة عشرة وتارة أكثر من ذلك الى شهر ثم يعود الى بيته فلا يكاد يمكث فيه قليلاً حتى يتزود من جديد لخلوة أخرى ويعود الكرة الى غار حراء وهكذا الى أن جاءه الوحي وهو في إحدى خلواته تلك.';
