const int sectionIndex = 36;
const String sectionTitle = 'غزوة أُحد - ويتخذ منكم شهداء';

const List t1 = ['1', 'سيد الشهداء'];
const List t2 = ['2', 'تحقق رؤيا رسول الله ﷺ'];
const List t3 = ['3', 'مصعب بن عمير رضي الله عنه'];
const List t4 = ['4', 'سعد بن الربيع رضي الله عنه'];
const List t5 = ['5', 'عبدالله بن جحش رضي الله عنه'];
const List t6 = ['6', 'حنظلة بن أبي عامر غَسِيل الملائكة'];
const List t7 = ['7', 'عبدالله بن عمرو بن حرام رضي الله عنه'];
const List t8 = ['8', 'خيثمة أبو سعد رضي الله عنه'];
const List t9 = ['9', 'عمرو بن الجموح رضي الله عنه'];
const List t10 = ['10', 'تفقد الرسول ﷺ للشهداء'];
const List t11 = ['11', 'صبر رسول الله ﷺ'];
const List t12 = ['12', 'صبر صفية بنت عبدالمطلب'];
const List t13 = ['13', 'صبر حَمنةُ بنت جحش رضي الله عنها'];
const List t14 = ['14', 'صبر كبشة الخزرجية رضي الله عنها'];
const List t15 = ['15', 'فضل الشهداء'];
const List t16 = ['16', 'إنما الأعمال بالنيات'];

const String p1 =
    'قاتل أسد الله حمزة بن عبد المطلب عمّ النبي قتالاً ضارياً وأثخن في المشركين قتلاً وأطاح برؤس نفر من حملة لواء المشركين من بني عبدالدار، وبينما هو على هذه الحال من الشجاعة والإقدام كمن له وحشي حتى تمكن منه ثم رماه بحربته فأصاب منه مقتلاً .';
const String p2 =
    'وبعد انتهاء المعركة سأل رسول الله ﷺ أصحابه: من رأى مقتل حمزة؟ فقال رجل: أنا رأيت مقتله قال: فانطلق أرناه فخرج رسول الله ﷺ حتى و قف على حمزة فرآه وقد شق بطنه وقد مثل به فقال: يارسول الله مثل به والله، وفي رواية لما بلغ النبي ﷺ قتل حمزة بكى فلما نظر إليه شهق ووقف بين ظهراني القتلى فقال: أنا شهيد على هؤلاء كفنوهم في دمائهم فإنه ليس جرح يجرح في الله إلا جاء يوم القيامة يدمي لونه لون الدم وريحه ريح المسك قدموا أكثرهم قرآنا فاجعلوه في اللحد.';
const String p3 =
    'وباستشهاد حمزة وأصحاب رسول الله ﷺ في أحد تحققت رؤية رسول الله ﷺ فقد أخبر أصحابه عن رؤياه قبل الخروج إلى أحد، فقال: رأيت في سيفي ذي الفقار فلاً فأولته فلاً يكون فيكم أي انهزاماً، ورأيت أني مردف كبشاً فأولته كبش الكتيبة ورأيت أني في درع حصينة فأولتها المدينة ورأيت بقراً تذبح فبقر والله خير فبقر والله خير فكان الذي قال رسول الله ﷺ .';
const String p4 =
    'قال خباب رضي الله عنه: هاجرنا مع رسول الله ﷺ ونحن نبتغي وجه الله فوقع أجرنا على الله، فمنا من مضى في سبيله ولم يأكل من أجره شيئاً منهم مصعب بن عمير قتل يوم أحد ولم يترك إلا نمرة كنا إذا غطينا رأسه بدت رجلاه وإذا غطينا رجليه بدا رأسه، فقال رسول الله ﷺ : غطوا رأسه واجعلوا على رجليه الأذخر ومنا من أينعت له ثمرته فهو يهديها، ومن حديث عبدالرحمن بن عوف أنه أتي بطعام وكان صائماً فقال: قتل مصعب بن عمير وهو خير مني كفن في بردة إن غطي رأسه وأراه قال: وقتل حمزة وهو خير مني ثم بسط لنا من الدنيا أو قال: أعطينا من الدنيا ما أعطينا - وقد خشينا أن تكون حسناتنا عجلت لنا، ثم جعل يبكي حتى ترك الطعام، ومن حديث أبي هريرة رضي الله عنه قال: إن رسول الله ﷺ حين انصرف من أحد مر على مصعب بن عمير وهو مقتول على طريقه فوقف عليه ودعا له ثم قرأ هذه الآية: مِنَ الْمُؤْمِنِينَ رِجَالٌ صَدَقُوا مَا عَاهَدُوا اللَّهَ عَلَيْهِ فَمِنْهُمْ مَنْ قَضَى نَحْبَهُ وَمِنْهُمْ مَنْ يَنْتَظِرُ وَمَا بَدَّلُوا تَبْدِيلا - سورة الأحزاب ،ثم قال رسول الله ﷺ : أشهد أن هؤلاء شهداء عند الله يوم القيامة فأتوهم وزوروهم والذي نفسي بيده لايسلم عليهم أحد إلى يوم القيامة إلا ردوا عليه.';
const String p5 =
    'هذا الذي استكتمه رسول الله ﷺ خبر مسير قريش، وكان رسول الله ﷺ يحبه فلما انتهت معركة أحد قال رسول الله ﷺ : من رجل ينظر مافعل سعد بن الربيع أفي الأحياء هو أم في الأموات؟ لأن النبي ﷺ قد رأى الأسنة شرعت إليه، فقال أبي بن كعب رضي الله عنه: أنا أنظره لك يارسول الله فقال له: إن رأيت سعد بن الربيع فاقرأه مني السلام، وقل له: يقول لك رسول الله ﷺ كيف يجدك؟ فنظر أبي فوجده جريحاً به رمق فقال له: إن رسول الله ﷺ أمرني أن أنظر أفي الأحياء أنت أم في الأموات فقال: قد طعنت اثنتي عشرة طعنة وقد انفذت إلى مقاتلي، وفي رواية صحيحة قال: على رسول الله وعليك السلام قل له: يارسول الله أجد ريح الجنة وقل لقومي الأنصار: لاعذر لكم عند الله إن خلص إلى رسول الله ﷺ وفيكم شفر يطرف قال: وفاضت نفسه رحمه الله، وهذا نصح لله ورسوله في سكرات الموت يدل على قوة الإيمان والحرص على الوفاء بالبيعة لم يتأثر بالموت ولا آلام القروح.';
const String p6 =
    'قال سعد بن أبي وقاص رضي الله عنه: أن عبدالله بن جحش قال له يوم أحد ألا تدعو الله، فخلوا في ناحية فدعا سعد فقال: يارب إذا لقيت العدو فلقني رجلاً شديداً بأسه شديداً حرده أقاتله ويقاتلني ثم ارزقني الظفر عليه حتى أقتله وآخذ سلبه، فأمن عبدالله بن جحش ثم قال: اللهم ارزقني رجلاً شديداً حرده شديداً بأسه أقاتله فيك ويقاتلني ثم يأخذني فيجدع أنفي وأذني فإذا لقيتك غداً قلت: من جدع أنفك وأذنك فأقول: فيك وفي رسولك فتقول صدقت: قال سعد يابني كانت دعوة عبدالله بن جحش خيراً من دعوتي لقد رأيته آخر النهار وإن أنفه وأذنه لمعلقان في خيط، وفي هذا الخبر جواز دعاء الرجل أن يقتل في سبيل الله وتمنيه ذلك وليس هذا من تمني الموت المنهي عنه.';
const String p7 =
    'لمّا انكشف المشركون ضرب حنظلة فرس أبي سفيان بن حرب فوقع على الأرض، فصاح وحنظلة يريد ذبحه فأدركه الأسود بن شدّاد ويقال له ابن شعوب فحمل على حنظلة بالرمح فأنفذه ومشى إليه حنظلة بالرمح وقد أثبته ثم ضرب الثانية فقتله، فذكر ذلك لرسول الله ﷺ فقال: إني رأيت الملائكة تغسِّله بين السماء والأرض بماء المزن في صحاف الفضة فقال رسول الله ﷺ :فأسالوا أهله ماشأنه؟ فسألوا صاحبته عنه فقالت: خرج وهو جُنُب حين سمع الهاتفة فقال رسول الله ﷺ : فلذلك غسلته الملائكة.';
const String p8 =
    'أصر عبدالله بن عمرو بن حرام على الخروج في غزوة أحد فخاطب أبنه جابر بقوله: ياجابر .. لاعليك أن تكون في نظاري المدينة حتى تعلم إلى مايصير أمرنا فإني والله لولا أني أترك بنات لي بعدي لأحببت أن تقتل بين يدي وقالً: ماأراني إلا مقتولاً في أول من يقتل من أصحاب النبي ﷺ وإني لا أترك بعدي أعزّ علي منك غير نفس رسول الله ﷺ وإن عليَّ ديناً فاقض واستوص بأخواتك خيراً.';
const String p9 =
    'وقال رسول الله ﷺ ياجابر: مالي أراك منكسراً؟ قال: يارسول الله استشهد أبي وترك عيالاً وديناً، قال ﷺ : أفلا أبشرك بما لقي الله به أباك؟ قال: بلى يارسول الله قال ﷺ : ماكلم الله أحداً قط إلاّ من وراء حجاب وكلّم أباك كفاحاً -ليس بينهما حجاب- ياجابر أما علمت أن الله أحيا أباك فقال: ياعبدي تمنَّ علي أعطك، قال: يارب تحييني فأقتل فيك ثانية، فقال الرب سبحانه: إنه سبق مني أنهم إليها لايرجعون قال: يارب فأبلغ من ورائي، فأنزل الله تعالى: وَلا تَحْسَبَنَّ الَّذِينَ قُتِلُوا فِي سَبِيلِ اللَّهِ أَمْوَاتًا بَلْ أَحْيَاءٌ عِنْدَ رَبِّهِمْ يُرْزَقُونَ - سورة آل عمران';
const String p10 =
    'وقد رأى عبدالله بن عمرو رؤية في منامه قبل أحد قال: رأيت في النوم قبل أحد مبشِّر بن عبدالمنذر يقول لي: أنت قادم علينا في أيام فقلت: وأين أنت؟ فقال: في الجنة نَسْرَحُ فيها كيف نشاء قلت له: ألم تقتل يوم بدر؟ قال: بلى ثم أُحييتُ فذكر ذلك لرسول الله ﷺ فقال هذه الشهادة يا أبا جابر وقد تحققت تلك الرؤيا بفضل الله ومنه.';
const String p11 =
    'قال خيثمة أبو سعد وكان ابنه استشهد مع رسول الله ﷺ يوم بدر، لقد أخطأتني وقعة بدر وكنت والله عليها حريصاً حتى ساهمتُ ابني في الخروج فخرج سهمه فرزق الشهادة وقد رأيت البارحة ابني في النوم في أحسن صورة يسرح في ثمار الجنة وأنهارها ويقول: الحق بنا ترافقنا في الجنة فقد وجدت ماوعدني ربي حقاً وقد والله يارسول الله أصبحت مشتاقاً إلى مرافقته في الجنة، وقد كبرت سِنِّي ورقَّ عظمي وأحببت لقاء ربي فادع الله يارسول الله أن يرزقني الشهادة ومرافقة سعد في الجنة فدعا له رسول الله ﷺ بذلك فقتل بأحد شهيداً.';
const String p12 =
    'كان عمرو بن الجموح رضي الله عنه أعرج شديد العرج وكان له بنون أربعة مثل الأُسْد يشهدون مع رسول الله ﷺ المشاهد وهم خلاد ومُعوَّذ ومُعاذ وأبو أيمن، فلما كان يوم أُحد أرادوا حبسه وقالوا: إن الله عزوجل قد عذرك فأتى رسول الله ﷺ فقال: إن بنيَّ يريدون أن يحبسوني عن هذا الوجه وللخروج معك فيه فوالله إني لأرجو أن أطأ بعرجتي هذه في الجنة، فقال له رسول الله ﷺ : أمّا أنت فقد عذرك الله تعالى فلا جهاد عليك وقال لبنيه: ماعليكم ألاّ تمنعوه لعل الله أن يرزقه الشهادة فخرج وهو يقول مستقبل القبلة: اللهم لاتردّني إلى أهلي خائباً فقتل شهيداً.';
const String p13 =
    'بعد أن انسحب أبو سفيان من أرض المعركة ذهب رسول ﷺ ليتفقد أصحابه رضي الله عنهم، فمر على بعضهم ومنهم حمزة بن عبدالمطلب ومصعب بن عمير وحنظلة بن أبي عامر وسعد بن الربيع والأصيرم وبقية الصحابة رضي الله عنهم، فلما أشرف عليهم رسول الله ﷺ قال: أنا شهيد على هؤلاء إنه مامن جريح يجرح في الله إلا والله بعثه يوم القيامة يدمي جرحه اللون لون دم والريح ريح المسك انظروا أكثر هؤلاء جمعاً للقرآن فاجعلوه أمام أصحابه في القبر.';
const String p14 =
    'وقال جابر بن عبدالله في رواية البخاري :أن النبي ﷺ كان يجمع بين الرجلين من قتلى أحد في ثوب واحد ثم يقول: أيهم أكثر أخذاً للقرآن؟ فإذا أشير له إلى واحد قدّمه في اللحد وقال: أنا شهيد على هؤلاء يوم القيامة وأمر بدفنهم بدمائهم ولم يصل عليهم ولم يغسلوا، وأمر رسول الله ﷺ أن يدفنوا حيث صرعوا وأعيد من أخذ ليدفن داخل المدينة.';
const String p15 =
    'ولما رأى رسول الله ﷺ حمزة بن عبدالمطلب وقد مثل به حزن حزناً شديداً، وبكى حتى نشغ من البكاء وقال ﷺ : لولا أن تحزن صفية ويكون سنة من بعدي لتركته حتى يكون في بطون السباع وحواصل الطير، ولئن أظهرني الله على قريش في موطن من المواطن لأمثلن بثلاثين رجلاً منهم فلما رأى المسلمون حزن رسول الله ﷺ وغيظه على من فعل بعمه مافعل قالوا: والله لئن ظفرنا الله بهم يوماً من الدهر لنمثلن بهم مُثلَة لم يمثلها أحد من العرب فنزل قول الله تعالى: وَإِنْ عَاقَبْتُمْ فَعَاقِبُوا بِمِثْلِ مَا عُوقِبْتُمْ بِهِ وَلَئِنْ صَبَرْتُمْ لَهُوَ خَيْرٌ لِلصَّابِرِينَ - سورة النحل ،لقد ارتكب المشركون صوراً من الوحشية حيث قاموا بالتمثيل في قتلى المسلمين فبقروا بطون كثير من القتلى وجدعوا أنوفهم وقطعوا الآذان ومذاكير بعضهم.';
const String p16 =
    'ومع ذلك صبر رسول الله ﷺ وأصحابه واستجابوا لتوجيه المولى عزوجل فعفا وصبر وكفّر عن يمينه ونهى عن المثلة روى ابن اسحاق بسنده عن سمرة بن جندب قال:ماقام رسول الله ﷺ في مقام قط ففارقه حتى يأمرنا بالصدقة وينهانا عن المثلة.';

const String p17 =
    'لما استشهد أخوها حمزة بن عبدالمطلب رضي الله عنه في أحد، وجاءت لتنظر إليه وقد مثل به المشركون فجدعوا أنفه وبقروا بطنه وقطعوا أذنيه ومذاكيره فقال رسول الله ﷺ لابنها الزبير بن العوام:القها فأرجعها لاترى ما بأخيها فقال لها: يا أمه إن رسول الله ﷺ يأمرك أن ترجعي قالت: ولم؟ وقد بلغني أنه قد مثل بأخي وذلك في الله فما أرضانا بما كان من ذلك! لأحتسبن ولأصبرن إن شاء الله.';
const String p18 =
    'فوقفت وأخرجت ثوبين معها فقالت: هذان ثوبان جئت بهما لأخي حمزة فكفنوه فيهما،  فجئنا بالثوبين لنكفن فيهما حمزة فإذا إلى جنبه رجل من الأنصار قتيل فعل به كما فعل بحمزة قال: فوجدنا غضاضة وخنى أن يكفن حمزة في ثوبين والأنصاري لاكفن له فقلنا لحمزة ثوب وللأنصاري ثوب فقدرناهما فكان أحدهما أكبر من الآخر فأقرعنا بينهما فكفنا كل واحد منهما في الثوب الذي صار له.';
const String p19 =
    'لما فرغ رسول الله ﷺ من دفن أصحابه رضي الله عنهم، ركب فرسه وخرج المسلمون حوله راجعين إلى المدينة فلقيته حَمْنَةُ بنت جحش فقال لها رسول الله ﷺ : ياحمنة: احتسبي قالت: من يارسول الله؟ قال: خالك حمزة بن عبدالمطلب قالت: إنا لله وإنا إليه راجعون غفر الله له هنيئاً له الشهادة ثم قال لها: احتسبي: قالت: من يارسول الله؟ قال: زوجك مصعب بن عمير قالت: واحزناه وصاحت وولولت فقال رسول الله ﷺ : إن زوج المرأة منها لَبِمَكَان لما رأى من تثبتها على أخيها وخالها وصياحها على زوجها ثم قال لها: ولم قلت هذا؟ قالت: يارسول الله ذكرت يُتْمُ بنيه فراعني فدعا لها رسول الله ﷺ ولِوَلدها أن يحسن الله تعالى عليهم من الخلف، فتزوجت طلحة بن عبيدالله فولدت منه محمداً وعمران وكان محمد بن طلحة أوصل الناس لولدها .';
const String p20 =
    'خرجت تعدو نحو رسول الله ﷺ ، ورسول الله واقف على فرسه وسعد بن معاذ آخذ بعنان فرسه فقال سعد: يارسول الله أمِّي فقال رسول الله مرحباً بها فدنت حتى تأمّلت رسول الله فقالت: أما إذا رأيتك سالماً فقد أشوَت المصيبة فعزّاها رسول الله ﷺ بعمرو بن معاذ ابنها ثم قال: يا أم سعد أبشري وبشرِّي أهليهم أنَّ قتلاهم قد ترافقوا في الجنة جميعاً - وهم اثنا عشر رجلاً - وقد شُفّعوا في أهليهم، قالت: رضينا يارسول الله ومن يبكي عليهم بعد هذا؟ ثم قالت: ادع يارسول الله لمن خُلِّفوا، فقال رسول الله ﷺ : اللهم أذهب حُزن قلوبهم واجْبُر مصيبتهم وأحسن الخَلَف على من خُلّفوا.';
const String p21 =
    'قال رسول الله ﷺ : لما أصيب إخوانكم بأحد جعل الله أرواحهم في أجواف طيرٍ خضر ترد أنهار الجنة وتأكل من ثمارها وتأوي إلى قناديل من ذهب في ظل العرش، فلما وجدوا طيب مشربهم ومأكلهم وحسن مقيلهم، قالوا: ياليت إخواننا يعلمون ماصنع الله بنا لئلا يزهدوا في الجهاد ولاينكلوا عن الحرب، فقال عزوجل: أنا أبلغهم عنكم فأنزل الله عزوجل على رسوله ﷺ هذه الآيات قال تعالى: وَلا تَحْسَبَنَّ الَّذِينَ قُتِلُوا فِي سَبِيلِ اللَّهِ أَمْوَاتًا بَلْ أَحْيَاءٌ عِنْدَ رَبِّهِمْ يُرْزَقُونَ فَرِحِينَ بِمَا ءَاتَاهُمُ اللَّهُ مِنْ فَضْلِهِ وَيَسْتَبْشِرُونَ بِالَّذِينَ لَمْ يَلْحَقُوا بِهِمْ مِنْ خَلْفِهِمْ أَلا خَوْفٌ عَلَيْهِمْ وَلا هُمْ يَحْزَنُونَ يَسْتَبْشِرُونَ بِنِعْمَةٍ مِنَ اللَّهِ وَفَضْلٍ وَأَنَّ اللَّهَ لا يُضِيعُ أَجْرَ الْمُؤْمِنِينَ - سورة آل عمران';
const String p22 =
    'كان ممن قاتل مع المسلمين يوم أحد رجل يدعى قزمان كان يعرف بالشجاعة، وكان رسول الله ﷺ يقول إذا ذُكر له: إنه من أهل النار فتأخر يوم أحد فعيَّرته نساء بني ظَفَر فأتى رسول الله ﷺ وهو يسوي الصفوف حتى انتهى إلى الصف الأول، فكان أول من رمى من المسلمين بسهم فجعل يرسل نبلا كأنها الرماح ويكتُّ كتيت الجمل، ثم فعل بالسيف الأفاعيل حتى قتل سبعة أو تسعة وأصابته جراحه فوقع فناداه قتادة بن النعمان: يا أبا الغْيداق هنيئاً لك الشهادة وجعل رجال من المسلمين يقولون له: والله لقد أبليت اليوم ياقُزمان فأبشر قال بماذا؟ فوالله ماقاتلت إلا على أحساب قومي فلولا ذلك ماقاتلت، فذكر ذلك لرسول الله ﷺ فقال: إنه من أهل النار إن الله تعالى يؤيد هذا الدين بالرجل الفاجر، وفي هذا الخبر بيان لمكان النية في الجهاد وأنه من قاتل حمية عن قومه أو ليقال شجاع ولم تكن أعماله لله تعالى لايقبل الله منه.';
