const int sectionIndex = 47;
const String sectionTitle = 'الأحزاب - الأنتقام من المسلمين';

const List t1 = ['1', 'خروج يهود بني النضير'];
const List t2 = ['2', 'اليهود وأعراب غطفان'];
const List t3 = ['3', 'متابعة المسلمين للأحزاب'];
const List t4 = ['4', 'الخندق'];
const List t5 = ['5', 'جوانب الخندق'];
const List t6 = ['6', 'الجبهة الداخلية'];
const List t7 = ['7', 'مشاركة رسول الله ﷺ بالحفر'];
const List t8 = ['8', 'رفع معنويات الجنود'];
const List t9 = ['9', 'اللهم لولا أنت ما اهتدينا'];
const List t10 = ['10', 'نحن الذين بايعوا محمداً'];
const List t11 = ['11', 'تقدير الظروف والإذن بالإنصراف'];
const List t12 = ['12', 'تقسيم دوريات الحراسة'];

const String p1 =
    'خرج يهود بني النضير من المدينة إلى خيبر وهم يحملون معهم أحقادهم على المسلمين فما أن استقروا بخيبر حتى أخذوا يرسمون الخطط للانتقام من المسلمين، فاتفقت كلمتهم على التوجه إلى القبائل العربية المختلفة لتحريضها على حرب المسلمين وكوّنوا لهذا الغرض الخبيث وفداً يتكون من سلام بن أبي الحقيق وحيي بن أخطب وكنانة بن الربيع بن أبي الحقيق وهوذة بن قيس الوائلي وأبي عمار، وقد نجح الوفد نجاحاً كبيراً في مهمته، حيث وافقت قريش التي شعرت بمرارة الحصار الاقتصادي المضروب عليها من قبل المسلمين، ووافقت غطفان طمعاً في خيرات المدينة وفي السلب والنهب وتابعتهم قبائل أخرى.';
const String p2 =
    'وقد قال وفد اليهود لمشركي مكة أن دينكم خير من دين محمد وأنتم أولى بالحق منه وعن ذلك يقول الله تعالى : أَلَمْ تَرَ إِلَى الَّذِينَ أُوتُوا نَصِيبًا مِنَ الْكِتَابِ يُؤْمِنُونَ بِالْجِبْتِ وَالطَّاغُوتِ وَيَقُولُونَ لِلَّذِينَ كَفَرُوا هَؤُلاءِ أَهْدَى مِنَ الَّذِينَ ءَامَنُوا سَبِيلا أُولَئِكَ الَّذِينَ لَعَنَهُمُ اللَّهُ وَمَنْ يَلْعَنِ اللَّهُ فَلَنْ تَجِدَ لَهُ نَصِيرًا - سورة النساء';
const String p3 =
    'وقد أبرم الوفد اليهودي مع زعماء أعراب غطفان اتفاقية الاتحاد العربي الوثني اليهودي العسكري ضد المسلمين، وكان من بنود الاتفاق : أن تكون قوة غطفان في جيش الاتحاد هذا ستة آلاف مقاتل ، وأن يدفع اليهود لقبائل غطفان مقابل ذلك كل تمر خيبر لسنة واحدة، ولقد استطاع وفد اليهود أن يرجع من رحلته إلى المدينة ومعه عشرة آلاف مقاتل، أربعة آلاف من قريش وأحلافهما، وستة آلاف من غطفان وأحلافها، وقد نزلت تلك الأعداد الهائلة بالقرب من المدينة.';
const String p4 =
    'كان جهاز أمن الدولة الإسلامية على حذر تام من أعدائه، لذا فقد كان يتتبع أخبار الأحزاب ويرصد تحركاتهم ويتابع حركة الوفد اليهودي منذ خرج من خيبر في اتجاه مكة، وكان على علم تام بكل مايجري بين الوفد اليهودي وبين قريش أولاً ثم غطفان ثانياً، وبمجرد حصول المدينة على هذه المعلومات عن العدو شرع الرسول ﷺ في اتخاذ الإجراءات الدفاعية اللازمة، ودعا إلى اجتماع عاجل حضره كبار قادة جيش المسلمين من المهاجرين والأنصار، بحث فيه معهم هذا الموقف الخطير الناجم عن مساعي اليهود الخبيثة ، فأدلى سلمان الفارسي رضي الله عنه برأيه الذي يتضمن حفر خندق كبير لصدّ عدوان الأحزاب، فأعجب النبي ﷺ بذلك قال الواقدي رحمه الله فقال سلمان: يارسول الله: إنا إذا كنا بأرض فارس وتخوّفنا الخيل، خندقنا علينا، فهل لك يارسول الله أن تخندق؟ فأعجب رأي سليمان المسلمين.';
const String p5 =
    'وعندما استقر الرأي -بعد المشاورة- على حفر الخندق، ذهب النبي ﷺ هو وبعض أصحابه لتحديد مكانه واختار للمسلمين مكاناً تتوافر فيه الحماية للجيش، فقد ذكر الواقدي: أن رسول الله ﷺ ركب فرساً له ومعه نفر من أصحابه من المهاجرين والأنصار، فارتاد موضعاً ينزله فكان أعجب المنازل إليه أن يجعل سَلْعاً خلف ظهره ويخندق من المذاد إلى ذباب - أكمة صغيرة في المدينة يفصل بينها وبين جبل سلع ثنية الوداع إلى راتج -حصن من حصون المدينة لأناس من اليهود- وقد استفاد ﷺ من مناعة جبل سَلْع في حماية ظهور الصحابة.';
const String p6 =
    'كان اختيار تلك المواقع موفقاً، لأن شمال المدينة هو الجانب المكشوف أمام العدو والذي يستطيع منه دخول المدينة وتهديدها أما الجوانب الأخرى فهي حصينة منيعة، تقف عقبة أمام أي هجوم يقوم به الأعداء، فكانت الدور من ناحية الجنوب متلاصقة عالية كالسور المنيع وكانت حرة واقم من جهة الشرق، وحرة الوبرة من جهة الغرب، تقومان كحصن طبيعي، وكانت آطام بني قريظة في الجنوب الشرقي كقبلة بتأمين ظهر المسلمين، وكان بين الرسول وبني قريظة عهد ألاَّ يمالوا عليه أحد، ولايناصروا عدواً ضده.';
const String p7 =
    'لقد كانت خطة الرسول ﷺ في الخندق متطورة، ومتقدمة حيث شرع بالأخذ بالأساليب الجديدة في القتال ولم يكن حفر الخندق من الأمور المعروفة لدى العرب في حروبهم بل كان الأخذ بهذا الأسلوب غريباً عنهم، وبهذا يكون الرسول ﷺ هو أول من استعمل الخندق في الحروب في تاريخ العرب والمسلمين.';
const String p8 =
    'لما علم النبي ﷺ بقدوم جيش الأحزاب وأراد الخروج إلى الخندق أمر بوضع ذراري المسلمين -جمع ذُرّيّة- ونسائهم وصبيانهم، في حصن بني حارثة حتى يكونوا في مأمن من خطر الأعداء، وقد فعل ذلك ﷺ لأن حماية الذراري والنساء والصبيان لها أثر فعال على معنويات المقاتلين، لأن الجندي إذا اطمأن على زوجه وأبنائه يكون مرتاح الضمير هادئ الأعصاب فلا يشغل تفكيره أمر من أمور الحياة.';
const String p9 =
    'شارك النبي ﷺ جنده في العمل المضني فأخذ يعمل بيده الشريفة، في حفر الخندق، فعن ابن اسحاق، قال:سمعت البراء يحدث قال: لما كان يوم الأحزاب وخندق رسول الله ﷺ رأيته ينقل من تراب الخندق حتى وارى عني التراب جلدة بطنه وكان كثير الشعر، فعمل رسول الله ﷺ مع الصحابة بهمة عالية لاتعرف الكلل، فأعطى القدوة الحسنة لأصحابه حتى بذلوا مافي وسعهم لإنجاز حفر ذلك الخندق.';
const String p10 =
    'وكان ﷺ يشارك الصحابة رضي الله عنهم في آلامهم وآمالهم، بل كان يستأثر بالمصاعب الجمة دونهم، ففي غزوة الأحزاب نجد أنه ﷺ كان يعاني من ألم الجوع كغيره، بل أشد، حيث وصل به الأمر إلى أن يربط حجراً على بطنه الشريف من شدة الجوع ، ثم إنه ﷺ شاركهم في آمالهم فحين وجد مايسدّ رمقه بعد هذا الجوع الذي استمر ثلاثاً، لم يستأثر بذلك دونهم.';
const String p11 =
    'اقترن حفر الخندق بصعوبات جمة فقد كان الجو بارداً والريح شديدة، والحالة المعيشية صعبة، بالإضافة إلى الخوف من قدوم العدو الذي يتوقعونه في كل لحظة، ويضاف إلى ذلك العمل المضني حيث كان الصحابة يحفرون بأيديهم وينقلون التراب على ظهورهم، ولاشك في أن هذا الظرف - بطبيعة الحال - يحتاج إلى قدر كبير من الحزم والجد، ولكن النبي ﷺ لم ينسى في هذا الظرف أن هؤلاء الجند إنما هم بشر كغيرهم، لهم نفوس بحاجة إلى الراحة من عناء العمل، كما أنها بحاجة إلى من يدخل السرور حتى تنسى تلك الآلام التي تعانيها فوق معاناة العمل الرئيسي.';
const String p12 =
    'ولهذا نجد أن النبي ﷺ كان يرتجز بكلمات ابن رواحة وهو ينقل التراب :';
const String p13 = 'اللهم لولا أنت مااهتدينا .. ولاتصدقنا ولاصلينا';
const String p14 = 'فأنزلن سكينة علينا .. وثبت الأقدام إن لاقينا';
const String p15 = 'إن الأعادي قد بَغوا علينا .. وإن أرادوا فتنة أبينا';
const String p16 = 'ثم يمد صوته بآخرها .. أبينا أبينا';
const String p17 =
    'وعن أنس رضي الله عنه أن اصحاب محمد ﷺ كانوا يقولون يوم الخندق:';
const String p18 = 'نحن الذين بايعوا محمداً .. على الإسلام مابقينا أبداً';
const String p19 =
    'وقال على الجهاد والنبي يقول: اللهم لا خيرَ إلا خير الآخرة .. فاغفر للأنصار والمهاجرة';
const String p20 =
    'كان الصحابة رضي الله عنهم على قدر كبير من الأدب مع النبي ﷺ فكانوا يستأذنونه في الإنصراف إذا عرضت لهم ضرورة، فيذهبون لقضاء حوائجهم ثم يرجعون إلى ماكانوا فيه من العمل، رغبة في الخير واحتساباً له فأنزل الله فيهم: إِنَّمَا الْمُؤْمِنُونَ الَّذِينَ ءَامَنُوا بِاللَّهِ وَرَسُولِهِ وَإِذَا كَانُوا مَعَهُ عَلَى أَمْرٍ جَامِعٍ لَمْ يَذْهَبُوا حَتَّى يَسْتَأْذِنُوهُ إِنَّ الَّذِينَ يَسْتَأْذِنُونَكَ أُولَئِكَ الَّذِينَ يُؤْمِنُونَ بِاللَّهِ وَرَسُولِهِ فَإِذَا اسْتَأْذَنُوكَ لِبَعْضِ شَأْنِهِمْ فَأْذَنْ لِمَنْ شِئْتَ مِنْهُمْ وَاسْتَغْفِرْ لَهُمُ اللَّهَ إِنَّ اللَّهَ غَفُورٌ رَحِيمٌ - سورة النور.';
const String p21 =
    'قسم النبي ﷺ أصحابه إلى مجموعات للحراسة ومقاومة كل من يريد أن يخترق الخندق وقام المسلمون بواجبهم في حراسة الخندق وحراسة نبيهم ﷺ واستطاعوا أن يصدوا كل هجوم حاول المشركون شنه، وكانوا على أهبة الاستعداد جنوداً وقيادة، حتى انهم استمروا ذات يوم من السحر إلى هوي من الليل في اليوم الثاني، ويفوت المسلمون الصلوات الأربع، ويقضونها لعجزهم عن التوقف لحظة واحدة أثناء الاشتباك المباشر للقتال، واستطاع علي بن أبي طالب مع مجموعة من الصحابة أن يصدوا محاولة عكرمة بن أبي جهل بل تصدى علي لبطل قريش عمرو بن عبد ود وقتله وكانت هناك مجموعة من الأنصار تقوم بحراسة النبي ﷺ في كل ليلة على رأسهم عبّاد بن بشر رضي الله عنه فالنبي ﷺ هو القائد الأعلى وهو المشرف المباشر على إدارة المعركة فهو الذي يرسم الخطط ويراقب تنفيذها.';
