const int sectionIndex = 6;
const String sectionTitle = 'ميلاده ﷺ';

const List t1 = ['1', 'نسب النبي ﷺ'];
const List t2 = ['2', 'النسمة المباركة'];
const List t3 = ['3', 'حليمة السعديّة'];
const List t4 = ['4', 'حادثة شق الصدر'];
const List t5 = ['5', 'تأملات من ميلاده ﷺ'];

const String p1 =
    'ذكر الإمام البخاري رحمه الله نسب النبي ﷺ فقال: هو أبو القاسم محمد بن عبدالله بن عبد المطلب بن هاشم بن عبد مناف بن قصي بن كلاب بن مرة بن كعب بن لؤي بن غالب بن فهر بن مالك بن النضر بن كنانة بن خزيمة بن مدركة ابن إلياس بن مضر بن نزار بن معد بن عدنان بن إسماعيل بن إبراهيم.';
const String p2 =
    'كان عبدالله بن عبدالمطلب من أحب ولد أبيه إليه، وزوجه من أشرف نساء مكة نسباً وهي آمنة بنت وهب، ولم يلبث أبوه أن توفى بعد أن حملت به آمنة ودفن بالمدينة عند أخواله بني عدي بن النجار فإنه كان قد ذهب بتجارة إلى الشام فأدركته منيته بالمدينة وهو راجع، وترك هذه النسمة المباركة، وكأن القدر يقول له أنك قد انتهت مهمتك في الحياة وهذا الجنين الطاهر يتولى الله عزوجل بحكمته ورحمته تربيته وتأديبه وإعداده لإخراج البشرية من الظلمات إلى النور، وقد قال رسول الله ﷺ : أنا دعوة أبي إبراهيم وبشرى عيسى ورأت أمي أنه يخرج منها نور أضاءت منه قصور الشام.';

const String p3 =
    'وقد ولد الحبيب المصطفى ﷺ فى عام الفيل يوم الإثنين بلا خلاف والأكثرون على أنه ليلة الثاني عشر منه وكانت والدته في دار أبي طالب بشعب بني هاشم.';

const String p4 =
    'وتقص علينا حليمة السعدية خبراً فريداً عن بركات الحبيب المصطفى ﷺ التي مستها في نفسها وولدها ورعيها وبنتها.';
const String p5 =
    'فعن عبدالله بن جعفر رضي الله عنهما: قال: لما ولد رسول الله ﷺ ، قدمت حليمة بنت الحارث في نسوة من بني سعد بن بكر يلتمسون الرضعاء بمكة، قالت حليمة: فخرجت في أوائل النسوة على أتان لي قمراء ومعي زوجي الحارث بن عبدالعزى أحد بني سعد بن بكر ثم أحد بني ناضرة قد أدمت أتاننا ومعي بالركب شارف والله ماتبض بقطرة لبن في سنة شهباء قد جاع الناس حتى خلص إليهم الجهد، ومعي ابن لي والله ماينام ليلنا وما أحد في يدي شيئاً أعلله به إلا أنا نرجو الغيث وكانت لنا غنم فنحن نرجوها.';
const String p6 =
    'فلما قدمنا مكة فما بقي منا أحد إلا عرض عليها رسول الله ﷺ فكرهته، فقلنا: إنه يتيم وإنما يكرم الظئر ويحسن إليها الوالد، فقلنا: ماعسى أن تضع بنا أمه أو عمه أو جده فكلُّ صواحبي أخذ رضيعاً فلما لم أجد غيره رجعت إليه وأخذته، والله مأخذته إلا إني لم أجد غيره فقلت لصاحبي: والله لأخذنَّ هذا اليتيم من بني عبدالمطلب فعسى الله أن ينفعنا به ولا أرجع من بين صواحبي ولا آخذ شيئاً.';
const String p7 =
    'قالت: فأخذته فأتيت به الرَّحْلَ فوالله ماهو إلا أن أتيت به الرَّحْلَ فأمسيت أقبل ثدياي باللبن حتى أرويته وأرويت أخاه، قام أبوه الى شارفنا تلك يلمسها فإذا هي حافل فحلبها فأرواني وروي فقال: ياحليمة تعلمين والله لقد أصبنا نسمة مباركة.';
const String p8 =
    'قالت: فبينما هو يلعب خلف البيوت هو وأخوه في بُهْم له إذ أتى أخوه يشتدُّ وأنا وأبوه في البدن فقال: إن أخي القرشي أتاه رجلان عليهما ثياب بيض فأخذاه واضطجعاه فشقّا بطنه، فخرجت أنا وابوه يشتدُّ فوجدناه قائماً قد انتقع لونه، فلما رآنا أجهش إلينا وبكى قالت: فالتزمته أنا وأبوه فضممناه إلينا: مالك بأبي وأمي؟ فقال: أتاني رجلان وأضجعاني فشقا بطني ووضعا به شيئاً ثم رداه كما هو.';
const String p9 =
    'فقال أبوه: والله ماأرى ابني إلا وقد أصيب إلحقي بأهله فرديه إليهم قبل أن يظهر له مانتخوف منه قالت: فاحتملناه فقدمنا به على أمه فلما رأتنا أنكرت شأننا وقالت: مارجعكما به قبل أن أسألكماه وقد كنتما حريصين على حبسه؟ فقلنا: لا شيء إلا أن قضى الله الرضاعة وسرّنا مانرى وقلنا: نؤويه كما تحبون أحبّ إلينا.';
const String p10 =
    'قال: فقالت: إن لكما شأنا فأخبراني ماهو فلم تدعنا حتى أخبرناها فقال: كلا والله لايصنع الله ذلك به إن لابني شأنا أفلا أخبركما خبره إني حملت به فوالله ماحملت حملاً قط كان أخف عليّ منه ولا ايسر منه ثم أُريت حين حملته خرج مني نور أضاء منه أعناق الأبل ببصرى -أو قالت: قصور بصرى- ثم وضعته حين وضعته فوالله ماوقع كما يقع الصبيان لقد وقع معتمداً بيديه على الأرض رافعاً رأسه الى السماء فدعاه عنكما فقبضه وانطلقنا.';
const String p11 =
    'قال الشيخ محمد الغزالي رحمه الله: وتنشئة الأولاد في البادية ليمرحوا في كنف الطبيعة ويستمتعوا بجوها الطلق، إنها لتعاسة أن يعيش أولادنا في شقق ضيقة من بيوت متلاصقة كأنها علب أغلقت على من فيها وحرمتهم لذة التنفس العميق والهواء المنعش.';
const String p12 =
    'وتعلم رسول الله ﷺ في بادية بني سعد اللسان العربي الفصيح، وأصبح فيما بعد من أفصح الخلق، فعندما قال له ابوبكر رضي الله عنه يارسول الله مارأيت افصح منك فقال ﷺ : وما يمنعني وأنا من قريش وأرضعت من بني سعد.';
