const int sectionIndex = 9;
const String sectionTitle = 'نزول الوحي';

const List t1 = ['1', 'نزول الوحي على سيد الخلق أجمعين'];
const List t2 = ['2', 'تصرف خديجة مع رسول الله ﷺ'];
const List t3 = ['3', 'الأمر الرباني بتبليغ الرسالة'];
const List t4 = ['4', 'إسلام السيدة خديجة رضي الله عنها'];
const List t5 = ['5', 'إسلام علي بن أبي طالب رضي الله عنه'];
const List t6 = ['6', 'إسلام أبي بكر الصديق رضي الله عنه'];
const List t7 = ['7', 'السابقون الأولون'];
const List t8 = ['8', 'الاصطفاء والاختيار'];

const String p1 =
    'كان عُمر النبي ﷺ كان قد بلغ الأربعين و يخلو في غار حراء بنفسه ويتفكر في هذا الكون وخالقه وكان تعبده في الغار قل ليالي حتى إذا نفذ الزاد عاد الى بيته فتزود لليالي أخرى، وفي نهار يوم الأثنين من شهر رمضان جاءه جبريل بغته لأول مرة داخل غار الحراء، وقد نقل البخاري في صحيحه حديثه رضي الله عنها والبخاري، فعن عائشة رضي الله عنها: أول مابدئ به رسول الله ﷺ من الوحي الرؤيا الصالحة في النوم فكان لايرى رؤيا إلا جاءت مثل فلق الصبح، ثم حبب إليه الخلاء، فكان يخلو بغار حراء، فيتحنث فيه -وهو التعبد- الليالي ذوات العدد قبل أن ينتظر إلى أهله يتزود ذلك، ثم يعود إلى خديجة فيتزود لمثلها، حتى جاءه الحق وهو في غار حراء فجاءه الملك فقال اقرأ قال: قلت: ما أنا بقارئ قال: فأخذني فغطني حتى بلغ مني الجهد ثم أرسلني قال: اقرأ فقلت: ما أنا بقارئ، فأخذني فغطني الثاني حتى بلغ مني الجهد ثم أرسلني فقال: اقرأ فقلت: ما أنا بقارئ فأخذني فغطني الثالثة، ثم ارسلني فقال: اقْرَأْ بِاسْمِ رَبِّكَ الَّذِي خَلَقَ خَلَقَ الْإِنسَانَ مِنْ عَلَقٍ اقْرَأْ وَرَبُّكَ الْأَكْرَمُ الَّذِي عَلَّمَ بِالْقَلَمِ عَلَّمَ الْإِنسَانَ مَا لَمْ يَعْلَمْ.';
const String p2 =
    'فرجع بها رسول الله ﷺ يرجف فؤاده فدخل على خديجة بنت خويلد فقال: زملوني زملوني حتى ذهب عنه الروع، فقال لخديجة وأخبرها الخبر: لقد قيت على نفسي فقالت خديجة: كلا والله مايخزيك الله أبداً إنك لتصل الرحم وتحمل الكل وتكسب المعدوم وتقري الضيف وتعين على نوائب الحق، فنطلقت به خديجة حتى أتت به ورقة بن نوفل بن أسد بن عبدالعزى بن عم خديجة، وكان امرأ تنصر في الجاهلية وكان يكتب الكتاب العربي فيكتب الإنجيل بالعربية ماشاء الله أن يكتب، وكان فقالت له خديجة: يا ابن عم اسمع من ابن أخيك. فقال له ورقة: يا ابن اخي ماترى؟ فأخبره رسول الله ﷺ خبر مارأى فقال له ورقة: هذا الناموس الذي حلّل الله على موسى ياليتني فيه جذوع ليتني أكون حياً إذ يخرجك قومك، فقال رسول الله ﷺ : أو مخرجيّ هم؟ قال: نعم، لم يأت رجل قط بمثل ما، وإن كان يدركني يومك أنصرك، ثم لم ينشب ورقة أن توفي.';
const String p3 =
    'عرف النبي ﷺ معرفة اليقين أنه أصبح نبياً لله الرحيم الكريم وجاء جبريل عليه السلام للمرة الثانية وأنزل الله على نبيه قوله تعالى: يَا أَيُّهَا الْمُدَّثِّرُ قُمْ فَأَنذِرْ وَرَبَّكَ فَكَبِّرْ وَثِيَابَكَ فَطَهِّرْ، وكانت هذه الآيات المتتابعة إيذاناً للرسول ﷺ بأن الماضي قد انتهى بمنامه وهدوئه، وأنه أمامه عمل عظيم يستدعي اليقظة والتشمير والإنذار والإعذار فليحمل الرسالة وليوجه الناس وليأنس بالوحي وليقوَ على عنائه فانه مصدر رسالته ومدد دعوته.';
const String p4 =
    'كانت هذه الآيات تهيجاً لعزيمة رسول الله ﷺ لينهض بعبء ماكُلِّفه من تبليغ رسالات ربه فيمضي قُدُماً بدعوته لايبالي العقبات والحواجز، كان هذا النداء متلطف يَا أَيُّهَا الْمُدَّثِّرُ إيذاناً بشحذ العزائم وتوديعاً لأوقات النوم والراحة وجاء عقب هذا النداء الأمر الجازم بالنهوض قُمْ في عزيمة ناهضة وقوة حازمة تتحرك في اتجاه تحقيق واجب التبليغ وفي مجئ الأمر بالإنذار منفرداً على التبشير في أول خطاب وجَّه إلى النبي ﷺ بعد فترة الوحي إيذان بأن رسالته تعتمد على الكفاح الصبور والجهاد المرير ثم زادت الآيات في تقوية عزيمة النبي ﷺ وشدِّ أزره وحضَّه على المضي قُدماً إلى غاية ما أمر به غير عابئ بما يعترض طريقه من عقبات، مهما يكن شأنها فقيل له وَرَبَّكَ فَكَبِّرْ أي لاتعظم شيئاً من أمور الخلق ولا يتعاظمك منهم شيء فلا تتهيب فعلاً من أفعالهم ولاتخشى أحداً منهم ولاتعظِّم إلا ربك الذي تعهدك وأنت في أصلاب الآباء وأرحام الأمهات فربّاك على موائد فضله ورعاك بإحسانه وجوده حتى أخرجك للناس نبياً ورسولاً بعد أن أعدّك خلْقاً وخُلُقاً لتحمل أمانة أعظم رسالاته وَرَبَّكَ فَكَبِّرْ، فكل تعظيم وتكبير وإجلال حق لله تعالى وحده لا يشاركه فيه أحد أو شيء من مخلوقاته.';
const String p5 =
    'بعد نزول آيات المدثر عليه رسول الله ﷺ يدعو الى الله والى الاسلام سراً وكان طبيعياً أن يبدأ بأهل بيته وأصدقائه وأقرب الناس إليه.';
const String p6 =
    'كان أول من آمن بالنبي ﷺ من النساء، بل أول من آمن به على الإطلاق، فكانت أول من استمع الى الوحي الإلهي من فم الرسول الكريم، وكانت أول من تلا القرآن بعد أن سمعته من صوت الرسول العظيم وكانت كذلك أول من تعلّم الصلاة عن رسول الله ﷺ ، فبيتُها هو أول مكان تلي فيه أول وحي نزل به جبريل على قلب المصطفى الكريم بعد غار حراء.';
const String p7 =
    'وكان أول شيء فرضه الله من الشرائع بعد الإقرار بالتوحيد إقامة الصلاة، وقد جاء في الاخبار حديث تعليم الرسول ﷺ زوجه خديجة الوضوء والصلاة حين افتُرضت على رسول الله: أتاه جبريل وهو بأعلى مكة فهَمز له بعَقبهِ في ناحية الوادي فانفجرت منه عين فتوضأ جبريل عليه السلام ورسوله ينظر ليُريه كيف الطهور للصلاة، ثم توضأ رسول الله ﷺ كما رأى جبريل توضأ، ثم قام جبريل عليه السلام فصلى به وصلى النبي ﷺ بصلاته، ثم انصرف جبريل عليه السلام فجاء رسول الله خديجة فتوضأ لها يريها كيف الطهور للصلاة، كما أراه جبريل عليه السلام، فتوضأت كما توضأ رسول الله ﷺ ثم صلىّ بها رسول الله ﷺ كما صلىّ به جبريل عليه السلام.';
const String p8 =
    'كان أول من آمن من الصبيان وكانت سنه إذ ذاك عشر سنين على أرجح الأقوال وهو قول الطبري وابن اسحاق وقد أنعم الله عليه بأن جعله يتربى في حجر رسوله ﷺ قبل الاسلام حيث أخذه من عمه أبي طالب وضمه إليه وكان علي رضي الله عنه ثالث من أقام الصلاة بعد رسول الله وبعد خديجة رضي الله عنها.';
const String p9 =
    'وقد ذكر بعض أهل العلم أن رسول الله ﷺ كان إذا حضرت الصلاة خرج الى شعاب مكة وخرج معه علي بن أبي طالب مستخفياً من أبيه ومن جميع أعمامه وسائر قومه فيصليان الصلوات فيها فإذا أمسيا رجعا ليضمّهما ذلك البيت الطاهر التقي بالإيمان المفعم بصدق الوفاء وكرم المنَبْت.';
const String p10 =
    'كان أبو بكر الصديق رضي الله عنه أول من آمن بالنبي ﷺ من الرجال الأحرار والأشراف فهو من أخص أصحاب رسول الله ﷺ قبل البعثة وفيه قال رسول الله ﷺ : مادعوت أحداً إلى الإسلام إلا كانت عنده كبوة، وتردد ونظر، إلا أبا بكر، ماعَكَم حين دعوته ولاتردد فيه فأبو بكر صاحب رسول الله ﷺ ، وهو حسنة من حسناته عليه الصلاة والسلام لم يكن إسلامه إسلام رجل بل كان إسلامه إسلام أمة.';
const String p11 =
    'لقد كان أبو بكر كنزاً من الكنوز ادخره الله تعالى لنبيه وكان من أحب قريش لقريش، فذلك الخلق السمح الذي وهبه الله تعالى إياه جعله من الموطئين أكنافاً من الذين يألفون ويؤلفون والخلق السمح وحده عنصر كاف لألفة القوم وهو الذي قال فيه عليه الصلاة والسلام: أرحم أمتي بأمتي أبو بكر وعلم الأنساب عند العرب وعلم التاريخ هما أهم العلوم عندهم ولدى أبي بكر الصديق رضي الله عنه النصيب الأوفر منهما وقريش تعترف للصديق بأنه أعلمها بأنسابها وأعلمها بتاريخها ومافيه من خير وشر فالطبقة المثقفة ترتاد مجلس أبي بكر لتنهل منه علماً لاتجده عند غيره غزارة ووفرة وسعة ومن أجل هذا كان الشباب النابهون والفتيان الأذكياء يرتادون مجلسه دائماً.';
const String p12 =
    'إنهم الصفوة الفكرية المثقفة التي تود أن تلقى عنده هذه العلوم وهذا جانب آخر من جوانب عظمته وطبقة رجال الأعمال ورجال المال في مكة، هي كذلك من رواد مجلس الصديق فهو إن لم يكن التاجر الأول في مكة فهو من أشهر تجارها فأرباب المصالح هم كذلك قصاده ولطيبته وحسن خلقه تلقى عوام الناس يرتادون بيته فهو المضياف الدمث الخلق الذي يفرح بضيوفه ويأنس بهم فكل طبقات المجتمع المكي تجد حظها عند الصديق رضوان الله عليه كان رصيده الأدبي والعلمي والاجتماعي في المجتمع المكي عظيماً ولذلك عندما تحرك في دعوته للإسلام استجاب له صفوة من خيرة الخلق وهم:';
const String p13 =
    'عثمان بن عفان رضي الله عنه في الرابعة والثلاثين من عمره، عبدالرحمن بن عوف رضي الله عنه في الثلاثين من عمره، سعد بن أبي وقاص وكان في السابعة عشرة من عمره، الزبير بن العوام رضي الله عنه وكان في الثانية عشرة من عمره، طلحة بن عبيد الله وكان في الثالثة عشرة من عمره.';
const String p14 =
    'كان هؤلاء الأبطال الخمسة أول ثمرة من ثمار الصديق أبي بكر رضي الله عنه، دعاهم الى الاسلام فاستجابوا وجاء بهم الى رسول الله ﷺ فرادى فأسلموا بين يديه فكانوا الدعامات الأولى التي قام عليها صرح الدعوة وإن تحرك أبي بكر رضي الله عنه في الدعوة الى الله تعالى يوضح صورة من صور الإيمان بهذا الدين والاستجابة لله ورسوله ﷺ صورة المؤمن الذي لا يقر له قرار ولا يهدأ له بال حتى يحقق في دينا الناس ما آمن به دون أن تكون انطلاقته دفعة عاطفية مؤقتة سرعان ماتخمد وتذبل وتزول، وقد بقي نشاط ابي بكر وحماسه الى أن توفاه الله جل وعلا لم يفتر أو يضعف أو يمّل أو يعجز.';
const String p15 =
    'ومضت الدعوة سرية وفردية على الاصطفاء والاختيار للعناصر التي تصلح أن تتكون منها الجماعة المؤمنة التي ستسعى لإقامة دولة الاسلام ودعوة الخلق الى دين رب العباد والتي ستقوم حضارة ربانية ليس لها مثيل.';
const String p16 =
    'ونلاحظ أن أصحاب الجاه لهم أثر كبير في كسب أنصار للدعوة ولهذا كان أثر أبي بكر رضي الله عنه في الاسلام أكثر من غيره وأن السابقين الأولين الى الاسلام كانوا خيرة أقوامهم، ولم يكونوا كما يحب أعداء الاسلام أن يصوروا للناس -أنهم من حثالة الناس أو من الأرقاء الذين أرادوا استعادة حريتهم أو ماشابه ذلك- وجانب الصواب بعض كتّاب السيرة لدى حديثهم عن السابقين الأولين الى الاسلام.';
const String p17 =
    'إن البحث الدقيق يثبت أن مجموع من أشير إليهم بالفقراء والمستضعفين والموالي والأرقاء والأخلاط من مختلف الأعاجم هو ثلاثة عشر. ونسبة هذا العدد من العدد الكلي من الداخلين في الإسلام لا يقال أكثرهم ولا معظمهم ولا عامتهم.';
const String p18 =
    'إن الذين أسلموا يومئذ لم يكن يدفعهم دافع دنيوي وإنما هو إيمانهم بالحق الذي شرح الله صدورهم له ونصرة نبيه ﷺ يشترك في ذلك الشريف والرقيق والغني والفقير ويتساوى في هذا ابوبكر وبلال وعثمان وصهيب رضي الله عنهم.';
