const int sectionIndex = 48;
const String sectionTitle = 'الأحزاب - هذا ما وعدنا اللّهُ ورسُولهُ';

const List t1 = ['1', 'اشتداد المحنة'];
const List t2 = ['2', 'نقض يهود بني قريظة العهد'];
const List t3 = ['3', 'كيف استقبل النبي ﷺ الغدر'];
const List t4 = ['4', 'تشديد الحصار على المسلمين'];
const List t5 = ['5', 'إنسحاب المنافقين'];
const List t6 = ['6', 'محاولات اقتحام الخندق'];
const List t7 = ['7', 'أصابة سعد بن معاذ'];
const List t8 = ['8', 'المفاوضات السياسية مع غطفان'];
const List t9 = ['9', 'مشاورة رسول الله ﷺ مع الصحابة'];
const List t10 = ['10', 'ألغاء الصلح مع غطفان'];
const List t11 = ['11', 'القائد الناجح'];
const List t12 = ['12', 'بث الإشاعات في صفوف الأعداء'];
const List t13 = ['13', 'الحرب خدعة'];

const String p1 =
    'كان المسلمون يخشون غدر يهود بني قريظة الذين يسكنون في جنوب المدينة، فيقع المسلمون حينئذ بين نارين، اليهود خلف خطوطهم، والأحزاب بأعدادهم الهائلة من أمامهم، ونجح اليهودي زعيم بني النضير في استدراج كعب بن أسد زعيم بني قريظة لينظم مع الأحزاب لمحاربة المسلمين.';
const String p2 =
    'وسرت الشائعات بين المسلمين بأن قريظة قد نقضت عهدها معهم، وكان الرسول ﷺ يخشى أن تنقض بنو قريظة العهد الذي بينهم وبينه، لأن اليهود قوم لاعهد لهم ولاذمة، ولذلك انتدب النبي ﷺ الزبير بن العوام رجل المهمات الصعبة ليأتيه من أخبارهم، فذهب الزبير، فنظر ثم رجع فقال: يارسول الله: رأيتهم يصلحون حصونهم ويُدرّبون طرقهم، وقد جمعوا ماشيتهم.';
const String p3 =
    'وبعد أن كثرت القرائن الدالة على نقض بني قريظة للعهد، أرسل سعد بن معاذ وسعد بن عبادة وعبدالله بن رواحة وخوات بن جبير -رضي الله عنهم- وقال لهم: انطلقوا حتى تنظروا أحق مابلغنا عن هؤلاء القوم أم لا، فإن كان حقاً فالحنو لي لحناً أعرفه - أي كلام لايفهمه أحد سواي - ولاتفتوا في أعضاد الناس، وإن كانوا على الوفاء فما بيننا وبينهم فاجهروا به للناس.';
const String p4 =
    'فخرجوا حتى أتوهم، فوجدوهم قد نقضوا العهد فرجعوا فسلَّموا على النبي ﷺ وقالوا: عضل والقارة ، فعرف النبي ﷺ مرادهم.';
const String p5 =
    'استقبل النبي ﷺ غدر بني قريظة بالثبات والحزم واستخدم كل الوسائل التي من شأنها أن تقوي روح المؤمنين، وتصدع جبهات المعتدين، فأرسل النبي ﷺ في الوقت نفسه سلمة بن أسلم في مائتين رجل، وزيد بن حارثة في ثلاثمائة رجل، يحرسون المدينة، ويظهرون التكبير ليرهبوا بني قريظة وفي هذه الأثناء استعدت بنو قريظة للمشاركة مع الأحزاب، فأرسلت إلى جيوشها عشرين بعيراً كانت محملة تمراً، وشعيراً وتيناً لتمدهم بها وتقويهم على البقاء إلا أنها أصبحت غنيمة للمسلمين الذين استطاعوا مصادرتها واتوا بها إلى النبي ﷺ .';
const String p6 =
    'زادت جيوش الأحزاب في تشديد الحصار على المسلمين بعد انضمام بني قريظة إليها واشتد الكرب على المسلمين وتأزم الموقف، وقد تحدث القرآن الكريم عن حالة الحرج والتدهور التي أصابت المسلمين ووصف ماوصل إليه المسلمون من جزع وخوف، وفزع في تلك المحنة الرهيبة أصدق وصف حيث قال تعالى: إِذْ جَاءُوكُمْ مِنْ فَوْقِكُمْ وَمِنْ أَسْفَلَ مِنْكُمْ وَإِذْ زَاغَتِ الأَبْصَارُ وَبَلَغَتِ الْقُلُوبُ الْحَنَاجِرَ وَتَظُنُّونَ بِاللَّهِ الظُّنُونَا هُنَالِكَ ابْتُلِيَ الْمُؤْمِنُونَ وَزُلْزِلُوا زِلْزَالا شَدِيدًا - سورة الأحزاب';
const String p7 =
    'وكان ظن المسلمين بالله قوياً وقد سجله القرآن الكريم بقوله تعالى: وَلَمَّا رَأَى الْمُؤْمِنُونَ الأَحْزَابَ قَالُوا هَذَا مَا وَعَدَنَا اللَّهُ وَرَسُولُهُ وَصَدَقَ اللَّهُ وَرَسُولُهُ وَمَا زَادَهُمْ إِلا إِيمَانًا وَتَسْلِيمًا - سورة الأحزاب';
const String p8 =
    'أما المنافقون فقد انسحبوا من الجيش وزاد خوفهم حتى قال معتب بن قشير أخو بني عمرو بن عوف: كان محمد يعدنا أن نأكل كنوز كسرى وقيصر، وأجدنا لا يأمن على نفسه أن يذهب إلى الغائط وطلب البعض الآخر الأذن لهم بالرجوع إلى بيوتهم بحجة أنها عورة، فقد كان موقفهم يتسم بالجبن والإرجاف وتخذيل المؤمنين، وقد وردت روايات ضعيفة تحكي أقوالهم في السخرية والإجاف والتخذيل ، ولكن القرآن الكريم يتكفل بتصوير ذلك أدق تصوير قال تعالى : وَإِذْ قَالَتْ طَائِفَةٌ مِنْهُمْ يَاأَهْلَ يَثْرِبَ لا مُقَامَ لَكُمْ فَارْجِعُوا وَيَسْتَأْذِنُ فَرِيقٌ مِنْهُمُ النَّبِيَّ يَقُولُونَ إِنَّ بُيُوتَنَا عَوْرَةٌ وَمَا هِيَ بِعَوْرَةٍ إِنْ يُرِيدُونَ إِلا فِرَارًا وَلَوْ دُخِلَتْ عَلَيْهِمْ مِنْ أَقْطَارِهَا ثُمَّ سُئِلُوا الْفِتْنَةَ لآتَوْهَا وَمَا تَلَبَّثُوا بِهَا إِلا يَسِيرًا وَلَقَدْ كَانُوا عَاهَدُوا اللَّهَ مِنْ قَبْلُ لا يُوَلُّونَ الأَدْبَارَ وَكَانَ عَهْدُ اللَّهِ مَسْئُولا قُلْ لَنْ يَنْفَعَكُمُ الْفِرَارُ إِنْ فَرَرْتُمْ مِنَ الْمَوْتِ أَوِ الْقَتْلِ وَإِذًا لا تُمَتَّعُونَ إِلا قَلِيلا - سورة الأحزاب';
const String p9 =
    'وتزايدة محاولات المشركين لاقتحام الخندق، وأصبحت خيل المشركين تطوف بأعداد كبيرة كل ليلة حول الخندق حتى الصباح، وحاول خالد بن الوليد مع مجموعة من فرسان قريش أن يقتحم الخندق على المسلمين في ناحية ضيقة منه ويأخذهم على حين غرة، لكن أسيد بن حضير في مئتين من الصحابة يراقبون تحركاتهم وقد حصلت مناوشات استشهد فيها الطفيل بن النعمان والذي قتله وحشي -قاتل حمزة يوم أحد- رماه بحربة عبر الخندق فأصبت منه مقتلاً.';
const String p10 =
    'واستطاع حبان بن العرقة من المشركين أن يرمي سهماً أصاب سعد بن معاذ رضي الله عنه في أكحله -عرق في وسط الذراع- وقال خذها وأنا بن العرقة وقد قال سعد بن معاذ عندما أصيب: اللهم إن كنت أبقيت من حرب قريش شيئاً فأبقني لها، فإنه لاقوم أحب إليَّ أن أجاهد من قوم آذوا رسولك وكذبوه وأخرجوه، اللهم وإن كنت وضعت الحرب بيننا وبينهم فاجعلها شهادة ولاتميتني حتى تقر عيني من بني قريظة، وقد ثم استجاب الله دعوة هذا العبد الصالح وهو الذي سيحكم فيهم ثم وجه المشركون كتيبة غليظة نحو مقر رسول الله ﷺ فقاتلهم المسلمون يوماً إلى الليل، فلما حانت صلاة العصر دنت كتيبة، فلم يقدر النبي ﷺ ، ولا أحد من أصحابه الذين كانوا معه أن يصلوا، وشغل بهم النبي ﷺ فلم يصل العصر، ولم تنصرف الكتيبة إلا مع الليل، فقال رسول الله ﷺ : ملأ الله عليهم بيوتهم وقبورهم ناراً كما شغلونا عن الصلاة الوسطى حتى غابت الشمس.';
const String p11 =
    'ظهرت حنكته السياسة ﷺ حين اختار قبيلة غطفان بالذات لمصالحتها على مال يدفعه إليها على أن تترك محاربته وترجع إلى بلادها، فهو يعلم ﷺ أن غطفان وقادتها ليس لهم من وراء الإشتراك في هذا الغزو أي هدف سياسي يريدون تحقيقه أو باعث عقائدي يقاتلون تحت رايته، وإنما كان هدفهم الأول والأخير من الاشتراك في هذا الغزو الكبير هو الحصول عل المال بالإستيلاء عليه من خيرات المدينة عند احتلالها ولهذا لم يحاول الرسول ﷺ الاتصال بقيادة الاحزاب من اليهود كحيي بن أخطب، وكنانة بن الربيع أو قادة قريش كأبي سفيان بن حرب، لأن هدف أولئك الرئيسي، لم يكن المال وإنما كان هدفهم، هدفاً سياسياً وعقائدياً يتوقف تحقيقه والوصول إليه على هدم الكيان الإسلامي من الأساس، لذا فقد كان اتصاله فقط بقادة غطفان، الذين فعلاً لم يترددوا في قبول العرض الذي عرضه عليهم النبي ﷺ ، فقد استجاب القائدان الغطفانيان عيينة بن حصن، والحارث بن عوف لطلب النبي ﷺ وحضرا مع بعض أعوانهما إلى مقر قيادة النبي ﷺ واجتمعا به وراء الخندق مستخفين دون أن يعلم بهما أحد، وشرع رسول الله ﷺ في مفاوضتهم وكانت تدور حول عرض تقدم به رسول الله ﷺ يدعو فيه إلى عقد صلح منفرد بينه وبين غطفان، ومن بنود الاتفاق : تفك غطفان الحصار عن المدينة وتنسحب بجيوشها عائدة إلى بلادها ، ويدفع المسلمون لغطفان مقابل ذلك ثلث ثمار المدينة كلها من مختلف الأنواع، ويظهر أن ذلك لسنة واحدة.';
const String p12 =
    'فقد أبرز ﷺ في هذه المفاوضات جانباً من جوانب منهج النبوة في التحرك لفك الأزمات عند استحكامها وتأزماتها لتكون لأجيال المجتمع المسلم درساً تربوياً من دروس التربية المنهجية عند اشتداد البلاء وقبل عقد الصلح مع غطفان شاور رسول الله ﷺ الصحابة في هذا الأمر، فكان رأيهم في عدم إعطاء غطفان شيء من ثمار المدينة وقال السعدان سعد بن معاذ، وسعد بن عبادة: يارسول الله أمراً تحبه، فنصنعه، أم شيئاً أمرك الله به لابدّ لنا من العمل به، أم شيئاً تصنعه لنا؟ فقال: بل شيء أصنعه لكم، والله ما أصنع ذلك إلا لأني رأيت العرب رمتكم عن قوس واحدة وكالبوكم، من كل جانب، فأردت أن أكسر عنكم من شوكتهم إلى أمر ما فقال له سعد بن معاذ: يارسول الله قد كنا وهؤلاء على الشرك بالله وعبادة الأوثان، لانعبد الله ولانعرفه، وهم لايطمعون أن يأكلوا منها ثمرة واحدة إلا قِرىً أو بيعاً، أفحين أكرمنا الله بالإسلام وهدانا له وأعزنا بك وبه، نعطيهم أموالنا؟ مالنا بهذا من حاجة، والله لانعطيهم إلا السيف، حتى يحكم الله بيننا وبينهم، فقال النبي ﷺ أنت وذاك.';
const String p13 =
    'فتناول سعد بن معاذ الصحيفة، فمحا مافيها من الكتاب، ثم قال: ليجهدوا علينا كان رد زعيمي الأنصار سعد بن معاذ، وسعد بن عبادة في غاية الاستسلام لله تعالى والأدب مع النبي ﷺ وطاعته، فقد جعلوا أمر المفاوضة مع غطفان ثلاثة أقسام: الأول أن يكون هذا الأمر من عند الله تعالى فلامجال لإبداء الرأي بل لابد من التسليم والرضى، والثاني: أن يكون شيئاً يحبه رسول الله ﷺ ، باعتباره رأيه الخاص، فرأيه مقدم وله الطاعة في ذلك، الثالث: أن يكون شيئاً عمله الرسول ﷺ لمصلحة المسلمين من باب الإرفاق بهم، فهذا هو الذي يكون مجالاً للرأي.';
const String p14 =
    'ولما تبين للسعدين من جواب الرسول ﷺ أنه أراد القسم الثالث أجاب سعد بن معاذ بجواب قوي كبت به زعيمي غطفان حيث بين أن الأنصار لم يذلُّوا لأولئك المعتدين في الجاهلية فكيف وقد أعزهم الله تعالى بالإسلام وقد أُعجب النبي ﷺ بجواب سعد وتبين له منه ارتفاع معنوية الأنصار واحتفاظهم بالروح المعنوية العالية، فألغى بذلك مابدأ به من الصلح مع غطفان.';
const String p15 =
    'وفي استشارة رسول الله ﷺ للصحابة يبين لنا أسلوبه في القيادة وحرصه على فرض الشورى في كل أمر عسكري يتصل بالجماعة، فالأمر شورى ولاينفرد به فرد حتى ولو كان هذا الفرد رسول الله ﷺ طالما الأمر في دائرة الاجتهاد ولم ينزل به وحي.';
const String p16 =
    'إن قبول الرسول ﷺ رأي الصحابة في رفض هذا الصلح يدل على أن القائد الناجح هو الذي يربط بينه وبين جنده رباط الثقة، حيث يعرف قدرهم ويدركون قدره، ويحترم رأيهم ويحترمون رأيه، ومصالحة النبي ﷺ مع قائدي غطفان تعد من باب السياسة الشرعية التي تراعى فيها المصالح والمفاسد حسب ماتراه القيادة الرشيدة للأمة.';
const String p17 =
    'إن موقف الصحابة من هذا الصلح يحمل في طياته ثلاثة معان: أنه يؤكد شجاعة المسلمين الأدبية في إبداء الرأي، والمشورة في أي أمر يخص الجماعة، إذا دعت الحاجة إلى ذلك. أنه يكشف عن جوهر المسلمين وعن حقيقة اتصالهم بالله ورسوله وبالإسلام. أنه يبين ماتمتلئ به الروح المعنوية لدى المسلمين من قدرة على مواجهة المواقف الحرجة بالصبر والرغبة القوية، في قهر العدو مهما كثر عدده وعتاده أو تعدد حلفاؤه.';
const String p18 =
    'استخدم النبي ﷺ سلاح التشكيك والدعاية لتمزيق مابين الأحزاب من ثقة وتضامن، فلقد كان يعلم ﷺ أن هناك تصدعاً خفيفاً بين صفوف الأحزاب فاجتهد أن يبرزه ويوسع شقته ويستغله في جانبه فقد سبق أن أطمع غطفان ففكك عزمها والآن ساق المولى عزوجل نعيم بن مسعود الغطفاني إلى رسول الله ﷺ ليعلن إسلامه وقال له: يارسول الله: إن قومي لم يعلموا بإسلامي فمرني بما شئت، فقال له رسول الله ﷺ : إنما أنت فينا رجل واحد فخذل عنا إن استطعت، فإن الحرب خدعة.';
const String p19 =
    'فقام نعيم بزرع الشك بين الأطراف المتحالفة بأمر من رسول الله ﷺ ، فأغرى اليهود بطلب رهائن من قريش لئلا تدعهم وتنصرف عن الحصار، وقال لقريش بأن اليهود إنما تطلب الرهائن لتسليمها للمسلمين ثمناً لعودتها إلى صلحهم، لقد اشتهرت قصة نعيم بن مسعود في أنها لاتتنافى مع قواعد السياسة الشرعية فالحرب خدعة.';
const String p20 =
    'وقد نجحت دعاية نعيم بن مسعود أيما نجاح، فغرست روح التشكيك، وعدم الثقة بين قادة الأحزاب مما أدى إلى كسر شوكتهم، وتهبيط عزمهم. وكان من أسباب نجاح مهمة نعيم :';
const String p21 =
    'أنه أخفى إسلامه عن كل الأطراف، بحيث وثق كل طرف فيما قدمه له من نصح.';
const String p22 =
    'أنه ذكرّ بني قريظة بمصير بني قينقاع وبني النظير، وبصرّهم بالمستقبل الذي ينتظرهم إن هم استمروا في حروبهم للرسول ﷺ فكان هذا الأساس سبباً في تغيير أفكارهم وقلب مخططاتهم العدوانية.';
