const int sectionIndex = 45;
const String sectionTitle = 'غزوة بنى المصطلق - المنافقون';

const List t1 = ['1', 'الحقد والغيظ'];
const List t2 = ['2', 'إثارة الفتنة بين المهاجرين والأنصار'];
const List t3 = ['3', 'ليخرجن الأعز منها الأذل'];
const List t4 = ['4', 'إن الله قد صدقك يازيد'];
const List t5 = ['5', 'موقف أسيد بن حضير من ابن سلول'];
const List t6 = ['6', 'كيف إذا تحدث الناس محمداً يقتل أصحابه!'];
const List t7 = ['7', 'الحفاظ على السمعة السياسية'];
const List t8 = ['8', 'وحدة الصف المسلم'];
const List t9 = ['9', 'الحكمة السياسية'];
const List t10 = ['10', 'نحسن صحبته مابقي معنا'];
const List t11 = ['11', 'نزول سورة المنافقون والتحذيرات'];

const String p1 =
    'خرج في غزوة بني المصطلق عدد كبير من المنافقين مع المسلمين وكان يغلب عليهم التخلف في الغزوات السابقة، لكنهم لما رأوا اطراد النصر للمسلمين خرجوا طمعاً في الغنيمة.';
const String p2 =
    'وعند ماء المريسيع كشف المنافقون عن الحقد الذي يضمرونه للإسلام والمسلمين، فكلما كسب الإسلام نصراً جديداً ازدادوا غيظاً على غيظهم، وقلوبهم تتطلع إلى اليوم الذي يهزم فيه المسلمون لتشفى من الغل، فلما انتصر المسلمون في المريسيع سعى المنافقون إلى إثارة العصبية بين المهاجرين والأنصار، فلما أخفقت المحاولة سعوا إلى إيذاء الرسول ﷺ في نفسه وأهل بيته فشنوا حرباً نفسية مريرة من خلال حادثة الإفك التي اختلقوها.';
const String p3 =
    'يحكي جابر بن عبدالله الأنصاري ما حدث عند ماء المريسيع، وأدى إلى كلام المنافقين لإثارة العصبية وتمزيق وحدة المسلمين، قال: كنا في غزاة فكسع -ضربه برجله- رجل من المهاجرين رجلاً من الأنصار فقال الأنصاري: يا للأنصار وقال المهاجري: ياللمهاجرين، فسمع ذلك رسول الله ﷺ فقال: مابال دعوى الجاهلية؟';
const String p4 =
    'قالوا يارسول الله كسع رجل من المهاجرين رجلاً من الأنصار فقال: دعوها فإنها منتنة.';
const String p5 =
    'أثناء هذة الواقعة يقول الصحابي زيد بن أرقم أنه سمع عبد الله بن أبي بن سلول يقول: لاتنفقوا على من عند رسول الله حتى ينفضوا من حوله، ولئن رجعنا من عنده ليخرجن الأعز منها الأذلَّ، فذكرت ذلك لعمي، فذكره للنبي ﷺ فدعاني فحدثته، فأرسل رسول الله ﷺ إلى عبدالله بن أبي وأصحابه، فحلفوا ماقالوا. فكذبني رسول الله ﷺ وصدقه، فأصابني هم لم يصبني مثله قط، فجلست في البيت، فقال لي عمي: ما أردت إلى أن كذبك رسول الله ﷺ ومقتك؟';
const String p6 =
    'فأنزل الله تعالى: إِذَا جَاءَكَ الْمُنَافِقُونَ قَالُوا نَشْهَدُ إِنَّكَ لَرَسُولُ اللَّهِ وَاللَّهُ يَعْلَمُ إِنَّكَ لَرَسُولُهُ وَاللَّهُ يَشْهَدُ إِنَّ الْمُنَافِقِينَ لَكَاذِبُونَ - سورة المنافقين، فلما نزلت أخذ رسول بأُذُنِ زيد بن أرقم، ثم قال: هذا الذي أوفى الله بأُذُنِهِ، ثم قال: إن الله قد صدقك يازيد.';

const String p7 =
    'ولما سار رسول الله ﷺ  لقيه أسيد بن حضير، فحياه بتحية النبوة وسلم عليه ثم قال: يا نبي الله لقد رحت في ساعة منكرة، ماكنت تروح في مثلها، فقال له رسول الله ﷺ : أو بلغك ماقال صاحبكم؟';
const String p8 =
    'قال: وأي صاحب يارسول الله؟ قال: عبدالله بن أبي؟ قال:وما قال؟ قال: زعم إن رجع إلى المدينة ليخرجن الأعز منها الأذل، قال: فأنت يارسول الله تخرجه منها إن شئت، هو الذليل وأنت العزيز.';
const String p9 =
    'ثم قال: يارسول الله، أرفق به، فوالله لقد جاءنا الله بك، وإن قومه ليظلمون له الخرز ليتوجوه فإنه يرى أنك استلبت ملكه، ثم مشى رسول الله ﷺ بالناس يومهم ذلك حتى أمسى، وليلتهم حتى أصبح، وصدر يومهم ذلك حتى آذتهم الشمس، ثم نزل بالناس، فلم يلبثوا أن وجدوا مس الأرض فوقعوا نياماً.';
const String p10 =
    'وإنما فعل ذلك رسول الله ﷺ ليشغل الناس عن الحديث الذي كان بالأمس، من حديث ابن أبي سلول ونزلت سورة المنافقون.';

const String p11 =
    'لما بلغ النبي ﷺ قول ابن سلول: لئن رجعنا إلى المدينة ليخرجن الأعز منها الأذل، فقام عمر فقال: يارسول الله دعني أضرب عنق هذا المنافق، فقال النبي ﷺ : دعه حتى لا يتحدث الناس أن محمداً يقتل أصحابه.';
const String p12 =
    'وفي رواية قال عمر بن الخطاب: مُر به عباد بن بشر فليقتله، فقال له رسول الله ﷺ : فكيف ياعمر إذا تحدث الناس أن محمداً يقتل أصحابه، ولكن أذِّن بالرحيل وذلك في ساعة لم يكن رسول الله ﷺ يرتحل فيها، فارتحل الناس.';
const String p13 =
    'وهذا الدرس يظهر المحافظة التامة على السمعة السياسية، والفرق كبير جداً بين أن يتحدث الناس عن حب أصحاب محمد محمداً، ويؤكدون على ذلك بلسان قائدهم الأكبر أبي سفيان: مارأيت أحداً يحب أحداً كحب أصحاب محمد محمداً. وبين أن يتحدث الناس أن محمد يقتل أصحابه، ولاشك أن وراء ذلك محاولات ضخمة ستتم في محاولة الدخول إلى الصف الداخلي في المدينة من العدو، بينما هم يائسون الآن من قدرتهم على شيء أمام ذلك الحب وتلك التضحيات.';
const String p14 =
    'ولم يقف النبي ﷺ موقفاً سلبياً حيال تلك المؤامرة التي تزعمها ابن سلول لتصديع الصف المسلم، وإحياء نعرات الجاهلية.';
const String p15 =
    'بل سار بالناس يومهم ذلك حتى أمسى، وليلتهم حتى أصبح، وصدر يومهم الثاني حتى آذتهم الشمس، ثم نزل بالناس فلم يلبثوا أن وجدوا مسّ الأرض فوقعوا نياماً، وبهذا التصرف البالغ الغاية في السياسة الرشيدة قضى على الفتنة قضاءً مبرماً، ولم يدع مجالاً للحديث فيما قال ابن أبيّ.';
const String p16 =
    'لم يواجه النبي ﷺ ابن سلول ومؤامراته المدبرة بالقوة واستعمال السلاح، وذلك لأن لابن سلول اتباعاً وشيعة مسلمين مغرورين، ولو فتك به لأرعدت له أنوف، وغضب له رجال متحمسون له، وقد يدفعهم تحمسهم له إلى تقطيع الوحدة المسلمة، وليس في ذلك أي مصلحة للمسلمين ولا للإسلام وإنها لسياسة شرعية حكيمة رشيدة في معالجة المواقف العصيبة في حزم وقوة أعصاب وبعد نظر، وهذه البراعة في الحكمة والسياسة وتدبير الأمور متفرعة عن كونه ﷺ نبياً ورسولاً إلى الناس لكي تقتدي به الأمة في تصرفاته العظيمة.';
const String p17 =
    'وقد كان لتسامح الرسول مع رأس المنافقين أبعد الآثار فيما بعد، فقد كان ابن أبي سلول كلما أحدث حدثاً كان قومه هم الذين يعاتبونه، ويأخذونه، ويعنّفونه، ويعرضون قتله على النبي، والرسول يأبى ويصفح، فأراد رسول الله أن يكشف لسيف الحق عن آثار سياسته الحكيمة، فقال: كيف ترى ياعمر؟ أما والله لو قتلته يوم قلت لي لأرعدت له آنف لو أمرتها اليوم لقتلته!! فقال عمر قد -والله- علمت لأمر رسول الله ﷺ أعظم بركة من أمري.';
const String p18 =
    'كان لابن أبي بن سلول ولد مؤمن مخلص يسمى عبدالله بن عبدالله بن أبي بن سلول، فلما علم بالأحداث ونزول السورة، أتى رسول الله فقال له: يارسول الله! بلغني أنك تريد قتل أبي بن سلول فيما بلغك عنه، فإن كنت فاعلاً، فمرني به، فأنا أحمل إليك رأسه، فوالله لقد علمت الخزرج، ماكان بها من رجل أبر بوالده مني، وإني لأخشى أن تأمر به غيري فيقتله، فلا تدعني نفسي أنظر إلى قاتل أبي يمشي بين الناس، فأقتله، فأقتل رجلاً مؤمناً بكافر، فأدخل النار، فقال رسول الله ﷺ : بل نترفق به ونحسن صحبته مابقي معنا. ولما وصل المسلمون مشارف المدينة، تصدى عبدالله لأبيه عبدالله بن أبي، وقال له:قف، فوالله لاتدخلها حتى يأذن رسول الله ﷺ في ذلك، فلما جاء رسول الله ﷺ استأذنه في ذلك فأذن له.';
const String p19 =
    'نزلت سورة المنافقون في أعقاب غزوة بني المصطلق حيث كان المسلمون راجعين إلى المدينة وذلك بدليل رواية الإمام الترمذي فلما أصبحنا قرأ رسول الله ﷺ سورة المنافقون. فقد تحدثت السورة بإسهاب عن المنافقين، وأشارت إلى بعض الحوادث والأقوال التي وقعت منهم ورويت عنهم وفضحت أكاذيبهم قال تعالى: إِذَا جَاءَكَ الْمُنَافِقُونَ قَالُوا نَشْهَدُ إِنَّكَ لَرَسُولُ اللَّهِ وَاللَّهُ يَعْلَمُ إِنَّكَ لَرَسُولُهُ وَاللَّهُ يَشْهَدُ إِنَّ الْمُنَافِقِينَ لَكَاذِبُونَ اتَّخَذُوا أَيْمَانَهُمْ جُنَّةً فَصَدُّوا عَنْ سَبِيلِ اللَّهِ إِنَّهُمْ سَاءَ مَا كَانُوا يَعْمَلُونَ ذَلِكَ بِأَنَّهُمْ ءَامَنُوا ثُمَّ كَفَرُوا فَطُبِعَ عَلَى قُلُوبِهِمْ فَهُمْ لا يَفْقَهُونَ وَإِذَا رَأَيْتَهُمْ تُعْجِبُكَ أَجْسَامُهُمْ وَإِنْ يَقُولُوا تَسْمَعْ لِقَوْلِهِمْ كَأَنَّهُمْ خُشُبٌ مُسَنَّدَةٌ يَحْسَبُونَ كُلَّ صَيْحَةٍ عَلَيْهِمْ هُمُ الْعَدُوُّ فَاحْذَرْهُمْ قَاتَلَهُمُ اللَّهُ أَنَّى يُؤْفَكُونَ وَإِذَا قِيلَ لَهُمْ تَعَالَوْا يَسْتَغْفِرْ لَكُمْ رَسُولُ اللَّهِ لَوَّوْا رُءُوسَهُمْ وَرَأَيْتَهُمْ يَصُدُّونَ وَهُمْ مُسْتَكْبِرُونَ - سورة المنافقون';
const String p20 =
    'وقد حذرت إيضا المؤمنين من الإنشغال بزينة الدنيا ومتاعها وحثت على الإنفاق قال تعالى: يَاأَيُّهَا الَّذِينَ ءَامَنُوا لا تُلْهِكُمْ أَمْوَالُكُمْ وَلا أَوْلادُكُمْ عَنْ ذِكْرِ اللَّهِ وَمَنْ يَفْعَلْ ذَلِكَ فَأُولَئِكَ هُمُ الْخَاسِرُونَ وَأَنْفِقُوا مِنْ مَا رَزَقْنَاكُمْ مِنْ قَبْلِ أَنْ يَأْتِيَ أَحَدَكُمُ الْمَوْتُ فَيَقُولَ رَبِّ لَوْلا أَخَّرْتَنِي إِلَى أَجَلٍ قَرِيبٍ فَأَصَّدَّقَ وَأَكُنْ مِنَ الصَّالِحِينَ وَلَنْ يُؤَخِّرَ اللَّهُ نَفْسًا إِذَا جَاءَ أَجَلُهَا وَاللَّهُ خَبِيرٌ بِمَا تَعْمَلُونَ - سورة المنافقون';
