const int sectionIndex = 30;
const String sectionTitle = 'غزوة بدر - في ساحة المعركة';

const List t1 = ['1', 'النبي ﷺ والمسلمون في ساحة المعركة'];
const List t2 = ['2', 'من نعم الله على المسلمين قبل القتال'];
const List t3 = ['3', 'خطة الرسول ﷺ في المعركة'];
const List t4 = ['4', 'الاستفادة من الظروف الطبيعية أثناء القتال'];
const List t5 = ['5', 'تحريض النبي ﷺ أصحابه على القتال'];
const List t6 = ['6', 'بخً بخً'];
const List t7 = ['7', 'دعاؤه ﷺ واستغاثته'];
const List t8 = ['8', 'وما رَميت إذ رَميت ولكن اللَّهَ رَمى'];
const List t9 = ['9', 'نشوب القتال وهزيمة المشركين'];
const List t10 = ['10', 'إمداد الله للمسلمين بالملائكة'];

const String p1 =
    'بعد نزول النبي والمسلمين معه على أدنى ماء بدر من المشركين، اقترح سعد بن معاذ على رسول الله ﷺ بناء عريش له يكون مقراً لقيادته ويأمن فيه من العدو وكان مما قله سعد في اقتراحه: يانبي الله ألا نبني لك عريشاً تكون فيه ثم نلقي عدونا فإن أعزنا الله وأظهرنا على عدونا كان ذلك ما أحببنا وإن كانت الاخرى جلست على ركائبك فلحقت بمن وراءنا فقد تخلف عنك أقوام يانبي الله مانحن بأشدَّ لك حبَّا منهم، ولو ظنُّوا أنك تلقى حرباً متخلفوا عنك يمنعك الله بهم ويناصحونك ويجاهدون معك، فأثنى النبي ﷺ خيراً ودعا له بخير وكانت ثلة من شباب الانصار بقيادة سعد بن معاذ يحرسون عريش رسول الله ﷺ .';
const String p2 =
    'من المنن التي منّ الله بها على عباده المؤمنين يوم بدر أنه أنزل عليهم النعاس والمطر وذلك قبل أن يلتحموا مع أعدائهم قال تعالى: إِذْ يُغَشِّيكُمُ النُّعَاسَ أَمَنَةً مِنْهُ وَيُنَزِّلُ عَلَيْكُمْ مِنَ السَّمَاءِ مَاءً لِيُطَهِّرَكُمْ بِهِ وَيُذْهِبَ عَنْكُمْ رِجْزَ الشَّيْطَانِ وَلِيَرْبِطَ عَلَى قُلُوبِكُمْ وَيُثَبِّتَ بِهِ الأَقْدَامَ - سورة الانفال';
const String p3 =
    'قال القرطبي : وكان هذا النعاس في الليلة التي كان القتال من غدها فكان النوم عجيباً مع ماكان بين أيديهم من الأمر المهم وكان الله ربط جأشهم.';
const String p4 =
    'وعن علي رضي الله عنه قال: ما كان فينا فارس يوم بدر غير المقداد على فرس أبلق ولقد رأيتنا ومافينا إلا نائم سوى رسول الله ﷺ تحت شجرة يُصلي حتى أصبح.';
const String p5 =
    'وبين سبحانه وتعالى أنه أكرم المؤمنين بإنزال المطر عليهم في وقت لم يكن المعتاد فيه نزول الأمطار وذلك فضلاً منه وكرماً وإسناد هذا الإنزال الى الله للتنبيه على أنه أكرمهم به.';
const String p6 =
    'فقد بين سبحانه أنه أنزل على عباده المؤمنين المطر قبل المعركة فتطهروا به حسياً ومعنوياً إذ ربط الله به على قلوبهم وثبت به أقدامهم، وذلك أن الناظر في منطقة بدر يجد في المنطقة رمالاً متحركة لازالت حتى اليوم ومن العسير المشي عليها ولها غبار كبير فلما نزلت الأمطار تماسكت تلك الرمال وسهل السير عليها وانطفأ غبارها وكل ذلك كان نعمة من الله على عباده.';
const String p7 =
    'اخترع الرسول ﷺ في قتاله مع المشركين يوم بدر اسلوباً جديداً في مقتالة أعداء الله تعالى لم يكن معروفاً من قبل، فقاتل ﷺ بنظام الصفوف وتكون الصفوف الاولى من أصحاب الرماح لصّد هجمات الفرسان، وتكون الصفوف التي خلفها من أصحاب النبال لتسديدها من المهاجمين على الأعداء وهذا الأسلوب أشار إليه القرآن الكريم في قوله تعالى إِنَّ اللَّهَ يُحِبُّ الَّذِينَ يُقَاتِلُونَ فِي سَبِيلِهِ صَفًّا كَأَنَّهُمْ بُنْيَانٌ مَرْصُوصٌ - سورة الصف';
const String p8 =
    'وقد كانت العرب تقاتل بأسلوب الكر والفر وإن القتال بأسلوب الكر والفر هو أن يهاجم المقاتلون بكل قوتهم على العدو النشابة منهم والذين يقاتلون بالسيوف ويطعنون بالرماح مشاة وفرسانا،ً فإن ثبت لهم العدو أو أحسوا بالضعف نكصوا ثم أعادوا تنظيمهم وكروا من جديد وهكذا يكرون ويفرون حتى يكتب لهم النصر أو الاندحار.';
const String p9 =
    'وأن أسلوب الصف يتميز عن اسلوب الكر والفر بأنه يؤمن الترتيب بالعمق، فتبقى دائماً بيد القائد قوة احتياطية يعالج بها المواقف التي ليست بالحسبان كأن يصد هجوماً مقابلاً للعدو أو يضرب كميناً لم يتوقعه أو يحمي الأجنحة التي يهددها العدو بفرسانه أو مشاته ثم يستثمر الفوز بهذا الاحتياط عند الحاجة.';
const String p10 =
    'لم يهمل ﷺ فرصة الاستفادة من الظروف الطبيعية أثناء قتال العدو فقد كان يستفيد من كل الظروف في ميدان المعركة لمصلحة جيشه، ومن الأمثلة على ذلك مافعله ﷺ قبل بدء القتال يوم بدر يقول المقريزي: وأصبح ﷺ ببدر قبل أن تنزل قريش فطلعت الشمس وهو يصفّهم فاستقبل المغرب وجعل الشمس خلفه فاستقبلوا الشمس.';
const String p11 =
    'كان ﷺ في بدر يعدل الصفوف ويقوم بتسويتها لكي تكون مستقيمة متراصة وبيده سهم لاريش له يعدل به الصف فرأى رجلاً اسمه سواد بن غزية وقد خرج من الصف فطعنه ﷺ في بطنه، وقال له: استو ياسواد فقال:يارسول الله أوجعتني وقد بعثك الله بالحق والعدل فأقدني فكشف رسول الله ﷺ عن بطنه وقال: استقد فاعتنقه فقبل بطنه فقال: ماحملك على هذا ياسواد قال: يارسول الله حضر ماترى فأردت أن يكون آخر العهد بك أن يمس جلدي جلدك فدعا له رسول الله بخير.';
const String p12 =
    'وكان رسول الله ﷺ يربي أصحابه على أن يكونوا أصحاب إرادات قوية راسخة ثابتة ثبات الشم الرواسي فيملأ قلوبهم شجاعة وجرأة وأملاً في النصر على الأعداء، وكان يسلك في سبيل تكوين هذه الإرادة القوية أسلوب الترغيب والترهيب الترغيب في أجر المجاهدين الثابتين والترهيب من التولي يوم الزحف والفرار من ساحات الوغى، كما كان يحدثهم عن عوامل النصر وأسبابه ليأخذوا بها ويلتزموها ويحذرهم من أسباب الهزيمة ليقلعوا عنها وينأوا بأنفسهم عن الاقتراب منها.';
const String p13 =
    'وكان ﷺ يحثّ أصحابه على القتال ويحرضهم عليه امتثالاً لقوله تعالى: يَاأَيُّهَا النَّبِيُّ حَرِّضِ الْمُؤْمِنِينَ عَلَى الْقِتَالِ إِنْ يَكُنْ مِنْكُمْ عِشْرُونَ صَابِرُونَ يَغْلِبُوا مِائَتَيْنِ وَإِنْ يَكُنْ مِنْكُمْ مِائَةٌ يَغْلِبُوا أَلْفًا مِنَ الَّذِينَ كَفَرُوا بِأَنَّهُمْ قَوْمٌ لا يَفْقَهُونَ - سورة الأنفال';
const String p14 =
    'وقال رسول الله ﷺ لأصحابه قوموا إلى جنة عرضها السماوات والأرض فقال عمير بن الحمام الأنصاري رضي الله عنه: يارسول الله جنة عرضها السموات والأرض؟ قال:نعم قال:بخً بخً !! فقال رسول الله ﷺ : مايحملك على قولك: بخ بخ قال: لا والله يارسول الله إلا رجاء أن أكون من أهلها فأخرج ثمرات من قرنه جعبة النشاب فجعل يأكل منهن ثم قال: لئن أنا حييت حتى آكل تمراتي هذه إنها لحياة طويلة، قال:فرمى بما كان معه من التمر ثم قاتلهم حتى قتل قال: فإنك من أهلها.';
const String p15 =
    'قال تعالى: إِذْ تَسْتَغِيثُونَ رَبَّكُمْ فَاسْتَجَابَ لَكُمْ أَنِّي مُمِدُّكُمْ بِأَلْفٍ مِنَ الْمَلائِكَةِ مُرْدِفِينَ - الأنفال ، واتجه رسول الله ﷺ إلى ربه يدعوه ويناشده النصر الذي وعده ويقول في دعائه: اللهم أنجز لي ماوعدتني اللهم إن تهلك هذه العصابة من أهل الإسلام فلا تعبد في الأرض أبداً ومازال ﷺ يدعو ويستغيث حتى سقط رداؤه.';
const String p16 =
    'بعد أن دعا ﷺ ربه في العريش واستغاث به خرج من العريش فأخذ قبضة من التراب وحصب بها وجوه المشركين، وقال:شاهت الوجوه ثم أمر ﷺ أصحابه أن يصدقوا الحملة إثرها ففعلوا فأوصل الله تعالى تلك الحصاء إلى أعين المشركين فلم يبقى أحد منهم إلا ناله منها ماشغله عن حاله ولهذا قال الله تعالى:وَمَا رَمَيْتَ إِذْ رَمَيْتَ، ومعنى الآية: أن الله سبحانه أثبت لرسوله ابتداء الرمي ونفى عنه الإيصال الذي لم يحصل برميته فالرمي يراد به الحذف والإيصال فأثبت لنبيه الحذف ونفى عنه الإيصال، ونلحظ أن الرسول ﷺ أخذ بالأسباب المادية والمعنوية وتوكل على الله فكان النصر والتأييد من الله تعالى فقد اجتمع في بدر الأخذ بالأسباب بالقدر الممكن مع التوفيق الرباني في تهيئة جميع أسباب النصر متعاونة متكافئة مع التأييدات الربانية الخارقة والغيبية، ففي عالم الأسباب تشكّل دراسة الأرض والطقس ووجود القيادة والثقة بها والروح المعنوية لبناتٍ أساسية في صحة القرار العسكري ولقد كانت الأرض لصالح المسلمين وكان الطقس مناسباً للمعركة والقيادة الرفيعة موجودة والثقة بها كبيرة والروح المعنوية مرتفعة، وبعض هذه المعاني كان من الله بشكل مباشر وتوفيقه وبعضها كان من فعل رسول الله ﷺ أخذاً بالأسباب المطلوبة فتضافر الأخذ بالأسباب مع توفيق الله وزيد على ذلك التأييدات الغيبية والخارقة فكان ماكان وذلك نموذج على مايعطاه المسلمون بفضل الله إذا ما صلحت النيات عند الجند والقادة ووجدت الاستقامة على أمر الله وأخذ المسلمون بالأسباب.';
const String p17 =
    'اندلع القتال بين المسلمين والمشركين بالمبارزات الفردية فخرج من جيش المشركين عتبة بن ربيعة وأخوه شيبة بن ربيعة وابنه الوليد وطلبوا المبارزة، فخرج إليهم ثلاثة من الأنصار ولكن الرسول ﷺ أرجعهم لأنه أحبَّ أن يبارزهم بعض أهله وذوي قرباه ولذلك قال ﷺ : قم ياعبيدة بن الحارث وقم ياحمزة وقم يا علي وبارز حمزة شيبة فقتله وبارز علي الوليد وقتله وبارز عبيدة بن الحارث عتبة فضرب كل واحد منهما الآخر بضربة موجعة ، فكّر حمزة وعلي على عتبة فقتلوه وحملا عبيدة وأتباعه إلى رسول الله ﷺ ولكن مالبث أن استشهد متأثراً بجراحه.';
const String p18 =
    'وكان شعار المسلمين: أحد أحد ثم أمرهم النبي ﷺ بالهجوم المضاد محرضاً لهم على القتال وقائلاً لهم شدوا وواعداً من يقتل صابراً محتسباً بأن له الجنة ومما زاد في نشاط المسلمين واندفاعهم في القتال سماعهم قول النبي ﷺ سَيُهْزَمُ الْجَمْعُ وَيُوَلُّونَ الدُّبُرَ ، وعلمهم وإحساسهم بإمداد الملائكة وبتقليلهم في أعين المسلمين وتقليل المسلمين بأعين المشركين.';
const String p19 =
    'فقد كان ﷺ قد رأى في منامه ليلة اليوم الذي التقى فيه الجيشان رأى المشركين عددهم قليل وقد قصّ رؤياه على أصحابه فاستبشروا خيراً قال تعالى: إِذْ يُرِيكَهُمُ اللَّهُ فِي مَنَامِكَ قَلِيلا وَلَوْ أَرَاكَهُمْ كَثِيرًا لَفَشِلْتُمْ وَلَتَنَازَعْتُمْ فِي الأَمْرِ وَلَكِنَّ اللَّهَ سَلَّمَ إِنَّهُ عَلِيمٌ بِذَاتِ الصُّدُورِ - سورة الأنفال';
const String p20 =
    'ثبت من نصوص القرآن الكريم والسنة النبوية المطهرة ومرويات عدد من الصحابة البدريين أن الله تعالى ألقى في قلوب الذين كفروا الرعب قال تعالى: إِذْ يُوحِي رَبُّكَ إِلَى الْمَلائِكَةِ أَنِّي مَعَكُمْ فَثَبِّتُوا الَّذِينَ ءَامَنُوا سَأُلْقِي فِي قُلُوبِ الَّذِينَ كَفَرُوا الرُّعْبَ فَاضْرِبُوا فَوْقَ الأَعْنَاقِ وَاضْرِبُوا مِنْهُمْ كُلَّ بَنَانٍ - سورة الأنفال';
const String p21 =
    'وقال تعالى: وَلَقَدْ نَصَرَكُمُ اللَّهُ بِبَدْرٍ وَأَنْتُمْ أَذِلَّةٌ فَاتَّقُوا اللَّهَ لَعَلَّكُمْ تَشْكُرُونَ إِذْ تَقُولُ لِلْمُؤْمِنِينَ أَلَنْ يَكْفِيَكُمْ أَنْ يُمِدَّكُمْ رَبُّكُمْ بِثَلاثَةِ ءَالافٍ مِنَ الْمَلائِكَةِ مُنْزَلِينَ بَلَى إِنْ تَصْبِرُوا وَتَتَّقُوا وَيَأْتُوكُمْ مِنْ فَوْرِهِمْ هَذَا يُمْدِدْكُمْ رَبُّكُمْ بِخَمْسَةِ ءَالافٍ مِنَ الْمَلائِكَةِ مُسَوِّمِينَ وَمَا جَعَلَهُ اللَّهُ إِلا بُشْرَى لَكُمْ وَلِتَطْمَئِنَّ قُلُوبُكُمْ بِهِ وَمَا النَّصْرُ إِلا مِنْ عِنْدِ اللَّهِ الْعَزِيزِ الْحَكِيمِ - سورة آل عمران';
const String p22 =
    'فعن ابن عباس رضي الله عنه قال: بينما رجل من المسلمين يومئذ يشتد في إثر رجل من المشركين أمامه إذ سمع ضربة بالسوط فوقه وصوت الفارس يقول أقدم حيزوم - اسم الفرس الذي يركبه الملك - فنظر إلى المشرك أمامه فخر مستلقياً فنظر إليه فإذا هو خطم أنفه وشق وجهه كضربة السوط فاخضر ذلك فجاء الأنصاري فحدث بذلك رسول الله فقال: صدقت ذلك مدد من السماء الثالثة ، ومن حديث ابن عباس رضي الله عنهما أيضاً قال: إن النبي ﷺ قال يوم بدر: هذا جبريل آخذ برأس فرسه عليه أداة الحرب ، ومن حديث علي بن أبي طالب رضي الله عنه قال: فجاء رجل من الأنصار قصير بالعباس بن عبدالمطلب أسيراً فقال العباس: يارسول الله إن هذا والله ما أسرني لقد أسرني رجل أجلح - انحسر شعره عن جانبي رأسه - من أحسن الناس وجهاً على فرس أبلق - ارتضع التحجيل الى فخذيه - ما أراه في القوم فقال الأنصاري: أنا أسرته يارسول الله فقال: أسكت فقد أيدك الله بملك كريم ومن حديث أبي داود المازني قال: إني لأتبع رجلاً من المشركين لأضربه إذ وقع رأسه قبل أن يصل إليه سيفي فعرفت أنه قتله غيري.';
