const int sectionIndex = 32;
const String sectionTitle = 'غزوة بدر - الدولة الجديدة';

const List t1 = ['1', ' الدولة الجديدة'];
const List t2 = ['2', 'ماء الكدر في بني سليم'];
const List t3 = ['3', 'تصفية المحرضين'];
const List t4 = ['4', 'مقتل كعب بن الأشرف'];
const List t5 = ['5', 'أمر النبي ﷺ بقتله'];
const List t6 = ['6', 'غزوة السويق'];
const List t7 = ['7', 'زواج النبي ﷺ بحفصة بنت عمر'];
const List t8 = ['8', 'زواج علي رضي الله عنه بفاطمة رضي الله عنها'];
const List t9 = ['9', 'الحياة الزوجية البسيطة'];
const List t10 = ['10', 'حياة النبى ﷺ مع أهلة'];

const String p1 =
    'في أعقاب غزوة بدر أخذت الهيبة العسكرية للمسلمين مداها الكبير في دائرة واسعة في الجزيرة العربية، وأحس ضعفاء المشركين بالخطر وشعر أقوياؤهم بغلبة الإسلام وبدأت النفوس تتطلع إلى الإيمان فتوسعت دائرة الدخول في الإسلام ورأى الكثيرون أن يدخلوا في الإسلام نفاقاً أو خديعة وبهذا كله أصبحت الدولة الجديدة أمام أوضاع جديدة من المكر والتحالفات.';
const String p2 =
    'غزا النبي ﷺ بعد سبع ليال من عودته إلى المدينة من غزوة بدر، وبلغ ماء الكدر في ديار بني سليم الذين قصدهم بغزوته هذه غير أنه لم يلق حرباً، فأقام ثلاث ليال على الماء ثم رجع إلى المدينة، كان سبب تلك الغزوة تجمع أفراد بني سليم لمقاتلة المسلمين والاعتداء عليهم بعد معركة بدر مباشرة ولكن رسول الله ﷺ فاجأهم بهجوم سريع غير متوقع فهرب بنو سليم وتفرقوا على رؤوس الجبال.';
const String p3 =
    'إن خطر المحرضين على الفتنة لايقل عن خطر الذين يشهرون السيوف لقتال المسلمين إذ لولا هؤلاء المحرضين لما قامت الفتنة، مثل عصماء بنت مروان التي كانت تحرض على النبي وتعيب الإسلام فقتلها عمير بن عدي الخطمي رضي الله عنه وقال له النبي ﷺ : نصرت الله ورسوله ياعمير، لذلك أخذ رسول الله ﷺ يتتبع هؤلاء المحرضين ويقتلهم إطفاء لنار الفتنة وتمكيناً للحق.';
const String p4 =
    'ينتسب إلى بني نبهان من قبيلة طئ كان أبوه قد أصاب دماً في الجاهلية، فقدم المدينة وحالف يهود بني النضير وتزوج عقيلة بنت أبي الحقيق فولدت له كعب وكان شاعراً ناصب الإسلام، وقد غاظه انتصار المسلمين على قريش في معركة بدر فسافر إلى مكة يهجو النبي ﷺ ويحرّض قريش على الثأر لقتلاهم الذين كان ينوح عليهم ويبكيهم في شعره ويدعو إلى القضاء على الرسول والمسلمين.';
const String p5 =
    'واستمر كعب بن الأشرف في أذية رسول الله ﷺ بالهجاء وتشجيع قريش لمحاربة المسلمين، ولما قدم المدينة أعلن معاداة النبي ﷺ وشرع في هجائه وبلغت به الوقاحة والصلف أن يمتد لسانه إلى نساء المسلمين وشبب بأم الفضل بنت الحارث رضي الله عنها زوجة العباس عم النبي ﷺ .';
const String p6 =
    'كان رسول الله ﷺ يحث حساناً للتصدي لكعب بن الأشرف فكان ﷺ يعلم حساناً أين نزل بن الأشرف في مكة، فعندما نزل على المطلب بن أبي وداعة بن ضميرة السهمي وزوجته عاتكة بنت أسيد بن أبي العيص فأبلغ ﷺ حسان بن ثابت بذلك فهجاهم لايوائهم ابن الأشرف، فلما بلغ عاتكة بنت أسيد هجاء حسان نبذت رحل اليهودي كعب بن الأشرف وقالت لزوجها: مالنا ولهذا اليهودي، ألا ترى مايصنع بنا حسان وتحول كعب الى أناس آخرين وكان كلما تحول الى قوم آخرين دعا رسول الله ﷺ حسان وأخبره أين نزل ابن الأشرف فيهجو من نزل عندهم فيطردونه.';
const String p7 =
    'وظل يلاحقه حتى لفظه كل بيت هناك، فعاد الى المدينة راغماً بعد أن ضاقت في وجهه السبل ينتظر مصيره المحتوم وجزاءه الذي يستحقه و أمر النبي ﷺ بقتله وقد فصل البخاري خبر مقتله، إن في مقتل كعب بن الأشرف دروساً وعبراً وفوائداً في فقه النبي ﷺ في تعامله مع خصوم الاسلام والدولة الاسلامية فقد أتضح أن عقوبة الناقض للعهد القتل، وهذا ماحكم به النبي ﷺ وعقوبة المعاهد الذي يشتم الرسول ﷺ ويؤذيه بهجاء أو غيره هي القتل وهذا ماكان لابن الأشرف ويؤخذ من هذا أن شاتم الرسول ﷺ سواء كان معاهداً أو غيره تضرب عنقه عقوبة له.';
const String p8 =
    'السويق هو أن تحمّص الحنطة والشعير ثم يطحن باللبن والعسل والسمن، فقد قدم أبو سفيان بمائتي فارس من مكة وسلك طريق النجدية حتى نزلوا حي بني النضير ليلاً واستقبلهم سلاّم بن مشكم سيد بني النضير، فأطعمهم وأسقاهم وكشف لهم عن أسرار المسلمين وتدارس معهم احدى الطرق لإيقاع الأذى بالمسلمين ثم قام أبو سفيان بمهاجمة ناحية العُريض- واد بالمدينة في طرف حرة واقم - فقتل رجلين وأحرق نخلا وفر عائداً إلى مكة فتعقبه رسول الله ﷺ في مائتي رجل من المهاجرين والأنصار، ولكنه لم يتمكن من إدراكهم لأن أبا سفيان ورجاله قد جدّوا في الهرب وجعلوا يتخففون من أثقالهم ويلقون السويق التي كانوا يحملونها لغدائهم، وكان المسلمون يمرون بهذه الجرب فيأخذونها حتى رجعوا بسويق كثير لذا سميت هذه الغزوة بغزوة السويق وعاد رسول الله ﷺ إلى المدينة بعد أن غاب عنها خمسة أيام دون أن يلقى حرباً.';
const String p9 =
    'قال عمر رضي الله عنه: حين تأيمت -مات عنها زوجها- حفصة بنت عمر من خنيس بن حذافة السهمي، وكان من أصحاب رسول الله ﷺ فتوفي في المدينة فقال عمر: أتيت عثمان بن عفان فعرضت عليه حفصة بنت عمر قال: فقلت: إن شئت أنكحتك حفصة فقال: سأنظر في أمري، فلبثت ليالٍ ثم لقيني فقال: قد بدا لي أن لا أتزوج يومي هذا قال عمر: فلقيت أبابكر الصديق فقلت: إن شئت زوجتك حفصة بنت عمر، فصمت أبو بكر رضي الله عنه فلم يرجع إليَّ شيئاً فكنت عليه أوجد مني على عثمان فلبثت ليالي ثم خطبها رسول الله ﷺ .';
const String p10 =
    'قال علي بن أبي طالب رضي الله عنه: خطبت فاطمة الى رسول الله ﷺ فقالت مولاة لي: هل علمت أن فاطمة قد خطبت الى رسول الله ﷺ ؟ قلت : لا ، قالت: فقد خطبت فما يمنعك أن تأتي رسول الله ﷺ فيزوجك، فقلت: وعندي شيء أتزوج به! فقالت: إنك إن جئت رسول الله ﷺ زوجك.';
const String p11 =
    'قال: فوالله مازلت ترجيني حتى دخلت على رسول الله ﷺ فلما أن قعدت بين يديه أفحمت فوالله ما استطعت أن أتكلم جلالة وهيبة.';
const String p12 =
    'فقال رسول الله ﷺ : ماجاء بك؟ ألك حاجة؟ فسكت فقال: لعلك جئت تخطب فاطمة؟ فقلت: نعم فقال: وهل عندك من شيء ستحلها به؟ فقلت: لا والله يارسول الله، فقال: مافعلت درع سلحتكها ؟ فوالذي نفس علي بيده إنها لحطمية ماقيمتها أربعة دراهم فقلت: عندي، فقال: قد زوجتكها فابعث إليها بها فاستحلها بها فإنها كانت لصداق فاطمة بنت رسول الله ﷺ وقد جهز رسول الله ﷺ فاطمة في خميل -القطيفة- وقربة ووسادة أدم -الجلد- حشوها إذخر.';
const String p13 =
    'وهكذا كانت حياتهم في غاية البساطة بعيدة عن التعقيد وهي الى شظف العيش أقرب منها الى رغده، وهذه القصة تصور لنا حال السيدة فاطمة من التعب وموقف رسول الله ﷺ منها عندما طلبت منه أن يعيطها خادماً من السبي، فقد جاء في مسند الإمام أحمد: قال علي لفاطمة ذات يوم والله لقد سنوت حتى لقد اشتكيت صدري قال: وجاء الله أباك بسبي فاذهبي فاستخدميه فقالت: أنا والله قد طحنت حتى مجلت يدي.';
const String p14 =
    'فأتيت النبي ﷺ فقال: ماجاء بك أي بنية؟ قالت: جئت لاسلم عليك واستحيت أن تسأله ورجعت. فقال: مافعلت؟ قال: استحييت أن أسأله، فأتينا جميعاً فقال: علي يارسول الله والله لقد سنوت حتى اشتكيت صدري وقالت: فاطمة قد طحنت حتى مجلت يداي وقد جاءك الله بسبي وسعة فأخدمنا فقال رسول الله ﷺ والله لا أعطيكما وأدع أهل الصفة تطوى بطونهم لا أجد ما أنفق عليهم، ولكني أبيعهم وأنفق عليهم أثمانهم، فرجعا فأتاهما النبي ﷺ وقد دخلا في قطيفتهما إذا غطت رؤوسهما تكشفت أقدامهما وإذا غطيا أقدامهما تكشفت رؤوسهما فثارا فقال: مكانكما ثم قال ألا أخبركما بخير مما سألتماني؟ قال: بلى فقال كلمات علمنيهن جبريل عليه السلام فقال: تسبحان في دبر كل صلاة عشراً وتحمدان عشراً وتكبران عشر وإذا أويتما الى فراشكما فسبحا ثلاثاً وثلاثين واحمدا ثلاثاً وثلاثين وكبرا أربعاً وثلاثين.';
const String p15 =
    'وهكذا كان الهدي النبوي في تربية أهل بيته وأقربائه لقد أخفقت مساعي السيدة فاطمة وعلي رضي الله عنهما للحصول على خادم لأن السبي يريد عليه الصلاة والسلام أن يبيعه وينفق ثمنه على أهل الصفة الذي يتلوون من الجوع فهم أيضاً من خاصة رسول الله ﷺ مثل علي وفاطمة، والطعام مقدم على الخدمة وقد تأثر علي رضي الله عنه بهذه التربية النبوية، ويمر الزمن بالفتى على فيصبح خليفة المسلمين فاذا به من آثار هذه التربية يترفع عن الدنيا وزخارفها وبيده كنوز الأرض وخيراتها لأن ذكر الله يملأ قلبه ويغمر وجوده ولقد حافظ على وصية رسول الله له وقد حدثنا عن ذلك فقال: فوالله ما تركتهن منذ علمنيهن فسأله أحد أصحابه ولا ليلة صفين فقال: ولا ليلة صفين وكان كما وصفه ضرار بن ضمرة في مجلس معاوية: .... يستوحش من الدنيا وزهرتها ويستأنس بالليل وظلمته كان والله غزير العبرة طويل الفكرة يقلب كفه ويخاطب نفسه يعجبه من اللباس ماقصر ومن الطعام ماجشب.';
