const int sectionIndex = 39;
const String sectionTitle = 'غدر عَضَل والقارة';

const List t1 = ['1', 'ماء الرجيع'];
const List t2 = ['2', 'عاصم بن ثابت'];
const List t3 = ['3', 'أنتقام سُلافة'];
const List t4 = ['4', 'خبيب بن عدي'];
const List t5 = ['5', 'ولست أبالي حين أقتل مسلماً'];
const List t6 = ['6', 'كحب أصحاب محمد محمداً'];
const List t7 = ['7', 'من فقة الأسير'];

const String p1 =
    'عرفت هذه الحادثة المفجعة بالرجيع نسبة إلى ماء الرجيع الذي حصلت عنده.';
const String p2 =
    'ورد البخاري بأن النبي ﷺ بعث عيناً لتجمع المعلومات عن العدو، فإن مرويات أخرى بأسانيد صحيحة ورد فيها أنه قدم على رسول الله ﷺ رهط من قبيلتي عضل والقارة المضريتين إلى المدينة وقالوا: إن فينا إسلاماً فابعث معنا نفراً من أصحابك يفقهونا ويقرئونا القرآن ويعلمونا شرائع الإسلام ويظهر أن قبيلة هذيل قد سعت للثأر من المسلمين لخالد بن سفيان الهذلي فلجأت إلى الخديعة والغدر.';
const String p3 =
    'وهكذا بعث الرسول ﷺ هذه السرية التي تتألف من عشرة من الصحابة، وجعل عليهم عاصم بن ثابت بن الأقلح أميراً حتى إذا كانوا بين عسفان ومكة أغار بنو لحيان – وهم قريب من مائتي مقاتل – فألجأوهم إلى تل مرتفع بعد أن أحاطوا بهم من كل جانب، ثم أعطوهم الأمان من القتل، ولكن قائد السرية أعلن رفضه أن ينزل في ذمة كافر وقال عاصم بن ثابت: إني نذرت ألا أقبل جوار مشرك أبداً، فجعل عاصم يقاتلهم ورماهم بالنبل حتى فنيت نبله، ثم طاعنهم بالرمح حتى كُسر رمحه وبقى السيف فقال: اللهم حميت دينك أول نهاري فاحْم لي لحمي آخره، وكانوا يجِّردون كل من قتل من أصحابه فكسر غمد سيفه ثم قاتل حتى قتل، وقد جرح رجلين وقتل واحداً ثم شرعوا فيه الأسنّة حتى قتلوه.';
const String p4 =
    'وكانت سُلافة بنت سعد قد قتل زوجها وبنوها أربعة، قد كان عاصم قتل منهم اثنين الحارث ومُسافعا فنذرت لئن أمكنها الله منه أن تشرب في قحف رأسه الخمر، وجعلت لمن جاء برأس عاصم مائة ناقة، قد علمت بذلك العرب وعلمته بنو لحيان فأرادوا أن يحتزُّوا رأس عاصم ليذهبوا به إلى سُلافة بنت سعد ليأخذوا منها مائة ناقة، فبعث الله تعالى عليهم الدَّبْر فحمته فلم يَدْنُ إليه أحد إلا لدغت وجهه، وجاء منها شيء كثير لاطاقة لأحد به، فقالوا: دعوه إلى الليل فإنه إذا جاء الليل ذهب عنه الدَّبْر، فلما جاء الليل بعث الله عليه سيلاً ولم يكن في السماء سحاباً في وجه من الوجوه، فاحتمله فذهب به فلم يصلوا إليه.';
const String p5 =
    'لقد قتل عاصم في سبعة من أفراد السرية بالنبال، ثم أعطى الأعراب الأمان من جديد للثلاثة الباقين، فقبلوا غير أنهم سرعان ماغدروا بهم بعد ماتمكنوا منهم وقد قاومهم عبدالله بن طارق فقتلوه واقتادوا الاثنين إلى مكة – وهما خبيب وزيد بن الدثّنة فباعوهما لقريش وكان ذلك في صفر سنة 4هـ .';
const String p6 =
    'أما خبيب فقد اشتراه بنو الحارث بن عامر بن نوفل ليقتلوه بالحارث الذي كان خبيب قد قتله يوم بدر، فمكث عندهم أسيراً حتى إذا أجمعوا قتله استعار موس من بنات الحارث استحدّ بها فأعارته، وغفلت عن صبي لها فجلس على فخذه ففزعت المرأة لئلا يقتله انتقاماً منه فقال خبيب: أتخشين أن أقتله ماكنت لأفعل ذلك إن شاء الله تعالى، فكانت تقول: مارأيت أسيراً قط خيراً من خبيب لقد رأيته يأكل من قطف عنب ومابمكة يومئذ ثمرة، وإنه لموثق في الحديد وماكان إلا رزق رزقه الله فخرجوا به من الحرم ليقتلوه فقال: دعوني أصلي ركعتين ثم انصرف إليهم فقال: لولا أن تروا مابي جزع من الموت لزدت، فكان أول من سنَّ الركعتين عند القتل هو ثم قال: اللهم احصهم عددا واقتلهم بددا ولاتُبق منهم أحداً ثم قال:';
const String p7 =
    'إلى الله أشكو غُربتي بعد كُربتي .. وما أرصد الأحزاب لي عند مصرعي';
const String p8 =
    'فذا العرش صبرني على مايُرادُ بي .. فقد بضَّعُوا لحمي وقد يَاسَ مطمعي';
const String p9 = 'وقد خيروني الكفر والموت دونه .. فقد ذرفت عيناي من غير مجزع';
const String p10 = 'ومابي حذار الموت إني لميت .. وإن إلى ربي إيابي ومرْجعي';
const String p11 =
    'ولست أبالي حين أقتل مسلماً .. على أي جنبٍ كان في الله مضجعي';
const String p12 = 'وذلك في ذات الإله وإن يشأ .. يبارك على أوصال شلوٍ مُمَّزع';
const String p13 = 'فلست بمبد للعدو تخشُّعا .. ولاجزعاً إني إلى الله مرجعي';
const String p14 =
    'فقال له أبو سفيان: أيسرُّك أن محمداً عندنا يُضربُ عنقه وإنك في أهلك فقال: لاوالله مايسُّرني أني في أهلي وأن محمداً في مكانه الذي هو فيه تصيبه شوكة تؤذيه ثم قتل وصلبوه، ووكَّلوا به من يحرس جُثته فجاء عمرو بن أمية الضمري فاحتمله بجذعه ليلاً فذهب به ودفنه وأما زيد بن الدثنَّة فاشتراه صفوان بن أمية وقتله بأبيه أمية بن خلف الذي قتل ببدر، وقال أبو سفيان: مارأيت من الناس أحداً يحب أحداً كحب أصحاب محمد محمداً.';
const String p15 =
    'وفي الحديث أن للأسير أن يمتنع من قبول الأمان ولايمكن من نفسه ولو قتل أنفة من أن يجري عليه حكم كافر، وهذا إذا أراد الأخذ بالشدة، فإن أراد الأخذ بالرخصة فله أن يستأمن، قال الحسن البصري: لابأس بذلك وقال سفيان الثوري: أكره ذلك وفيه الوفاء للمشركين بالعهد، والتورع عن قتل أولادهم والتلطف بمن أريد قتله وإثبات كرامة الأولياء، والدعاء على المشركين بالتعميم والصلاة عند القتل وفيه إنشاد الشعر وإنشاده عند القتل دلالة على قوة يقين خبيب وشدته في دينه.';
const String p16 =
    'وفيه أن الله يبتلي عبده المؤمن بما شاء كما سبق في علمه ليثيبه، ولو شاء ربك مافعلوه، وفيه استجابة دعاء المسلم وإكرامه حياً وميتاً وغير ذلك من الفوائد مما يظهر بالتأمل، وإنما استجاب الله له من حماية لحمه من المشركين ولم يمنعهم من قتله لما أراد من إكرامه بالشهادة ومن كرامته حمايته من هتك حرمته بقطع لحمه.';
const String p17 =
    'يستدل أيضا مما سبق أن للأسير في يد العدو أن يمتنع من قبول الأمان، ولايمكِّن من نفسه ولو قتل، ترفعاً عن أن يجري عليه حكم كافر، كما فعل عاصم، فإن أراد الترخص فله أن يستأمن مترقباً الفرصة مؤملاً الخلاص كما فعل خبيب وزيد ولكن لو قدر الأسير على الهرب لزمه ذلك في الأصح وإن أمكنه إظهار دينه بينهم لأن الأسير في يد الكفار مقهور مهان فكان من الواجب عليه تخليص نفسه من هوان الأسر ورقه.';
const String p18 =
    'وفي قول خبيب رضي الله عنه: ماكنت لأفعل إن شاء الله يشير هذا الأسلوب في البيان العربي إلى أن هذا الفعل غير وارد ولامتصوَّر ولا هو في الحسبان، في هذا الظرف الحاسم، الذي قد يتعلق فيه الاستثناء، لموقع الضرورة، وإنقاذ المهج لكن المبدأ الأصلي الوفاء والكف عن البرءاء، لاتنهض له هذه الاعتبارات الموهومة وهذا مثل من عظمة الصحابة رضي الله عنهم حين يطبقون أخلاق الإسلام على أنفسهم مع أعدائهم وإن كانوا قد ظلموهم، وهذا دليل على وعيهم وكمال إيمانهم.';
