const int sectionIndex = 51;
const String sectionTitle = 'ما كان مُحمَّد أبَا أحَدٍ';

const List t1 = ['1', 'أم المؤمنين زينب رضي الله عنها'];
const List t2 = ['2', 'تحطم الفوارق الطبقية'];
const List t3 = ['3', 'زواجها من زيد بن حارثة رضي الله عنه'];
const List t4 = ['4', 'طلاق زيد لزينب رضي الله عنها'];
const List t5 = ['5', ' عدم رغبة زيد في إبقاء الزواج'];
const List t6 = ['6', 'الحكمة من الزواج'];
const List t7 = ['7', 'ادعُوهم لآبائِهِم'];
const List t8 = ['8', 'مايقع بين الزوجين من خلاف'];
const List t9 = ['9', 'وَتُخفِي فِي نفسِكَ مَا اللَّهُ مُبدِيهِ'];
const List t10 = ['10', 'زيد وذكر اسمه فى القرآن'];
const List t11 = ['11', 'زواج رسول الله ﷺ من زينب'];
const List t12 = ['12', 'وزوجني الله من فوق سبع سماوات'];
const List t13 = ['13', 'الوليمه'];
const List t14 = ['14', 'نزول آية الحجاب'];
const List t15 = ['15', 'الأثر الطيبب'];

const String p1 =
    'هي أم المؤمنين زينب بنت جحش بن رباب بن يعمر الأسدية، أخت عبدالله ابن جحش، وحمنة بنت جحش رضي الله عنها وأمها: أميمة بنت عبدالمطلب بن هاشم بن عبدمناف بن قصي، عمة رسول الله ﷺ ، وأخت حمزة بن عبدالمطلب رضي الله عنه، كانت تكنى أم الحكم.';
const String p2 =
    'وكانت زينب رضي الله عنها من المهاجرات الأول، ورعة صوامة قوامة، كثيرة الخير والصدقة، فعن عائشة أم المؤمنين رضي الله عنها قالت: قال رسول الله ﷺ : أسرعكن لحوقاً بي أطولكن يداً قالت: فكن يتطاولن أيتهن أطول يداً قالت: فكانت أطولنا يداً زينب لأنها كانت تعمل بيدها وتتصدق.';
const String p3 =
    'وقد مدحتها السيدة عائشة رضي الله عنها كثيراً وقالت في حقها: لم أر امرأة قط خيراً في الدين من زينب، وأتقى لله وأصدق حديثاً وأوصل للرحم وأعظم صدقة وأشد ابتذالاً لنفسها في العمل الذي تصدق له، وتقربه إلى الله تعالى ماعدا - سورة من حدِّة كانت فيها تسرع منها الفيئة.';
const String p4 =
    'أراد الرسول ﷺ أن يحطم تلك الفوارق الطبقية الموروثة في الأمة المسلمة من عادات الجاهلية، ليكون الناس سواسية كأسنان المشط لافضل لأحد على أحد إلا بالتقوى، وكان الموالي وهم الذين جرى عليهم الرق ثم تحرروا طبقة أدنى من طبقة السادة، ومن الموالي كان زيد بن حارثة مولى رسول الله ﷺ الذي أعتقه ثم تبناه فرأى رسول الله ﷺ أن يزوج زيداً من شريفة أسد وهي ابنة عمته زينب بنت جحش رضي الله عنها، ليبطل تلك الفوارق الطبقية بنفسه في أسرته، وكانت هذه الفوارق من العمق والعنف بحيث لايحطمها إلا فعل واقعي من رسول الله ﷺ ، لتتخذ منه الأمة المسلمة أسوة وقدوة وتسير البشرية على هداه في هذا الطريق، وأيضاً لعل من الحكمة في هذا الزواج أنه كان مقدمة لتشريع آخر لايقل أهمية في حفظ توازن المجتمع وحماية الأسرة عن الأول، وإن لم تظهر هذه الحكمة في بداية الأمر.';
const String p5 =
    'انطلق رسول الله ﷺ ليخطب على فتاه زيد بن حارثة رضي الله عنه، فدخل على زينب بنت جحش الأسدية رضي الله عنها فخطبها، فقالت: لست بناكحته فقال رسول الله ﷺ : بلى فانكحيه قالت يارسول الله أؤامرَ في نفسي؟ فبينما هما يتحادثان أنزل الله تعالى: وَمَا كَانَ لِمُؤْمِنٍ وَلا مُؤْمِنَةٍ إِذَا قَضَى اللَّهُ وَرَسُولُهُ أَمْرًا أَنْ يَكُونَ لَهُمُ الْخِيَرَةُ مِنْ أَمْرِهِمْ - سورة الأحزاب.';
const String p6 =
    'فقالت: يارسول الله قد رضيته لي زوجاً؟ قال: نعم قالت: لا أعصي رسول الله ﷺ وقد زوجته نفسي، وكان زيد بن حارثة إذ ذاك لايزال يدعى زيد بن محمد، فتزوجها زيد وأصدقها في هذا الزواج عشرة دنانير وستين درهماً وخماراً وملحفة ودرعاً وخمسين مداً من طعام وعشرة أمداد من تمر.';
const String p7 =
    'شاءت حكمة الله تعالى أن لايتوافقا زيد وزينب في زواجهما وأصبحت حياة الزوجين لاتطاق، وصمم زيد على فراق زوجه زينب وكان قبل ذلك يشتكي لرسول الله ﷺ من عدم استطاعته البقاء مع زينب ورسول الله يأمره بإمساك زوجه مع تقوى الله في شأنها، حتى أذن الله بالطلاق فطلقها زيد وانفصمت العلاقة بينهما بعد أن قضى زيد وطره، وبعد أن مكث معها مايقرب من سنة، قال ابن كثير: فمكثت عنده قريباً من سنة أو فوقها، ثم وقع بينهما يعني الخلاف فجاء زيد يشكوها إلى رسول الله ﷺ فجعل رسول الله ﷺ يقول له: أمسك عليك زوجك واتق الله.';
const String p8 =
    'لم يبقى لزيد رغبة في إبقاء العلاقة الزوجية معها لأنه كان كريم النفس، لايريد أن يبني سعادته وراحته على شقاء الآخرين وتعاستهم والإضرار بهم، ولهذا صمم على الفراق وعدم الإضرار بها، لأنها كانت تعيش في قلق واضطراب وانتهى زواج زيد بن حارثة رضي الله عنه بزينب بنت جحش على هذا الوضع دون أي تدخل خارجي بينهما، ووقع ذلك الطلاق بمحض اختياره وإرادته، وأن رسول الله ﷺ كان ينهاه عن ذلك، ويأمره بتقوى الله وإمساك زوجته ، قال ابن كثير بعد أن ذكر هذا السبب: ذكر ابن أبي حاتم وابن جرير آثاراً عن بعض السلف رضي الله عنهم أحببنا أن نضرب عنها صفحاً لعدم صحتها فلا نوردها.';
const String p9 =
    'كانت عادة التبني متغلغلة في نفوس الناس ومشاعرهم وليس من السهل التغلب عليها وإلغاء الآثار المترتبة عليها، هذه العادة في صدر الإسلام في مكة وفي أول الهجرة إلى المدينة، ثم شاء الله تعالى فنزلت الآيات في نفي أن يكون الأدعياء أبناء لمن ادعاهم في الحقيقة وإنما ذلك حسب دعوى المدعي فقط، وذلك لايغير من الواقع شيئاً، فقال تعالى: مَا جَعَلَ اللَّهُ لِرَجُلٍ مِنْ قَلْبَيْنِ فِي جَوْفِهِ وَمَا جَعَلَ أَزْوَاجَكُمُ اللائِي تُظَاهِرُونَ مِنْهُنَّ أُمَّهَاتِكُمْ وَمَا جَعَلَ أَدْعِيَاءَكُمْ أَبْنَاءَكُمْ ذَلِكُمْ قَوْلُكُمْ بِأَفْوَاهِكُمْ وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ - سورة الأحزاب.';
const String p10 =
    'كانت عادة التبني متغلغلة في نفوس الناس ومشاعرهم وليس من السهل التغلب عليها وإلغاء الآثار المترتبة عليها، هذه العادة في صدر الإسلام في مكة وفي أول الهجرة إلى المدينة، ثم شاء الله تعالى فنزلت الآيات في نفي أن يكون الأدعياء أبناء لمن ادعاهم في الحقيقة وإنما ذلك حسب دعوى المدعي فقط، وذلك لايغير من الواقع شيئاً، فقال تعالى: مَا جَعَلَ اللَّهُ لِرَجُلٍ مِنْ قَلْبَيْنِ فِي جَوْفِهِ وَمَا جَعَلَ أَزْوَاجَكُمُ اللائِي تُظَاهِرُونَ مِنْهُنَّ أُمَّهَاتِكُمْ وَمَا جَعَلَ أَدْعِيَاءَكُمْ أَبْنَاءَكُمْ ذَلِكُمْ قَوْلُكُمْ بِأَفْوَاهِكُمْ وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ - سورة الأحزاب';
const String p11 =
    'ثم أمر تبارك وتعالى برد نسبهم إلى آبائهم في الحقيقة، فهذا من العدل والقسط والبر، فقال تعالى: ادْعُوهُمْ لآبَائِهِمْ هُوَ أَقْسَطُ عِنْدَ اللَّهِ فَإِنْ لَمْ تَعْلَمُوا ءَابَاءَهُمْ فَإِخْوَانُكُمْ فِي الدِّينِ وَمَوَالِيكُمْ وَلَيْسَ عَلَيْكُمْ جُنَاحٌ فِيمَا أَخْطَأْتُمْ بِهِ وَلَكِنْ مَا تَعَمَّدَتْ قُلُوبُكُمْ وَكَانَ اللَّهُ غَفُورًا رَحِيمًا - سورة الأحزاب.';
const String p12 =
    'فعن عبدالله بن عمر رضي الله عنهما قال: إن زيد بن حارثة رضي الله عنه مولى رسول الله ﷺ ماكنا ندعوه إلا زيد بن محمد حتى نزل القرآن.';
const String p13 =
    'ولم يجعل الله سبحانه وتعالى عدم معرفتهم لآبائهم الحقيقيين مبرراً لإبقاء تبنيهم لهم، بل حرم التبني في هذه الحالة، وأخبر أنهم حينئذ إخوانهم ومواليهم، فقال تعالى: ادْعُوهُمْ لآبَائِهِمْ هُوَ أَقْسَطُ عِنْدَ اللَّهِ فَإِنْ لَمْ تَعْلَمُوا ءَابَاءَهُمْ فَإِخْوَانُكُمْ فِي الدِّينِ وَمَوَالِيكُمْ وَلَيْسَ عَلَيْكُمْ جُنَاحٌ فِيمَا أَخْطَأْتُمْ بِهِ وَلَكِنْ مَا تَعَمَّدَتْ قُلُوبُكُمْ وَكَانَ اللَّهُ غَفُورًا رَحِيمًا - سورة الأحزاب.';
const String p14 =
    'فقد نفى الله سبحانه وتعالى الجُناح الإثم عمن أخطأ في نسبة الابن إلى غير أبيه في الحقيقة، وذلك بعد الاجتهاد واستفراغ الوسع أو نسي فنسب الابن إلى غير أبيه بجريان لسانه بذلك، وأثبت الحرج والإثم لمن تعمد الباطل وهو دعوة الرجل لغير أبيه بعد علمه بتحريم ذلك.';
const String p15 =
    'أن مايقع بين الزوجين من نفرة وخلاف ثم طلاق لايجوز أن يكون مانعاً من نصح أحد الزوجين للآخر، وأن يراعي فيه حقوق الأخوة الإيمانية، وكان خاطب زينب للنبي ﷺ هو زوجها الأول زيد بن حارثة رضي الله عنه، ولعل اختيار رسول الله ﷺ لزيد مقصود لذاته، ليقطع بذلك ألسنة المتقولين وماقد يزعمونه من أن طلاقها وقع بغير اختيار منه.';
const String p16 =
    'عتاب للنبي ﷺ من ربه، إذ كان حين يأتيه زيد يشكو زينب ومعاملتها له ورغبته في طلاقها يقول: أمسك عليك زوجك واتق الله، أي اتق الله ودع طلاقها، أو اتق الله فيما تذكره من سوء عشرتها، ورسول الله ﷺ يخفي في نفسه ما أبلغه الله به أن زيداً سيطلقها، وأنها ستكون زوجة له، ويخشى متى وقع هذا من كلام الناس في قولهم: تزوج مطلقة من تبناه وهو زيد بن حارثة، وعن عائشة رضي الله عنها قالت: لو كان محمد ﷺ كاتماً شيئاً مما أنزل عليه لكتم هذه ال وَإِذْ تَقُولُ لِلَّذِي أَنْعَمَ اللَّهُ عَلَيْهِ وَأَنْعَمْتَ عَلَيْهِ أَمْسِكْ عَلَيْكَ زَوْجَكَ وَاتَّقِ اللَّهَ وَتُخْفِي فِي نَفْسِكَ مَا اللَّهُ مُبْدِيهِ وَتَخْشَى النَّاسَ وَاللَّهُ أَحَقُّ أَنْ تَخْشَاهُ - سورة الأحزاب';
const String p17 =
    'وقوله تعالى: فَلَمَّا قَضَى زَيْدٌ مِنْهَا وَطَرًا زَوَّجْنَاكَهَا ، منقبة عظيمة لزيد بن حارثة رضي الله عنه فقد انفرد بهذا، إذ لم يُسَم القرآن أحد من الصحابة غيره، قال السهيلي: كان يقال: زيد بن محمد حتى نزل: ادعوهم لآبائهم ، فقال: أنا زيد بن حارثة، وحرم عليه أن يقول: أنا زيد بن محمد، فلما نُزع عنه هذا الشرف وهذا الفخر، وعلم الله وحشته من ذلك شرّفه بخصيصة لم يكن يَخُصّ بها أحداً من أصحاب النبي ﷺ ، وهي أنه سماه في القرآن، فقال تعالى: فَلَمَّا قَضَى زَيْدٌ مِنْهَا وَطَرًا يعني من زينب، ومن ذكره الله تعالى باسمه في الذكر الحكيم حتى صار اسمه قرآنا يتلى في المحاريب، نوه به غاية التنويه، فكان في هذا تأنيس له وعوض من الفخر بأبوّة محمد ﷺ له ألا ترى إلى قول أبي بن كعب حين قال له النبي ﷺ : إن الله أمرني أن أقرأ عليك - سورة كذا ، فبكى وقال: أوذكرت هنالك؟ وكان بكاؤه من الفرح حين أخبر أن الله تعالى ذكره، فكيف بمن صار اسمه قرآناً يتلى مخلداً لايبيد ويتلوه أهل الدنيا إذا قرؤوا القرآن، وأهل الجنة أبداً لايزال على ألسنة المؤمنين، كما لم يزل مذكوراً على الخصوص عند رب العالمين، إذ القرآن كلام الله القويم وهو باق لايبيد، فاسم زيد هذا في الصحف المكرمة المرفوعة المطهرة تذكره في التلاوة السفرة الكرام البررة، وليس ذلك لإسم من أسماء المؤمنين إلا لنبيّ من الأنبياء ولزيد بن حارثة تعويضاً من الله تعالى له مانُزع منه.';
const String p18 =
    'لما انقضت عدة زينب قال رسول الله ﷺ لزيد: اذهب فاذكرها عَليَّ فانطلق قال: فلما رأيتها عظمت في صدري فقلت: يازينب أبشري أرسلني رسول الله ﷺ يذكرك، قالت: ما أنا بصانعة شيئاً حتى أؤمر ربي، فقامت إلى مسجدها ونزل القرآن، وجاء رسول الله ﷺ ودخل عليها بغير إذن ، وأصدقها أربعمائة درهم، وكان زواجه ﷺ بزينب في السنة الخامسة.';
const String p19 =
    'زواج النبي ﷺ بزينب بنت جحش رضي الله عنها كان بأمر ربه، وهو الذي زوجه إياها، قال تعالى: وَإِذْ تَقُولُ لِلَّذِي أَنْعَمَ اللَّهُ عَلَيْهِ وَأَنْعَمْتَ عَلَيْهِ أَمْسِكْ عَلَيْكَ زَوْجَكَ وَاتَّقِ اللَّهَ وَتُخْفِي فِي نَفْسِكَ مَا اللَّهُ مُبْدِيهِ وَتَخْشَى النَّاسَ وَاللَّهُ أَحَقُّ أَنْ تَخْشَاهُ فَلَمَّا قَضَى زَيْدٌ مِنْهَا وَطَرًا زَوَّجْنَاكَهَا لِكَيْ لا يَكُونَ عَلَى الْمُؤْمِنِينَ حَرَجٌ فِي أَزْوَاجِ أَدْعِيَائِهِمْ إِذَا قَضَوْا مِنْهُنَّ وَطَرًا وَكَانَ أَمْرُ اللَّهِ مَفْعُولا - سورة الأحزاب';
const String p20 =
    'وفي هذا شرف عظيم ومنقبة جليلة لزينب رضي الله عنها، كانت تفاخر بها فعن أنس رضي الله عنه قال: كانت تفخر على أزواج النبي ﷺ تقول: زوجكن أهاليكن وزوجني الله من فوق سبع سماوات.';
const String p21 =
    'أولم الرسول ﷺ في عرس زينب وليمة كبيرة، فأولم بشاة وقد دعى إلى الوليمة كل من لقيه أنس رضي الله عنه بناءً على أمر الرسول ﷺ ، فعن أنس رضي الله عنه قال: ما رأيت رسول الله ﷺ أولم على امرأة من نسائه ما أولم على زينب، فإنه ذبح شاة.';
const String p22 =
    'فعن أنس بن مالك رضي الله عنه قال: تزوج رسول الله ﷺ فدخل بأهله، قال: فصنعت أمي أم سليم حيساً فجعلته في تور -إناء- فقالت: يا أنس: اذهب بهذا إلى رسول الله ﷺ فقل: بعثت بهذا إليك أمي، وهي تقرئك السلام وتقول: إن هذا لك منا قليل يارسول الله! قال: فذهبت بها إلى رسول الله ﷺ ، فقلت: إن أمي تقرئك السلام وتقول: إن هذا لك منا قليل يارسول الله! فقال: ضعه ثم قال: اذهب فادع لي فلاناً وفلاناً، ومن لقيت، وسمى رجالاً، قال: فدعوت من سمى ومن لقيت، قال: قلت لأنس: عدد كم كانوا؟ قال: زهاء ثلاثمائة وقال لي رسول الله ﷺ : ياأنس: هات التور، قال: فدخلوا حتى امتلأت الصفة والحجرة، فقال رسول الله ﷺ : ليتحلق عشرة عشرة، وليأكل كل إنسان مما يليه، قال: فأكلوا حتى شبعوا.';
const String p23 =
    'قال: فخرجت طائفة ودخلت طائفة حتى أكلوا كلهم، فقال لي: يا أنس: ارفع قال: فرفعت فما أدري حين وضعت كان أكثر أم حين رفعت، قال وجلس طوائف منهم يتحدثون في بيت رسول الله ﷺ ، ورسول الله ﷺ جالس، وزوجته مولية وجهها إلى الحائط، فثقلوا على رسول الله ﷺ ، فخرج رسول الله ﷺ على نسائه ثم رجع، فلما رأوا رسول الله ﷺ قد رجع ظنوا أنهم قد ثقلوا عليه، قال: فابتدروا الباب فخرجوا كلهم، وجاء رسول الله ﷺ حتى أرخى الستر ودخل، وأنا جالس في الحجرة، فلم يلبث إلا يسيراً حتى خرج عليَّ، وأنزلت هذه الآية، فخرج رسول الله ﷺ وقرأهن على الناس: يَاأَيُّهَا الَّذِينَ ءَامَنُوا لا تَدْخُلُوا بُيُوتَ النَّبِيِّ إِلا أَنْ يُؤْذَنَ لَكُمْ إِلَى طَعَامٍ غَيْرَ نَاظِرِينَ إِنَاهُ وَلَكِنْ إِذَا دُعِيتُمْ فَادْخُلُوا فَإِذَا طَعِمْتُمْ فَانْتَشِرُوا وَلا مُسْتَأْنِسِينَ لِحَدِيثٍ إِنَّ ذَلِكُمْ كَانَ يُؤْذِي النَّبِيَّ فَيَسْتَحْيِي مِنْكُمْ وَاللَّهُ لا يَسْتَحْيِي مِنَ الْحَقِّ وَإِذَا سَأَلْتُمُوهُنَّ مَتَاعًا فَاسْأَلُوهُنَّ مِنْ وَرَاءِ حِجَابٍ ذَلِكُمْ أَطْهَرُ لِقُلُوبِكُمْ وَقُلُوبِهِنَّ وَمَا كَانَ لَكُمْ أَنْ تُؤْذُوا رَسُولَ اللَّهِ وَلا أَنْ تَنْكِحُوا أَزْوَاجَهُ مِنْ بَعْدِهِ أَبَدًا إِنَّ ذَلِكُمْ كَانَ عِنْدَ اللَّهِ عَظِيمًا - سورة الأحزاب';
const String p24 =
    'هذا وقد توفيت زينب بنت جحش رضي الله عنها سنة عشرين من الهجرة، وعمرها ثلاث وخمسون سنة، وكانت كما أخبر النبي ﷺ أول نسائه لحوقاً به ، وقد بلغت مروياتها عن النبي ﷺ وفق كتاب بقي بن مخلد أحد عشر حديثاً ، ولها في الكتب الستة خمس أحاديث ، اتفق لها في البخاري ومسلم عن حديثين ، فقد تركت ذكراً طيباً في تاريخ الأمة الإسلامية.';
