const int sectionIndex = 61;
const String sectionTitle = 'غزوة مؤتة';

const List t1 = ['1', 'مقتل رسول  رسول الله ﷺ'];
const List t2 = ['2', 'اعتداءات الروم'];
const List t3 = ['3', 'الثأر لمن قُتلوا'];
const List t4 = ['4', 'تجهيز الجيش واختيار القادة'];
const List t5 = ['5', 'وصايا رسول الله ﷺ'];
const List t6 = ['6', 'وداع الجيش الاسلامي'];
const List t7 = ['7', 'الجيش يصل الى معان'];
const List t8 = ['8', 'عبدالله بن رواحة يحسم الموقف'];
const List t9 = ['9', 'استشهاد زيد بن حارثة'];
const List t10 = ['10', 'استشهاد جعفر بن أبي طالب'];
const List t11 = ['11', 'استشهاد عبدالله بن رواحة'];
const List t12 = ['12', 'ثابت بن أقرم رضى الله عنه'];
const List t13 = ['13', 'خطة خالد بن الوليد'];
const List t14 = ['14', 'تضليل العدو'];
const List t15 = ['15', 'تنفيذ الخطة'];
const List t16 = ['16', 'معجزة رسول الله ﷺ لأهل المدينة'];
const List t17 = ['17', 'وصول الجيش للمدينة'];
const List t18 = ['18', 'أهمية المعركة'];
const List t19 = ['19', 'حب الشهاد والتضحية'];
const List t20 = ['20', 'نعى النبي ﷺ للثلاث صحابة قبل استشهادهم'];
const List t21 = ['21', 'التصرف الحكيم فى حالة عدم وجود قائد'];
const List t22 = ['22', 'احترام القيادة'];
const List t23 = ['23', 'مقاييس الإيمان وأثرها في المعارك'];

const String p1 =
    'بعد صلح الحديبية أخذ المسلك العدواني على المسلمين يأخذ منحنى أكثر خطورة، فقد قام شرحبيل بن عمرو الغساني بضرب عنق رسول رسول الله الحارث بن عمير الأزدي ولم تجر العادة بقتل الرسل والسفراء، كما أن الحارث بن أبي شمر الغساني حاكم دمشق أساء استقبال مبعوث رسول الله وهدد بإعلان الحرب على المدينة.';
const String p2 =
    'ثم حدث بعد ذلك بما يزيد قليلاً عن العام أن بعث رسول الله سرية بقيادة عمرو بن كعب الغفاري ليدعو الى الاسلام في مكان يقال له ذات اطلاح فلم يستجب أهل المنطقة الى الاسلام وأحاطوا بالدعاة من كل مكان وقاتلوهم حتى قتلوهم جميعاً إلا أميرهم كان جريحاً فتحامل على جرحه حتى وصل الى المدينة فأخبر رسول الله ﷺ ، وقد قام نصارى الشام بزعامة الامبراطورية الرومانية بالاعتداءات على من يعتنق الاسلام أو يفكر بذلك، فقد قتلوا والي مَعَانَ حين أسلم، وقتل والي الشام من أسلم من عرب الشام.';
const String p3 =
    'كانت هذه الأحداث المؤلمة وبخاصة مقتل سفير رسول الله الحارث بن عمير الأزدي محركة لنفوس المسلمين، وباعثاً له ليضعوا حداً لهذه التصرفات النصرانية العدوانية، ويثأروا لإخوانهم في العقيدة الذين سفكت دمائهم بغير حق إلا أن يقولوا ربنا الله ونبينا محمد رسول الله، كما أن تأديب عرب الشام التابعين للدولة الرومانية والذين دأبو على استفزاز المسلمين وتحديهم وارتكاب الجرائم ضد دعاتهم أصبح هدفاً مهماً، لأن تحقيق هذا الهدف معناه فرض هيبة الدولة الاسلامية في تلك المناطق بحيث لاتتكرر مثل هذه الجرائم في المستقبل وبحيث يأمن الدعاة المسلمون على أنفسهم ويأمن التجار المترددون بين الشام والمدينة من كل أذى يحول دون وصول السلع الضرورية الى المدينة.';
const String p4 =
    'وفي سنة 8هـ أمر رسول الله ﷺ المسلمين بالتجهز للقتال، فاستجابوا للأمر النبوي وحشدوا حشوداً لم يحشدوها من قبل، إذ بلغ عدد المقاتلين في هذه السرية ثلاثة آلاف مقاتل، واختار النبي ﷺ للقيادة ثلاثة أمراء على التوالي: زيد بن حارثة، ثم جعفر بن أبي طالب ثم عبدالله بن رواحة، فقد روى البخاري في صحيحه بإسناده الى عبدالله بن عمر بن الخطاب رضي الله عنهما قال: أمّر رسول الله ﷺ في غزوة مؤتة زيد بن حارثة فقال رسول الله ﷺ : إن قتل زيد فجعفر، وإن قتل جعفر فعبدالله بن رواحة.';
const String p5 =
    'وقد أمر رسول الله ﷺ الجيش الاسلامي أن يأتوا المكان الذي قتل فيه الحارث ابن عمير الأزدي رضي الله عنه وأن يدعوا من كان هناك الى الاسلام فإن أجابوا فبها ونعمت وإن أبوا استعينوا بالله عليهم وقاتلوهم، وقد زود الرسول ﷺ الجيش في هذه السرية وغيرها من السرايا بوصايا تتضمن آداب القتال في الاسلام، فقد أوصى رسول الله ﷺ أصحابه بقوله: أوصيكم بتقوى الله وبمن معكم من المسلمين خيراً أغزوا باسم الله في سبيل الله من كفر بالله، لا تغدروا ولا تقتلوا وليداً ولا امرأة ولا كبيراً فانياً ولا منعزلاً بصومعة ولا تقربوا نخلاً ولا تقطعوا شجراً ولا تهدموا بناءً، وإذا لقيتم عدوكم من المشركين فادعوهم الى إحدى ثلاث: فإما الاسلام وإما الجزية وإما الحرب.';
const String p6 =
    'لما تجهز الجيش الاسلامي وأتم استعداده توجه رسول الله ﷺ والمسلمون يودعون الجيش ويرفعون أكف الضراعة لله عز وجل أن ينصر إخوانهم المجاهدين، لقد سلموا عليهم وودعوهم بهذا الدعاء: دفع الله عنكم وردكم صالحين غانمين، ولما ودع الناس عبدالله بن رواحة وسلموا عليه بكى: وانهمرت الدموع من عينيه ساخنة غزيرة فتعجب الناس من ذلك وقال: مايبكيك يا ابن رواحة؟ فقال: والله مابي حب الدنيا وصبابة، ولكن سمعت رسول الله ﷺ يقرأ آية من كتاب الله يذكر فيها النار: وَإِنْ مِنْكُمْ إِلا وَارِدُهَا كَانَ عَلَى رَبِّكَ حَتْمًا مَقْضِيًّا - سورة مريم ، فلست أدري كيف بي بالصدر بعد الورود فقال لهم المسلمون: صحبكم الله ودفع عنكم.';
const String p7 =
    'لما وصل الجيش الاسلامي الى معان من أرض الشام وهي الآن محافظة من محافظات الأردن بلغه أن النصارى الصليبيين من عرب وعجم قد حشدوا حشوداً ضخمة لقتالهم، إذ حشدت القبائل العربية مائة ألف صليبي من لخم وجذام وبهراء وبلى وعينت لهم قائداً هو مالك بن رافله وحشد هرقل مائة ألف نصراني صليبي من الروم فبلغ جيشهم مائتي ألف مقاتل، مزودين بالسلاح الكافي يرفلون في الديباج لينبهر المسلمون بهم وبقوتهم.';
const String p8 =
    'قام المسلمون في معان يومين يتشاورون في التصدي لهذا الحشد الضخم فقال بعضهم: نرسل الى رسول الله ﷺ في المدينة نخبره بحشود العدو فإن شاء أمدنا بالمدد وإن شاء أمرنا بالقتال، فحسم عبدالله بن رواحة الموقف بقوله: ياقوم والله إن الذي تكرهون للذي خرجتم تطلبون الشهادة وما نقاتل الناس بعدد ولا قوة ولا كثرة مانقاتلهم إلا بهذا الدين الذي أكرمنا الله به فانطلقوا فإنما هي إحدى الحسنيين إما ظهور وإما شهادة.';
const String p9 =
    'اندفع زيد بن حارثة بالناس الى منطقة مؤتة جنوب الكرك يسير حيث آثر الاصطدام بالروم هناك، فكانت ملحمة سجل فيها القادة الثلاثة بطولة عظيمة انتهت باستشهادهم، فقد استبسل زيد بن حارثة وتوغل في صفوف الأعداء وهو يحمل راية رسول الله ﷺ حتى شاط في رماح القوم.';
const String p10 =
    'ثم أخذ الراية جعفر وانبرى يتصدى لجموع المشركين الصليبيين فكثفوا حملاتهم عليه، وأحاطوا به إحاطة السوار بالمعصم، فلم تلن له قناة ولم تهن له عزيمة، بل استمر في القتال وزيادة في الإقدام ونزل عن فرسه وعقرها وأخذ ينشد: يا حبذا الجنة واقترابُها .. طيبة وبارداً شرابُها.';
const String p11 =
    'لقد أخذ رضي الله عنه عنه اللواء بيده اليمنى فقطعت فأخذه بشماله فقطعت فاحتضنه بعضديه وانحنى عليه حتى استشهد وهو ابن ثلاث وثلاثين سنة، ولقد أثخن رضي الله عنه بالجراح إذ بلغ عدد جراحه تسعين بين طعنة برمح أو ضربة بسيف أو رمية بسهم وليس من بينهما جرح في ظهره بل كلها في صدره، وروى الامام البخاري رحمه الله في صحيحه بإسناده الى عبدالله بن عمر بن الخطاب رضي الله عنهما قال: كنت في تلك الغزوة فالتمسنا جعفر بن أبي طالب فوجدناه في القتلى ووجدنا مافي جسده بضعاً وتسعين من طعنة أو رمية، ولقد عوض الله تبارك وتعالى جعفر بن أبي طالب رضي الله عنه وأكرمه على شجاعته وتضحيته بأن جعل له جناحين يطير بهما في الجنة حيث يشاء، فقد روى البخاري في صحيحه بإسناده الى عامر قال: كان ابن عمر إذا حيا ابن جعفر قال: السلام عليك يا ابن ذي الجناحين.';
const String p12 =
    'بعد استشهاد جعفر استلم الراية عبدالله بن رواحة الأنصاري رضي الله عنه وامتطى جواده وهو يقول:';
const String p13 = 'اقسمت يانفس لتنزلنه.. لتنزلن أو لتكرهنه';
const String p14 = 'إن أجْلبَ الناسُ وشدوا الرّنَّه.. مالي أراك تكرهين الجنة';
const String p15 = 'قد طال ماقد كنت مطمئنة.. هل أنت إلا نطفة في شنة';
const String p16 = 'يانفس إلا تقتلى تموتي.. هذا حمام الموت قد صَليتِ';
const String p17 = 'وماتمنيت فقد أعطيت.. إن تفعلي فِعْلهما هُديت';
const String p18 =
    'ويذكر أن ابن عم لعبدالله بن رواحة قد قدم له قطعة من لحم وقال له: شد بهذا صلبك فإنك لقيت في ايامك هذه مالقيت، فأخذه من يده ثم انتهش منه نهشة ثم سمع جلبة وزخاماً في جبهة القتال، فقال يخاطب نفسه وأنت في الدنيا، ثم ألقى قطعة اللحم من يده وتقدم يقاتل العدو حتى استشهد رضي الله عنه وكان ذلك في آخر النهار.';
const String p19 =
    'ولما استشهد عبدالله بن رواحة رضي الله عنه وسقطت الراية من يده فالتقطها ثابت بن أقرم بن تعلبة بن عدي بن العجلان البلوي الأنصاري وقال: يامعشر المسلمين اصطلحوا على رجل منكم قالوا: أنت قال: ما أنا بفاعل، فاصطلح الناس على خالد بن الوليد، وجاء في إمتاع الأسماع أن ثابت بن أقرم نظر الى خالد بن الوليد فقال: خذ اللواء يا ابا سليمان فقال: لا آخذه، أنت أحق به أنت رجل لك سن فقد شهدت بدراً، فقال ثابت: خذه أيها الرجل فو الله ما أخذته إلا لك، فأخذه خالد بن الوليد رضي الله عنه.';
const String p20 =
    'أصبحت الخطة الأساسية لخالد في تلك الساعة العصيبة من القتال أن ينقذ المسلمين من الهلاك الجماعي، فبعد أن قدر الموقف وإحتمالاته المختلفة قدراً دقيقاً ودرس ظروف المعركة درساً وافياً وتوقع نتائجها، اقتنع بأن الانسحاب بأقل خسارة ممكنة هو الحل الأفضل، فقوة العدو تبلغ 66 ضعفاً لقوة المسلمين فلم يبق أمام هؤلاء إلا الانسحاب المنظم وعلى هذا الأساس وضع خالد خطة وهى الحؤول بين جيش الروم وجيش المسلمين ليضمن لهذا الأخير سلامة الانسحاب.';
const String p21 =
    'لبلوغ هذا الهدف لابد من تضليل العدو بإيهامه أن مدداً قد ورد الى جيش المسلمين فيخفف من ضغطه وهجماته ويتمكن المسلمون من الانسحاب، وصمد خالد حتى المساء عملاً بهذه الخطة وغيرّ في ظلام الليل مراكز المقاتلين في جيشه فاستبدل الميمنة بالميسرة ومقدمة القلب بالمؤخرة، وفي أثناء عملية الاستبدال اصطنع ضجة صاخبة وجلبة قوية، ثم حمل على العدو عند الفجر بهجمات سريعة متتالية وقوية ليُدخل في روعه إن إمدادات كثيرة وصلت الى المسلمين.';
const String p22 =
    'بدا للعدو صباحاً أن الوجوه والرايات التي تواجهه جديدة لم يرها من قبل، وأن المسلمين يقومون بهجمات عنيفة، فأيقن أنهم تلقوا إمدادات وأن جيشاً جديداً نزل الى الميدان، وكان البلاء الحسن الذي أبلاه المسلمون قد فتَّ في عضد الروم وحلفائهم فأدركوا أن إحراز نصر حاسم ونهائي على المسلمين أمر مستحيل، فتخاذلوا وتقاعسوا عن متابعة الهجوم وضعف نشاطهم واندفاعهم فخف الضغط عن جيش المسلمين، وانتهز خالد الفرصة فباشر الانسحاب وكانت عملية التراجع التي قام بها خالد في أثناء معركة مؤتة من أكثر العلميات في التاريخ العسكري مهارة ونجاحاً بل إنها تتفق وتتلائم مع التكتيك الحديث للانسحاب، فقد عمد خالد الى سحب الجناحين بحماية القلب، ولما أصبح الجناحين بمنأى عن العدو وفي مأمن منه، عمد الى سحب القلب بحماية الجناحين، الى أن تمكن وضمن سلامة الانسحاب كلياً، ويقول المؤرخون إن خسارة المسلمين لم تتعد الاثنى عشر قتيلاً في هذه المعركة وان خالداً قال: لقد انقطع في يدي يوم مؤتة تسعة أسياف فما بقي إلا صفيحة يمانية.';
const String p23 =
    'ويمكن القول إن خالداً بخطته تلك قد أنقذ الله المسلمين به من هزيمة ماحقة وقتل محقق وان انسحابه كان قمة النصر بالنسبة الى ظروف المعركة حيث يكون الانسحاب في ظروف مماثلة أصعب حركات القتال بل أجداها وأنفعها.';
const String p24 =
    'ظهرت معجزة للرسول ﷺ في أمر هذه السرية فقد نعى المسلمين في المدينة زيداً وجعفراً وابن أبي رواحة قبل أن يصل إليه خبرهم، وحزن رسول الله ﷺ لما وقع للسرية وذرفت عيناه الدموع ثم أخبرهم باستلام خالد للراية، وبشرهم بالفتح على يديه واسماه سيف الله، وبعد ذلك قدم من أخبرهم بأخبار السرية ولم يزد عما أخبرهم به النبي ﷺ .';
const String p25 =
    'ولما دنا الجيش من حول المدينة تلقاهم رسول الله ﷺ والمسلمون ولقيهم الصبيان يشتدون ورسول الله ﷺ مقبل مع القوم على دابة فقال: خذو الصبيان واحملوهم وأعطوني ابن جعفر، فأتي بعبد الله فأخذه وحمله على يديه وجعل الناس يحثون على الجيش التراب ويقولون يافُرّار افررتم في سبيل الله، ويقول رسول الله ﷺ ليسوا بالفرار، ولكنهم الكرار إن شار الله تعالى.';
const String p26 =
    'وإن الانسان ليعجب من هذه التربية النبوية التي صنعت من الاطفال الصغار رجالاً وأبطالاً يرون العودة من المعركة دون شهادة في سبيل الله فراراً من سبيل الله، لا يكافأون عليه إلا بحثو التراب في وجوههم فأين شبابنا من هذه النماذج الرفيعة من الرجولة الفذة المبكرة؟ ولن تستطيع الأمة أن ترتفع الى هذه الأهداف النبيلة والقمم الشوامخ إلا بالتربية الاسلامية الجادة القائمة على المنهاج النبوي الكريم.';
const String p27 =
    'تعتبر هذه المعركة من أهم المعارك التي وقعت بين المسلمين وبين النصارى الصليبيين من عرب وعجم لأنها أول صدام مسلح ذي بال بين الفريقين، وأثرت تلك المعركة على مستقبل الدولة الرومانية، فقد كانت مقدمة لفتح بلاد الشام وتحريرها من الرومان ونستطيع أن نقول أن تلك الغزوة هي خطوة عملية قام بها النبي ﷺ للقضاء على دولة الروم المتجبرة في بلاد الشام، فقد هز هيبتها من قلوب العرب وأعطت فكرة عن الروح المعنوية العالية عند المسلمين، كما أظهرت ضعف الروح المعنوية في القتال عند الجندي الصليبي النصراني وأعطت فرصة للمسلمين للتعرف على حقيقة قوات الروم ومعرفة أساليبهم في القتال.';
const String p28 =
    'إن الصبر والثبات والتضحية التي تجلت في كل واحد من الأمراء الثلاثة وسائر الجند كان مبعثها الحرص على ثواب المجاهدين والرغبة في نيل الشهادة لكي يكرمهم الله برفقة النبيين والصديقين والشهداء والصالحين ويدخلون جنات الله الواسعة التي فيها مالا عين رأت ولا أذن سمعت ولا خطر على قلب بشر.';
const String p29 =
    'فهي الوحيدة التي جاء خبرها من السماء إذ نعى النبي ﷺ استشهاد الأبطال الثلاثة قبل أن يصل الخبر من أرض المعركة، بل وأخبر النبي ﷺ عن أحداثها وتمتاز أيضاً عن غيرها بأن الوقعة الوحيدة التي اختار النبي ﷺ لها ثلاثة أمراء على الترتيب: زيد بن حارثة وجعفر بن ابي طالب وعبدالله بن رواحة.';
const String p30 =
    'إنه درس عظيم يقدمه لنا الصحابي الجليل ثابت بن أقرم العجلاني عندما أخذ اللواء بعد استشهاد عبدالله بن رواحة آخر الأمراء وذلك أداء منه للواجب، لأن وقوع الراية معناه هزيمة الجيش، ثم نادى المسلمين أن يختاروا لهم قائداً في زحمة الأحداث قالوا أنت قال: ما أنا بفاعل.. فاصطلح الناس على خالد، وفي رواية أن ثابتاً مشى باللواء الى خالد فقال خالد: لا آخذه منك أنت أحق به فقال: والله ماأخذته إلا لك.';
const String p31 =
    'إن مضمون كلا الروايتين واحد، أن ثابتاً جمع المسلمين أولاً وأعطى القوس باريها فأعطى الراية أبا سليمان خالد بن الوليد، ولم يقبل قول المسلمين: أنت أميرنا، ذلك أنه يرى فيهم من هو أكفأ منه لهذا العمل وحينما يتولى العمل من ليس له بأهل، فإن الفساد متوقع والعمل حينما يكون لله تعالى، لا يكون فيه أثر لحب الشهرة أو حظ النفس وإن ثابتاً لم يكن عاجزاً عن قيادة المسلمين -وهو ممن حضر بدراً - ولكنه رأى من الظلم أن يتولى عملاً وفي المسلمين من هو أجدر به منه، حتى ولو لم يمض على اسلامه أكثر من ثلاثة أشهر لأن الغاية هي السعي لتنفيذ أوامر الله على الوجه الأحسن والطريقة الأمثل.';
const String p32 =
    'إن كثيراً ممن يتزعمون قيادة الدعوة الاسلامية اليوم يضعون العراقيل أمام الطاقات الجديدة، والقدرات الفذة خوفاً على مكانتهم القيادية وامتيازاتهم الشخصية واطماعهم الدنيوية، فعلى اولئك القادة أن يتعظوا من هذا الدرس البليغ لمن كان له قلب أو ألقى السمع وهو شهيد.';
const String p33 =
    'قال عوف بن مالك الأشجعي ضي الله عنه: خرجت مع زيد بن حارثة في غزوة مؤتة ورافقني مَدَديّ من اليمن، ومضينا فلقينا جموع الروم، فيهم رجل على فرس له اشقر عليه سرج مذهب وله سلاح مذهب، فجعل الرومي يضرب بالمسلمين فقعد له المددي خلف صخرة فمر به الرومي فعرقب فرسه بسيفه، وفر الرومي فعلاه بسيفه فقتله وحاز فرسه وسلاحه فلما فتح الله للمسلمين، بعث إليه خالد بن الوليد فأخذ منه بعض السلب قال عوف: فأتيت خالداً وقلت له: أما علمت أن رسول الله ﷺ قضى بالسلب للقاتل؟ قال بلى ولكني أستكثرته، قلت لتردنها إليه أو لاعرفنكها عند رسول الله ﷺ ، فابى أن يرد عليه.';
const String p34 =
    'قال عوف: فاجتمعنا عند رسول الله فقصصت عليه قصة المددي ومافعل خالد فقال رسول الله ﷺ : يا خالد ما حملك على ماصنعت؟ قال: استكثرته فقال: رد عليه الذي أخذت منه، قال عوف: فقلت: دونكها يا خالد ألم أوف لك؟ فقال رسول الله ﷺ وماذلك؟ فأخبرته قال: فغضب رسول الله ﷺ وقال: ياخالد لا ترد عليه هل أنتم تاركون لي أمرائي لكم صفوة أمرهم وعليهم كدره.';
const String p35 =
    'هذا موقف عظيم من النبي ﷺ في حماية القادة والأمراء من أن يتعرضوا للإهانة بسبب الأخطاء التي قد تقع منهم فهم بشر معرضون للخطأ، فينبغي السعي في إصلاح خطئهم من غير تنقُّص ولا إهانة، فخالد حين يمنع ذلك المجاهد سلبه لم يقصد الإساءة إليه وإنما اجتهد فغلَّب جانب المصلحة العامة، حيث استكثر ذلك السلب على فرد واحد، ورأى أنه إذا دخل في الغنيمة العامة نفع عدداً أكبر من المجاهدين، وعوف بن مالك ادى مهمته في الإنكار على خالد، ثم رفع الأمر الى الى رسول الله ﷺ حينما لم يقبل خالد قوله، وكان المفترض أن تكون مهمته قد انتهت بذلك، لأنه -والحال هذه- قد دخل في أمر من أوامر الإصلاح، وقد تم الإصلاح على يده، ولكنه تجاوز هذه المهمة حيث حوّل القضية من قضية إصلاحية الى قضية شخصية، فأظهر شيئاً من التشفي من خالد ولم يقره النبي ﷺ على ذلك، بل أنكر عليه إنكاراً شديداً وبين حق الولاة على جنودهم، وكون النبي ﷺ أمرا خالداً بعد رد السلب على صاحبه لا يعني أن حق ذلك المجاهد قد ضاع، لأنه لايمكن أن يأخذ رسول الله ﷺ إنساناً بجريرة غيره، فلابد أن ذلك المجاهد قد حصل منه الرضى، إما بتعويض عن ذلك السلب أو بتنازل منه أو غير ذلك فيما لم يذكر تفصيله في الخبر.';
const String p36 =
    'إن الأمة التي لا تقدر رجالها ولا تحترمهم لايمكن أن يقوم فيها نظام إن التربية النبوية استطاعت بناء هذه الأمة بناءً سليماً، وما أحرى المسلمين اليوم أن يكون كل إنسان في مكانه وأن يحترم ويقدر بمقدار مايقدم لهذا الدين، ويبقى الجميع بعد ذلك في الاطار العام الذي وصف الله به المؤمنين: يَاأَيُّهَا الَّذِينَ ءَامَنُوا مَنْ يَرْتَدَّ مِنْكُمْ عَنْ دِينِهِ فَسَوْفَ يَأْتِي اللَّهُ بِقَوْمٍ يُحِبُّهُمْ وَيُحِبُّونَهُ أَذِلَّةٍ عَلَى الْمُؤْمِنِينَ أَعِزَّةٍ عَلَى الْكَافِرِينَ يُجَاهِدُونَ فِي سَبِيلِ اللَّهِ وَلا يَخَافُونَ لَوْمَةَ لائِمٍ ذَلِكَ فَضْلُ اللَّهِ يُؤْتِيهِ مَنْ يَشَاءُ وَاللَّهُ وَاسِعٌ عَلِيمٌ - سورة المائدة.';
const String p37 =
    'وفي قوله ﷺ : هل أنتم تاركون لي أمرائي وسام آخر يضاف الى خالد رضي الله عنه حيث عُدَّ من أمراء الرسول ﷺ وهذا من المنهاج النبوي الكريم في تقدير الرجال.';
const String p38 =
    'توقف الجيش الاسلامي في معان يناقش كثرة جيش العدو وكانت المقاييس المادية لا تشجعهم على خوض المعركة ومع ذلك تابعوا طريقهم ودخلوا بمقاييس إيمانية، فهم خرجوا يطلبون الشهادة فلماذا إذن يفرون مما خرجوا لطلبه، قال زيد بن أرقم: كنت يتيماً لعبدالله بن رواحة في حجره فخرج بي في سفره ذلك مُردْفي على حقيبة رحله، فو الله إنه ليسير ليلة إذ سمعته ينشد أبياتاً منها: وجاء المسلمون وغادروني.. بأرض الشام مُشتهى الثَّواء فلما سمعتها منه بكيت، قال: فخفقني بالدرة وقال: وما عليك يالُكَعْ أن يرزقني الله الشهاد وترجع بين شعبتي الرَّحل.';
const String p39 =
    'إن المتأمل بعمق في غزوة مؤتة يساعدنا في معالجة الهزيمة النفسية والروحية التي تمر بها الأمة وإقامة الحجة على القائلين بأن سبب هزيمتنا التفوق التكنولوجي لدى الأعداء لقد سجل ابن كثير رأيه في هذه المعركة وقال: هذا عظيم جداً أن يقاتل جيشان متعاديان في الدين أحدهما وهو الفئة التي تقاتل في سبيل الله -عدتها ثلاثة آلاف، وأخرى كافرة وعدتها مائتا ألف مقاتل من الروم مائة ألف ومن نصارى العرب مائة ألف، يتبارزون ويتصاولون ثم مع هذا كله لا يُقتل من المسلمين إلا اثنا عشر رجلاً، وقد قتل من المشركين خلق كثير، هذا خالد وحده يقول: لقد اندقَّت في يدي يوم مؤتة تسعة أسياف فما بقي في يدي إلا صفيحة يمانية، فماذا ترى قد قتل بهذه الأسياف كلها دع غيره من الأبطال والشجعان من حملة القرآن وقد تحكموا في عبدة الصلبان عليهم لعائن الرحمن في ذلك الزمان وفي كل أوان.';
