const int sectionIndex = 80;
const String sectionTitle = 'إلى الرفيق الأعلى';

const List t1 = ['1', 'إِنك مَيت وَإِنهُم مَيّتون'];
const List t2 = ['2', 'أشارت وفاته ﷺ'];
const List t3 = ['3', 'أبو بكر يصلي بالمسلمين'];
const List t4 = ['4', 'الساعات الأخيرة من حياة المصطفى'];
const List t5 = ['5', 'إلى الرفيق الأعلى'];
const List t6 = ['6', 'هول الفاجعة'];
const List t7 = ['7', 'صبر وثبات أبي بكر'];
const List t8 = ['8', 'بيعة أبي بكر بالخلافة'];
const List t9 = ['9', 'غُسل رسول الله ﷺ وكفنه والصلاة عليه'];
const List t10 = ['10', 'موقع دفنه وصفة قبره ﷺ'];
const List t11 = ['11', 'من باشر دفنه ومتى دفن ﷺ'];
const List t12 = ['12', 'يا أبتاه أجاب ربا دعاه'];
const List t13 = ['13', 'الخاتمة'];

const String p1 =
    'إن الأرواح الصادقة النقية لتدرك بعض ما يكون مخبوءاً وراء حُجب الغيب بقدرة الله  تعالى، وإن القلوب الطاهرة المطمئنة لتُحدث صاحبها بما عسى أن يحدث له فيما يستقبل من الزمان، والعقول الذكية المستنيرة بنور الإيمان لتدرك ما وراء الألفاظ والأحداث من إشارات وتلميحات، ولنبينا محمد ﷺ من هذه الصفات الحظ الأوفر، وهو منها بالمحل الأرفع الذي لا يسامى ولا يطاول.';

const String p2 =
    'قال تعالى: إِنَّكَ مَيِّتٌ وَإِنَّهُمْ مَيِّتُونَ - سورة الزمر ، قال ابن كثير: هذه الآية من الآيات التي استشهد بها الصديق رضي الله عنه عند موت الرسول ﷺ حتى تحقق الناس موته وقال تعالى: وَمَا جَعَلْنَا لِبَشَرٍ مِنْ قَبْلِكَ الْخُلْدَ أَفَإِنْ مِتَّ فَهُمُ الْخَالِدُونَ - سورة الأنبياء ، ثم أعقب ذلك ببيان أن الموت حتم لازم وقدر سابق فقال عزوجل: كُلُّ نَفْسٍ ذَائِقَةُ الْمَوْتِ وَنَبْلُوكُمْ بِالشَّرِّ وَالْخَيْرِ فِتْنَةً وَإِلَيْنَا تُرْجَعُونَ .';

const String p3 =
    'قال تعالى: وَمَا مُحَمَّدٌ إِلا رَسُولٌ قَدْ خَلَتْ مِنْ قَبْلِهِ الرُّسُلُ أَفَإِنْ مَاتَ أَوْ قُتِلَ انْقَلَبْتُمْ عَلَى أَعْقَابِكُمْ وَمَنْ يَنْقَلِبْ عَلَى عَقِبَيْهِ فَلَنْ يَضُرَّ اللَّهَ شَيْئًا وَسَيَجْزِي اللَّهُ الشَّاكِرِينَ - سورة آل عمران ، قال القرطبي: فأعلم الله تعالى في هذه الآية أن الرسل ليست بباقية في قومها أبداً وأنه يجب التمسك بما أتت به الرسل وإن فقد الرسل بموت أو قتل .';

const String p4 =
    'قال تعالى: الْيَوْمَ أَكْمَلْتُ لَكُمْ دِينَكُمْ وَأَتْمَمْتُ عَلَيْكُمْ نِعْمَتِي وَرَضِيتُ لَكُمُ الإِسْلامَ دِينًا - سورة المائدة ، وقد بكى عمر بن الخطاب حين نزلت الآية فقيل مايبكيك؟ فقال: إنه ليس بعد الكمال إلا النقصان!! وكأنه استشعر وفاة النبي ﷺ .';
const String p5 =
    'قالت عائشة رضي الله عنها: اجتمع نساء رسول الله ﷺ عنده لم يغادر منهن امرأة فجاءت فاطمة تمشي لاتخطئ مشيتها مشية أبيها فقال: مرحباً يابنيتي فأقعدها يمينه أو شماله، ثم سارّها فبكت ثم سارّها فضحكت، فقلت لها: خصَّك رسول الله بالسِّرار وأنت تبكين؟ فلما أن قامت قلت لها أخبريني ماسارّك؟ فقالت: ماكنت لأفشي سرّ رسول الله ﷺ ، فلما توفي قلت لها: أسألك لما لي عليك من الحق لما أخبرتيني، قالت: أما الآن فنعم قالت: سارّني في الأول قال لي: إن جبريل كان يعارضني في القرآن كل سنة مرة وقد عارضني في هذا العام مرتين ولا أرى ذلك إلا اقتراب أجلي، فاتقي الله واصبري فنعم السلف أنا لك، فبكيت ثم سارني فقال: أما ترضين أن تكوني سيدة نساء المؤمنين؟ فضحكت .';
const String p6 =
    'قال جابر رضي الله عنه: رأيت النبي ﷺ يرمي على راحلته يوم النحر ويقول: لتأخذوا مناسككم فإني لا أدري لعلي لا أحُجُّ بعد حجتي هذه، وقال النووي: فيه إشارة إلى توديعهم وإعلامهم بقرب وفاته ﷺ وحثهم على الاعتناء بالأخذ عنه وانتهاز الفرصة من ملازمته وتعلم أمور الدين وبهذا سميت حجة الوداع .';

const String p7 =
    'ولما اشتد المرض بالنبي ﷺ وحضرت الصلاة، فأذن بلال قال النبي ﷺ : مروا أبا بكر فليصلّ فقيل: إن أبا بكر رجل أسيف -رقيق القلب- إذا قام مقامك لم يستطع أن يصلي بالناس، وأعاد فأعادوا له فأعاد الثالثة فقال: إنكن صواحب يوسف مروا أبا بكر فليصل بالناس، فخرج أبو بكر فوجد النبي ﷺ في نفسه خفَّة، فخرج يهادي بين رجلين كأني أنظر إلى رجليه تخطان من الوجع، فأراد أبو بكر أن يتأخر فأومأ إليه النبي ﷺ أن مكانك ثم أتى به حتى جلس إلى جنبه، قيل للأعمش: فكان النبي ﷺ يصلي وأبو بكر يصلي بصلاته والناس يصلون بصلاة أبي بكر! فقال برأسه: نعم .';
const String p8 =
    'كان أبو بكر يصلي بالمسلمين حتى إذا كان يوم الإثنين وهم صفوف في صلاة الفجر، كشف النبي ﷺ ستر الحجرة ينظر إلى المسلمين وهم وقوف أمام ربهم، ورأى كيف أثمر غرس دعوته وجهاده وكيف نشأت أمة تحافظ على الصلاة وتواظب عليها بحضرة نبيها وغيبته، وقد قرت عينه بهذا المنظر البهيج وبهذا النجاح الذي لم يقدر لنبي أو داع قبله واطمأن أن صلة هذه الأمة بهذا الدين وعبادة الله تعالى صلة دائمة لاتقطعها وفاة نبيها، فملئ من السرور ما الله به عليم واستنار وجهه وهو منير، يقول الصحابة رضي الله عنهم: كشف النبي ﷺ ستر حجرة عائشة ينظر إلينا وهو قائم كأن وجهه ورقة مصحف ثم تبسم يضحك، فهممنا أن نفتتن من الفرح وظننا أن النبي ﷺ خارج إلى الصلاة، فأشار إلينا أن أتموا صلاتكم ودخل الحجرة وأرخى الستر وانصرف بعض الصحابة إلى أعمالهم ودخل أبو بكر على ابنته عائشة وقال: ما أرى رسول الله إلا قد أقلع عنه الوجع، وهذا يوم بنت خارجة -أحدى زوجتيه- وكانت تسكن بالسُّنح -خارج المدينة- فركب على فرسه وذهب إلى منزله .';
const String p9 =
    'واشتدت سكرات الموت بالنبي ﷺ ودخل عليه أسامة بن زيد وقد صمت فلا يقدر على الكلام، فجعل يرفع يديه إلى السماء ثم يضعها على أسامة فعرف أنه يدعو له، وأخذت السيدة عائشة رسول الله وأوسدته إلى صدرها بين سحرها ونحرها، فدخل عبدالرحمن بن أبي بكر وبيده سواك، فجعل رسول الله ينظر إليه فقالت عائشة: آخذه لك فأشار برأسه نعم، فأخذته من أخيها ثم مضغته ولينته وناولته إياه فاستاك به كأحسن مايكون الاستياك، وكل ذلك وهو لاينفك عن قوله: في الرفيق الأعلى وكان ﷺ يدخل يده في ركوة ماء أو علبة فيها ماء فيمسح بها وجهه ويقول: لا إله إلا الله .. إن للموت سكرات ثم نصب يده فجعل يقول في الرفيق الأعلى .. حتى قبض ومالت يده وفي لفظ أن النبي ﷺ كان يقول: اللهم أعني على سكرات الموت';
const String p10 =
    'وفارق رسول الله ﷺ الدنيا وهو يحكم جزيرة العرب ويرهبه ملوك الدنيا ويفديه أصحابه بنفوسهم وأولادهم وأموالهم، وماترك عند موته ديناراً ولا درهماً ولاعبداً ولا أمة ولاشيئاً إلا بغلته البيضاء وسلاحه وأرضاً جعلها صدقة ، وتوفي ﷺ ودرعه مرهونة عند يهودي بثلاثين صاعاً من شعير .';
const String p11 =
    'وكان ذلك يوم الاثنين 12 ربيع الأول سنة 11هـ للهجرة بعد الزوال وله ﷺ ثلاث وستون سنة، وكانت أشد الأيام سواداً ووحشة ومصابا على المسلمين ومحنة كبرى للبشرية.';
const String p12 =
    'يقول أنس رضي الله عنه: كان اليوم الذي قدم فيه رسول الله ﷺ المدينة أضاء منها كل شيء، فلما كان اليوم الذي مات فيه أظلم منها كل شيء وبكت أم أيمن فقيل لها مايبكيك على النبي قالت: إني قد علمت أن رسول الله ﷺ سيموت ولكن إنما أبكي على الوحي الذي رفع عنا .';
const String p13 =
    'قال ابن رجب: ولما توفي رسول الله ﷺ اضطرب المسلمون فمنهم من دُهش فخولط ومنهم من أقعد فلم يُطق القيام ومنهم من أعتُقل لسانه فلم يطق الكلام ومنهم من أنكر موته بالكلية .';

const String p14 =
    'وقال القرطبي مبيناً عظم هذه المصيبة: أن أعظم المصائب المصيبة في الدين .. قال رسول الله ﷺ : إذا أصاب أحدكم مصيبة فليذكر مصابه بي، فإنها أعظم المصائب وصدق رسول الله ﷺ لأن المصيبة به أعظم من كل مصيبة يصاب بها المسلم بعده إلى يوم القيامة، انقطع الوحي وماتت النبوة، وكان أول ظهور الشر بارتداد العرب وغير ذلك وكان أول انقطاع الخير وأول نقصانه .';
const String p15 =
    'لقد أذهل نبأ الوفاة عمر رضي الله عنه فصار يتوعد وينذر من يزعم أن النبي مات ويقول: مامات ولكنه ذهب إلى ربه كما ذهب موسى بن عمران فقد غاب عن قومه أربعين ليلة ثم رجع إليهم والله ليرجعنَّ رسول الله كما رجع موسى فليقطعن أيدي رجال وأرجلهم زعموا أنه مات.';
const String p16 =
    'ولما سمع أبو بكر الخبر أقبل على فرس من مسكنه بالسُّنح حتى نزل فدخل المسجد فلم يكلّم الناس حتى دخل على عائشة، فتيمَّم رسول الله ﷺ وهو مُغشّى بثوب حِبَرة فكشف عن وجهه ثم أكبَّ عليه فقبله وبكى ثم قال: بأبي أنت وأمي والله لا يجمع الله عليه موتتين أما الموتة التي عليك فقد متها وخرج أبو بكر وعمر يتكلم فقال: اجلس ياعمر وهو ماض في كلامه وفي ثورة غضبه، فقام أبو بكر في الناس خطيباً بعد أن حمد الله وأثنى عليه:';
const String p17 =
    'أما بعد: فإن من كان يعبد محمداً فإن محمداً قد مات ومن كان يعبد الله فإن الله حي لايموت ثم تلا الآية: وَمَا مُحَمَّدٌ إِلا رَسُولٌ قَدْ خَلَتْ مِنْ قَبْلِهِ الرُّسُلُ أَفَإِنْ مَاتَ أَوْ قُتِلَ انْقَلَبْتُمْ عَلَى أَعْقَابِكُمْ وَمَنْ يَنْقَلِبْ عَلَى عَقِبَيْهِ فَلَنْ يَضُرَّ اللَّهَ شَيْئًا وَسَيَجْزِي اللَّهُ الشَّاكِرِينَ - سورة آل عمران';
const String p18 =
    'قال عمر: فوالله ما إن سمعت أبا بكر تلاها فهويت إلى الأرض ماتحملني قدماي وعلمت أن رسول الله ﷺ قد مات .';
const String p19 =
    'قال القرطبي: هذه الآية أدل دليل على شجاعة الصديق وجراءته فإن الشجاعة والجرأة حدُّهما ثبوت القلب عند حلول المصائب ولامصيبة أعظم من موت النبي ﷺ فظهرت شجاعته وعلمه قال الناس: لم يمت رسول الله ﷺ منهم عمر وخرس عثمان واستخفى علي واضطرب الأمر فكشفه الصديق بهذه الآية حين قدومه من مسكنه بالسُّنح .';

const String p20 =
    'بايع المسلمون أبا بكر بالخلافة في سقيفة بني ساعدة حتى لايجد الشيطان سبيلاً إلى تفريق كلمتهم وتمزيق شملهم ولاتلعب الأهواء بقلوبهم، وليفارق رسول الله ﷺ هذه الدنيا وكلمة المسلمين واحدة وشملهم منتظم وعليهم أمير يتولى أمورهم، ومنها تجهيز رسول الله ﷺ ودفنه.';
const String p21 =
    'قالت عائشة رضي الله عنها: لما أرادوا غسل النبي ﷺ قالوا: ماندري أنجرّده من ثيابه كما نجرد موتانا أو نغسله وعليه ثيابه، فلما اختلفوا ألقى الله عليهم النوم حتى مامنهم رجل إلا وذقنه في صدره فكلمهم مكلم من ناحية البيت لا يدرون من هو !! أن اغسلوا رسول الله ﷺ وعليه ثيابه فغسلوه وعليه قميصه يصبون الماء فوق القميص ويدلكون بالقميص دون أيديهم، قالت عائشة: لو استقبلت من أمري ما استدبرت ماغسَّله إلا نساؤه .';
const String p22 =
    'وكفن ﷺ في ثلاثة أثواب سحولية من ثياب سحول -بلدة باليمن- ليس فيها قميص ولاعمامة وقد صلى عليه المسلمون قال ابن عباس: لما مات رسول الله ﷺ أدخل الرجال فصلوا عليه بغير إمام أرسالاً حتى فرغوا، ثم أدخل النساء فصلين عليه، ثم أدخل الصبيان فصلوا عليه، ثم أدخل العبيد فصلوا عليه أرسالاً لم يؤمهم على رسول الله ﷺ أحد ، وقال ابن كثير: وهذا الصنيع وهو صلاتهم عليه فرادى لم يؤمهم أحد عليه أمر مجمع عليه لاخلاف فيه .';
const String p23 =
    'اختلف المسلمون في موقع دفنه فقال بعضهم يدفن عند المنبر وقال آخرون بالبقيع، وقال قائل في مصلاه، فجاء أبو بكر الصديق رضي الله عنه فحسم مادة هذا الخلاف أيضاً بما سمعه من رسول الله ﷺ قالت عائشة وابن عباس: لما قُبض رسول الله ﷺ وغسل اختلفوا في دفنه فقال أبو بكر: مانسيتُ ماسمعت من رسول الله ﷺ يقول: ماقبض الله نبياً إلا في الموضع الذي يجب أن يدفن فيه ادفنوه في موضع فراشه، وهذا الحديث وإن كان مختلف في صحته إلا أن دفن النبي ﷺ في موضعه الذي توفى فيه أمر مجمع عليه.';
const String p24 =
    'وقال ابن كثير: قد علم بالتواتر أنه عليه الصلاة والسلام دفن في حجرة عائشة التي كانت تختص بها شرقي مسجده في الزاوية الغربية القبلية من الحجرة ثم دفن فيها أبو بكر ثم عمر رضي الله عنهما .';
const String p25 =
    'وقد لحد قبر رسول الله ﷺ وقد أجمع العلماء على أن اللحد -الشَّقُّ يكون في جانب القبر للميِّت- والشق -أي يحفر في وسط الأرض- جائزان لكن إذا كانت الأرض صلبة لاينهار ترابها فاللحد أفضل وإن كانت رخوة تنهار فالشق أفضل .';
const String p26 =
    'وأما الذين باشروا دفنه ﷺ قال ابن اسحاق: وكان الذين نزلوا في قبر رسول الله ﷺ علي بن أبي طالب والفضل بن عباس وقُثَم بن عباس وشقران مولى رسول الله ﷺ وزاد النووي والمقدسي : العباس قال النووي: ويقال: كان أسامة بن زيد وأوس بن خَوْلي معهم، ودفن في اللحد وبنى عليه ﷺ في لحده اللَّبن يقال إنها تسع لبنات ثم أهالوا التراب، وأما وقت دفنه فقد ذهب كثير من العلماء إلى أنه دفن ليلة الأربعاء قال ابن كثير: والمشهور عن الجمهور ما أسلفناه من أنه عليه السلام توفي يوم الإثنين ودفن ليلة الأربعاء .';
const String p27 =
    'لقد كان لوفاة رسول الله ﷺ أثر على الصحابة الكرام فقد قال أنس رضي الله عنه: ... وما نفضنا عن النبي ﷺ الأيدي -إنا لفي دفنه- حتى أنكرنا قلوبنا .';
const String p28 =
    'وقد ورد أن فاطمة رضي الله عنها قالت: واكرب أباه فقال لها: ليس على أبيك كرب بعد اليوم فلما مات قالت: يا أبتاه أجاب ربا دعاه، يا أبتاه جنة الفردوس مأواه، يا أبتاه إلى جبريل ننعاه .. فلما دفن ﷺ قالت لأنس كيف طابت أنفسكم أن تحثوا على رسول الله ﷺ التراب .';
const String p29 =
    'وبعد فهذا مايسره الله لي من جمع وترتيب وتحليل تضمنتها فصول هذا الكتاب فيما يتعلق بالسيرة النبوية دروس وعبر في تربية الأمة وبناء الدولة فما كان فيه من صواب فهو محض فضل الله عليَّ فله الحمد والمنة وما كان فيه من خطأ فاستغفر الله تعالى وأتوب إليه والله ورسوله برئ منه وحسبي أني كنت حريصاً أن لا أقع في الخطأ وعسى أن لا أُحرم من الأجر.';
const String p30 =
    'وأدعو الله تعالى أن ينفع بهذا الكتاب إخواني المسلمين وأن يذكرني من يقرأه في دعائه فإن دعوة الأخ لأخيه في ظهر الغيب مستجابة إن شاء الله تعالى وأختم هذا الكتاب بقول الله تعالى: رَبَّنَا اغْفِرْ لَنَا وَلإِخْوَانِنَا الَّذِينَ سَبَقُونَا بِالإِيمَانِ وَلا تَجْعَلْ فِي قُلُوبِنَا غِلا لِلَّذِينَ ءَامَنُوا رَبَّنَا إِنَّكَ رَءُوفٌ رَحِيمٌ .';
const String p31 =
    'سبحانك اللهم وبحمدك أشهد أن لا إله إلا أنت أستغفرك وأتوب إليك .';
