const int sectionIndex = 43;
const String sectionTitle = 'دومة الجندل';

const List t1 = ['1', 'غزوة بدر الموعد'];
const List t2 = ['2', 'إلقاء الرعب'];
const List t3 = ['3', 'غزوة دومة الجندل'];
const List t4 = ['4', 'سبب الخروج'];
const List t5 = ['5', 'الذهاب لدومة الجندل'];
const List t6 = ['6', 'قوة المسلمين'];
const List t7 = ['7', 'أرض جديدة'];
const List t8 = ['8', 'خطة الرسول ﷺ'];
const List t9 = ['9', 'التدريب العسكري'];
const List t10 = ['10', 'معركة صامتة وتربية هادئة'];

const String p1 =
    'تنفيذاً للموعد الذي كان أبو سفيان قد اقترحه في أعقاب معركة أحد، والتزام الرسول ﷺ بذلك، فقد خرج النبي ﷺ من المدينة على رأس جيش من أصحابه قوامه ألف وخمسمائة مقاتل بينهم عشرة من الخيالة وذلك في ذي القعدة سنة 4هـ وحمل لواء الجيش علي بن أبي طالب رضي الله عنه فوصلوا بدراً فأقاموا فيها ثمانية أيام بانتظار وصول قوات المشركين من قريش بقيادة أبي سفيان بحسب الموعد بين الطرفين، غير أن أحداً من المشركين لم يصل إلى بدر، وكان أبو سفيان قد جمّع قوات قريش وحلفائها التي تألفت من ألفي مقاتل معهم خمسون فرساً، فلما وصلوا إلى مر الظهران، نزلوا على مياه مجنّة على بعد أربعين ميلاً من مكة ثم عاد لهم أبو سفيان إلى مكة بعد أن خطب فيهم وقال: يامعشر قريش إنه لايصلحكم إلا عام خصيب ترعون فيه الشجر، وتشربون فيه اللبن وإن عامكم هذا عام جدب وإني راجع فارجعوا وأقبل مخشي بن عمرو الضمري وهو الذي وادع رسول الله ﷺ على بني ضمرة في غزوة ودان، فالتقى برسول الله ﷺ في بدر وقال: يامحمد أجئت للقاء قريش على هذا الماء؟ قال نعم يا أخا بني ضمرة، وإن شئت مع ذلك رددنا إليك ماكان بيننا وبينك، ثم جالدناك حتى يحكم الله بيننا وبينك قال: لا والله يامحمد مالنا بذلك منك من حاجة.';
const String p2 =
    'ففي هذا اللقاء أكد رسول الله ﷺ على معنى كبير في اظهار قوة المسلمين، وأن العقد الذي كان بين الفريقين يستمر بعامل قوة المسلمين لابعامل ضعفهم وبناء على طلب الطرف الثاني وفي هذا مافيه من القوة للمسلمين وإلقاء الرعب في قلوب أعدائهم لقد كانت تحركات الجيش الإسلامي من المدينة حتى بدر مناورة رائعة ناجحة أثبت بها وجوده وأعطى الدليل القاطع لأعداء الإسلام داخل المدينة وخارجها، أنه أصبح أقوى قوة مرهوبة في الجزيرة العربية كلها، ولا أدّل على ذلك من أن جيش مكة، وهو من أعظم الجيوش في الجزيرة من حيث كثرة العدد وقوة التنظيم وجودة التسلح قد هاب الجيش الإسلامي ونكل عن حربه بعد أن خرج للقائه بموجب ميعاد سابق حدده في أحد قائد عام جيش مكة.';
const String p3 =
    'كانت غزوة دومة الجندل من ضمن حركة تثبيت أركان الدولة الإسلامية، فبعد غزوة بدر الموعد تحركت القوات الإسلامية بقيادة رسول الله ﷺ نحو قضاعة التي كانت تنزل شمال قبائل أسد وغطفان، وفي حدود الغساسنة الموالين للدولة الرومية بيزنطة ولها إشراف على سوق دومة الجندل الشهير على بعد 450 كيلومتراً شمال المدينة، كانت هذه القبيلة أول من احتك بها المسلمون فغزاها رسول الله تلك الغزوة المعروفة بغزوة دومة الجندل ربيع الأول 5هـ/أغسطس 626م، فقد وصلت الأنباء إلى المدينة بتجمع بعض القبائل عند دومة الجندل للإغارة على القوافل التي تمر بهم، والتعرض لمن في القافلة بالأذى والظلم، كما وردت الأنباء بأنهم يفكرون في القرب من المدينة لعجم عودها.';
const String p4 =
    'إن دومة الجندل تعتبر بلاد نائية بالنسبة للمدينة المنورة، لأنها تقع على الحدود بين الحجاز والشام وفي منتصف الطريق بين البحر الأحمر والخليج العربي وهي على مسيرة ست عشرة ليلة من المدينة، ولو أن المسلمين أغفلوا أمرها وسكتوا على وجود هذا التجمع فيها ما لامهم أحد ولاضرهم هذا التجمع في شيء على المدى القريب ولكن النظرة السياسية البعيدة والعقلية العسكرية الفذة أوجبت على المسلمين أن يتحركوا لفض هذا التجمع والقضاء عليه قبل أن يستفحل شأنه.';
const String p5 =
    'أن السكوت على هذا التجمع وماشاكله يؤدي بلاشك إلى تطوره واستفحاله، ثم يؤدي بعد ذلك إلى إضعاف قوة المسلمين وإسقاط هيبتهم.';
const String p6 =
    'وجود مثل هذا التجمع في الطريق إلى الشام قد يؤثر على الوضع الإقتصادي للمسلمين.';
const String p7 =
    'فرض نفوذ المسلمين على هذه المنطقة كلها، وإشعار سكانها بأنهم في حمايتهم وتحت مسؤوليتهم، لذلك فهم يؤمنون لهم الطرق، ويحمون لهم تجارتهم ويحاربون كل إرهاب من شأنه أن يزعجهم أو يعرضهم للخطر.';
const String p8 =
    'حرمان قريش من أي حليف تجاري قد يمدها بما تحتاج من التجارة، وصرف أنظارهم عن هذه المنطقة التجارية الهامة، لأن ظهور الدولة الإسلامية بهذه القوة يؤثر على نفسية قريش العدو الأول للدولة الإسلامية ويجعلها تخشى المسلمين على تجارتها.';
const String p9 =
    'الحرص على إزالة الرهبة النفسية عند العرب الذين ماكانوا يحلمون بمواجهة الروم، والتأكيد عملياً للمسلمين بأن رسالتهم عالمية وليست مقصورة على العرب.';
const String p10 =
    'ندب رسول الله ﷺ المسلمين للخروج وخرج في ألف من أصحابه وكان يسير الليل، ويكمن النهار حتى يخفي مسيره ولاتشيع أخباره وتنقل أسراره وتتعقبه عيون الأعداء.';
const String p11 =
    'واتخذ له دليلاً من بني عذرة يسمى مذكور وسار حتى دنا من القوم عندئذ تفرقوا، ولم يلق رسول الله ﷺ منهم أحداً، فقد ولوا مدبرين وتركوا نعمهم وماشيتهم غنيمة باردة للمسلمين وأسر المسلمون رجلاً منهم، واحضروه إلى الرسول فسأله عنهم، فقال: هربوا لما سمعوا بأنك أخذت نعمهم، فعرض عليه رسول الله ﷺ الإسلام فأسلم وأقام بساحتهم أياماً، وبعث البعوث وبث السرايا وفرق الجيوش، فلم يصب منهم أحد وعاد المسلمون إلى المدينة، وفي أثناء عودتهم وادع الرسول عيينة بن حصن الفزاري واستأذن عيينة رسول الله في أن ترعى إبله وغنمه في أرض قريبة من المدينة على ستة وثلاثين ميلاً منها.';
const String p12 =
    'إن وصول جيوش المسلمين إلى دومة الجندل، وهي على هذه المسافة البعيدة من المدينة وموادعة عيينة بن حصن للمسلمين، واستئذانه في أن يرعى بإبله وغنمه في أرض بينها وبين المدينة ستة وثلاثون ميلاً -أي مايقرب من خمسة وستين كيلومتراً- لدليل قاطع على ماوصت إليه قوة المسلمين، وعلى شعورهم بالمسؤولية الكاملة تجاه تأمين الحياة للناس في هذه المنطقة، وأن هذه المناطق النائية كانت ضمن الدولة الإسلامية، وأن الدولة أصبحت منيعة ليس في مقدور أحد أن يعتدي عليها، ولو كان ذلك في استطاعة أحد لكان هو عيينة بن حصن الذي كان يغضب لغضبه عشرة آلاف فتى.';
const String p13 =
    'كانت غزوة دومة الجندل بعيدة عن المدينة من جهة الشام، إذ بينها وبين دمشق مالايزيد عن خمس ليال، وقد كانت بمثابة إعلان عن دعوة الإسلام بين سكان البوادي الشمالية وأطراف الشام الجنوبية، وأحسوا بقوة الإسلام وسطوته كما كانت لقيصر وجنده، كما أن سير الجيش الإسلامي هذه المسافات الطويلة قد كان فيه تدريب له على السير إلى الجهات النائية، وفي أرض لم يعهدوها من قبل ولذلك تعتبر هذه الغزوة فاتحة سير الجيوش الإسلامية للفتوحات العظيمة في بلاد آسيا وإفريقيا فيما بعد.';
const String p14 =
    'كانت خطة الرسول ﷺ في هذه الغزوة ترمي إلى أهداف عديد فهي غزوة وحرب استطلاعية تمسح الجزيرة العربية، وتتعرف على مراكز القوى فيها وهي حرب إعلامية تأتي على أعقاب بدر الموعد، وتستثمر انتصاراتها وهي حرب عسكرية تريد أن تصد هجوماً محتملاً على المسلمين حيث ضوى إليها قوم من العرب كثير يريدون أن يدنوا من المدينة، وهي حرب سياسية تريد أن تجهض من تحركات القبائل المحتمل أن تتحرك بعد أنباء غزوة أحد لتقصد المدينة وتسبيحها.';
const String p15 =
    'كان رسول الله ﷺ بين يديه ألف من أصحابه يتلقون كل لحظة دروساً في الطاعة والانضباط، ودروساً في التدريب الجسمي والعسكري والتحمل لمشاق الحياة وصعوباتها، وأحكاماً وفقهاً في الحلال والحرام، وعمليات صهر وتذويب لقواعد الجيش الإسلامي في بوتقة واحدة خارج إطار العشيرة، وخارج كيان القبيلة حيث أخذت تفد إلى المدينة عناصر كثيرة من أبناء القبائل المجاورة، والتخلي عن الأطر القبلية وعصاباتها للإنصهار في بوتقة الأمة الواحدة التي تجعل الولاء لله ورسوله وفوق هذا كله تتيح الفرصة لجيل بدر الرائد أن يقوم بمهمة التربية للوافدين الجدد وتعليمهم وتثقيفهم، كما تتيح الفرصة لكشف ضعاف النفوس، ومن له صلة بمعسكر النفاق من خلال مراقبة تصرفاته وسلوكه إنها ليست ساعات محدودة أو أياماً معدودة بل هي دورة قرابة شهر، لايمكن إلا أن تبرز فيها كل الطبائع وكل النوازع، فيتلقاها عليه الصلاة والسلام ليصوغها على ضوء الإسلام ويعلم الجيل الرائد فن القيادة وعظمة السياسة.';
const String p16 =
    'كانت معركة صامتة وتربية هادئة، وكان الجيش مع قائده يقطع ماينوف عن ألف ميل في هذه الصحراء يتربى ويتثقف ويتدرب ويمتحن ويقوّم ليكون هذا استعداداً لمعارك قادمة وفي غيابه في غزوة دومة الجندل عين ﷺ سباع بن عرفطة الغفاري والياً على المدينة في تجربة جديدة، فهو ليس أوسياً ولاخزرجياً ولاقرشياً بل من غفار التي كانت تعتبر من سراق الحجيج عند العرب، فلابد لهذا الجيل أن يتربى على الطاعة والإنضباط للأمير أياً كان شأن هذا الأمير وهذا يدل على عظمة المنهج النبوي في تربية الأمة والإرتقاء بها وعلى عظمة قيادة النبي وفراسته في اتباعه وثقته فيهم ومعرفته لمواهبهم، فهو ﷺ على معرفة بكفاءة سباع بن عرفطة الغفاري وعبقريته وقدرته على الإدارة الحازمة، فكان ﷺ يربي أصحابه وهو غائب عن المدينة لكي يهيمن منهج رب العالمين على المسلمين ويصنع منها أمة واحدة تسمع وتطيع لكتاب ربها وسنة نبيها.';
