const int sectionIndex = 75;
const String sectionTitle = 'غزوة تبوك - موت زعيم المنافقين';

const List t1 = ['1', 'مرض ابن سلول'];
const List t2 = ['2', 'ابنه عبدالله وقميص رسول الله ﷺ'];
const List t3 = ['3', 'حكم الظاهر'];
const List t4 = ['4', 'تراجع حركة النفاق'];
const List t5 = ['5', 'الأحكام التي برزت ضد المنافقين'];

const String p1 =
    'مرض عبدالله بن أبي سلول رأس المنافقين في ليال بقين من شوال ومات في ذي القعدة من السنة التاسعة.';
const String p2 =
    'قال أسامة بن زيد: دخلت مع رسول الله ﷺ على عبدالله بن أبي في مرضه نعوده فقال له النبي ﷺ : قد كنت أنهاك عن حب يهود فقال عبدالله: فقد أبغضهم سعد بن زرارة فمات.';
const String p3 =
    'ولما مات عبدالله بن أبي جاءه ابنه عبدالله بن عبدالله إلى رسول الله ﷺ ، فسأله أن يعطيه قميصه يكفن فيه أباه فأعطاه ثم سأله أن يصلي عليه فقام رسول الله ﷺ ليصلي عليه فقام عمر فأخذ بثوب رسول الله ﷺ فقال: يارسول الله تصلي عليه؟ وقد نهاك ربك أن تصلي عليه فقال رسول الله ﷺ : إنما خيرني الله فقال: اسْتَغْفِرْ لَهُمْ أَوْ لا تَسْتَغْفِرْ لَهُمْ إِنْ تَسْتَغْفِرْ لَهُمْ سَبْعِينَ مَرَّةً فَلَنْ يَغْفِرَ اللَّهُ لَهُمْ ذَلِكَ بِأَنَّهُمْ كَفَرُوا بِاللَّهِ وَرَسُولِهِ وَاللَّهُ لا يَهْدِي الْقَوْمَ الْفَاسِقِينَ ، وسأزيده على سبعين قال: إنه منافق قال فصلى عليه رسول الله ﷺ ، فأنزل الله عزوجل وَلا تُصَلِّ عَلَى أَحَدٍ مِنْهُمْ مَاتَ أَبَدًا وَلا تَقُمْ عَلَى قَبْرِهِ إِنَّهُمْ كَفَرُوا بِاللَّهِ وَرَسُولِهِ وَمَاتُوا وَهُمْ فَاسِقُونَ - سورة التوبة';
const String p4 =
    'وإنما صلى عليه رسول الله ﷺ إجراء له على حكم الظاهر، وهو الإسلام ولما فيه من اكرام ولده عبدالله -وكان من خيار الصحابة وفضلائهم- وهو الذي عرض على النبي أن يقتل أباه لما قال مقالته يوم غزوة بني المصطلق، كما بينا ولما فيه من مصلحة شرعية وهو تأليف قلوب قومه وتابعيه، فقد كان يدين له بالولاء فئة كبيرة من المنافقين، فعسى أن يتأثروا ويرجعوا عن نفاقهم ويعتبروا ويخلصوا لله ولرسوله ولو لم يجب ابنه وترك الصلاة عليه قبل ورود النهي الصريح لكان سبة وعاراً على ابنه وقومه، فالرسول الكريم اتبع احسن الأمرين في السياسة إلى أن نهي فانتهى.';
const String p5 =
    'وإما إعطاؤه ﷺ القميص فلأن الغنى به بخل بالكرم، وقد كان من خلق رسول الله ﷺ أن لا يرد طالب حاجة قط على أنه كان مكافأة له على إعطائه العباس عم الرسول قميصه لما جئ به أسيراً يوم بدر، وكان من خلق رسول الله ﷺ وآل بيته رد الجميل بخير منه.';
const String p6 =
    'بموت عبدالله بن سلول تراجعت حركة النفاق في المدينة، حتى أننا لم نجد لهم حضوراً بارزاً في العام العاشر للهجرة ولم يبق إلا العدد غير المعروف إلا لصاحب سر رسول الله ﷺ حذيفة بن اليمان، وكان عمر فيما بعد لايصلي على جنازة من جهل حاله حتى يصلي عليه حذيفة بن اليمان لأنه كان يعلم أعيان المنافقين وقد أخبره رسول الله بهم.';
const String p7 =
    'كان العام التاسع حاسماً لحركة النفاق في المجتمع الإسلامي فقد وصل النظام الإسلامي إلى قوته، ومن ثم لابد من تحديد إطار التعامل مع كل القوى بوضوح، ولهذا عبر الإمام ابن القيم عن خطة الإسلام أمام المنافقين فإنه أُمر أن يقبل منهم علانيتهم ويكل سرائرهم إلى الله، وأن يجاهدهم بالعلم والحجة وأمر أن يعرض عنهم ويغلظ عليهم وأن يبلغ بالقول البليغ إلى نفوسهم ونهى أن يصلي عليهم وأن يقوم على قبورهم وأخبر أنه إن استغفر لهم فلن يغفر الله لهم.';
const String p8 =
    'وجاءت هذه الخطة وفق النصوص القرآنية التي احتوتها سورة التوبة براءة فاضحة، حيث يستغرق الحديث عن المنافقين أكثر من نصف السورة فيفضح نواياهم وأعمالهم ووصف أحوالهم النفسية والقلبية، وموقفهم في غزوة تبوك وقبلها وفي أثناءها وماتلاها وكشف حقيقة حيلهم ومعاذيرهم في التخلف عن الجهاد وبث الضعف والفتنة والفرقة في الصفوف وإيذاء رسول الله ﷺ بالقول والعمل.';
const String p9 =
    'عدم الصلاة على من مات منهم ودمغهم بالكفر: وَلا تُصَلِّ عَلَى أَحَدٍ مِنْهُمْ مَاتَ أَبَدًا وَلا تَقُمْ عَلَى قَبْرِهِ إِنَّهُمْ كَفَرُوا بِاللَّهِ وَرَسُولِهِ وَمَاتُوا وَهُمْ فَاسِقُونَ وَلا تُعْجِبْكَ أَمْوَالُهُمْ وَأَوْلادُهُمْ إِنَّمَا يُرِيدُ اللَّهُ أَنْ يُعَذِّبَهُمْ بِهَا فِي الدُّنْيَا وَتَزْهَقَ أَنْفُسُهُمْ وَهُمْ كَافِرُونَ - سورة التوبة';
const String p10 =
    'تهديم مسجدهم الذي بنوه للإضرار بين المسلمين وهو مسجد الضرار وإصدار الأمر بمجاهدة المنافقين كمجاهدة الكافرين.';
const String p11 =
    'ياأَيُّهَا النَّبِيُّ جَاهِدِ الْكُفَّارَ وَالْمُنَافِقِينَ وَاغْلُظْ عَلَيْهِمْ وَمَأْوَاهُمْ جَهَنَّمُ وَبِئْسَ الْمَصِيرُ - سورة التحريم ، وسواء أكان الجهاد بالقتال أم في المعاملة والمواجهة والكشف والفضح فإن طريقة التعامل مع المنافقين بعد سورة براءة غير المعاملة قبلها.';
const String p12 =
    'الكشف عن صفاتهم وأعمالهم بوضوح كما جاء في - سورة التوبة أيضاً فهم الذين قالوا تثبيطاً للمسلمين: فَرِحَ الْمُخَلَّفُونَ بِمَقْعَدِهِمْ خِلافَ رَسُولِ اللَّهِ وَكَرِهُوا أَنْ يُجَاهِدُوا بِأَمْوَالِهِمْ وَأَنْفُسِهِمْ فِي سَبِيلِ اللَّهِ وَقَالُوا لا تَنْفِرُوا فِي الْحَرِّ قُلْ نَارُ جَهَنَّمَ أَشَدُّ حَرًّا لَوْ كَانُوا يَفْقَهُونَ - سورة التوبة';
